[
  {
    "Id": 1,
    "source": "YouTube",
    "region": "US",
    "title": "Grand Theft Auto VI Trailer 2",
    "description": "Vice City, USA. Jason and Lucia have always known the deck is stacked against them. But when an easy score goes wrong, they find themselves on the darkest side of the sunniest place in America, in the middle of a criminal conspiracy stretching across the state of Leonida forced to rely on each other more than ever if they want to make it out alive. Explore Vice City and beyond at Song Hot Together Artist The Pointer Sisters Written by Sharon Robinson Published by Universal Music Corp. on behalf of itself, Buchu Music and Robinhill Music (ASCAP) Courtesy of RCA Records, a division of Sony Music Entertainment",
    "category": "Gaming",
    "publishedAt": "2025-05-06T13:29:04Z",
    "channelTitle": "Rockstar Games",
    "viewCount": "57433736",
    "likeCount": "4541253",
    "commentCount": "405700",
    "duration": "PT2M47S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.04166666666666666,
    "importance": 1.0,
    "relevance": 0.295,
    "authenticity": 0.333,
    "info_gain": 0.526,
    "keywords": [
      "music",
      "city",
      "vice",
      "alive",
      "america"
    ]
  },
  {
    "Id": 2,
    "source": "YouTube",
    "region": "US",
    "title": "Live at Met Gala 2025 With Vogue",
    "description": "Presented by e Bay 1800 Tequila The 2025 Met Gala celebrates the Costume Institutes new exhibition, Superfine Tailoring Black Style. Singer and actor Teyana Taylor, actor and producer La La Anthony, and actor and comedian Ego Nwodim host this years livestream.",
    "category": "Howto & Style",
    "publishedAt": "2025-05-06T00:54:23Z",
    "channelTitle": "Vogue",
    "viewCount": "12530479",
    "likeCount": "189931",
    "commentCount": "7403",
    "duration": "PT2H46M28S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.12651515151515152,
    "importance": 0.0,
    "relevance": 0.695,
    "authenticity": 0.333,
    "info_gain": 0.255,
    "keywords": [
      "actor",
      "2025",
      "gala",
      "la",
      "met"
    ]
  },
  {
    "Id": 3,
    "source": "YouTube",
    "region": "US",
    "title": "Squid Game Season 3 Official Teaser Netflix",
    "description": "Its time to play the final games. Squid Game Season 3. June 27. Only on Netflix. More info on Squid Game Season 3 A failed rebellion, the death of a friend, and a secret betrayal. Picking up in the aftermath of Season 2s bloody cliffhanger, the third and final season of Netflixs most popular series finds Gihun, a.k.a. Player 456, at his lowest point yet. But the Squid Game stops for no one, so Gihun will be forced to make some important choices in the face of overwhelming despair as he and the surviving players are thrust into deadlier games that test everyones resolve. With each round, their choices lead to increasingly grave consequences. Meanwhile, Inho resumes his role as Front Man to welcome the mysterious VI Ps, and his brother Junho continues his search for the elusive island, unaware theres a traitor in their midst. Will Gihun make the right decisions, or will Front Man finally break his spirit? Director Hwang Donghyuk, who made history at the 74th Primetime Emmys, becoming the first Asian to win Outstanding Directing for a Drama Series, once again helms the series as director, writer, and producer. Season 3 stars Lee Jungjae, Lee Byunghun, Yim Siwan, Kang Haneul, Wi Hajun, Park Gyuyoung, Park Sunghoon, Yang Donggeun, Kang Aesim, Jo Yuri, Chae Kukhee, Lee David, Roh Jaewon, and Jun Sukho, with special appearance by Park Heesoon. Watch on Netflix About Netflix Netflix is one of the world's leading entertainment services, with over 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. Squid Game Season 3 Official Teaser Netflix",
    "category": "Entertainment",
    "publishedAt": "2025-05-05T22:58:06Z",
    "channelTitle": "Netflix",
    "viewCount": "8219384",
    "likeCount": "399521",
    "commentCount": "28813",
    "duration": "PT1M25S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.070995670995671,
    "importance": 1.0,
    "relevance": 0.109,
    "authenticity": 0.333,
    "info_gain": 0.442,
    "keywords": [
      "season",
      "netflix",
      "game",
      "squid",
      "series"
    ]
  },
  {
    "Id": 4,
    "source": "YouTube",
    "region": "US",
    "title": "Scottie Scheffler Vs Grant Horvat (Stroke Play)",
    "description": "In Today's video Grant Horvat challenges Scottie Scheffler the number 1 golfer in the world to a 18 Hole golf match. Subscribe to Taylor Made Qi35 Family Scottie Taylor Made Want Golf Clothes? Use My Code (Grant15) for a Discount! My Second Channel! Get Your Taylormade Equipment Here! My Socials My Editor",
    "category": "Sports",
    "publishedAt": "2025-05-05T16:00:01Z",
    "channelTitle": "Grant Horvat Golf",
    "viewCount": "2027188",
    "likeCount": "71946",
    "commentCount": "8471",
    "duration": "PT1H27M32S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 0.0,
    "relevance": 0.565,
    "authenticity": 0.333,
    "info_gain": 0.308,
    "keywords": [
      "scottie",
      "golf",
      "grant",
      "horvat",
      "scheffler"
    ]
  },
  {
    "Id": 5,
    "source": "YouTube",
    "region": "US",
    "title": "We Met Our Girlfriend's Parents and They Hated Us 3!",
    "description": "TRY HAPPY DAD (21 Only) FULL SEND, UFC AND TRUMP MERCH AVAILABLE on FULLSEND community coin! Check Out Moonpay Check Out Prize Picks Try Bored Jerky Subscribe to FULL SEND PODCAST on You Tube INSTAGRAM TWITTER TIKTOK Happy Dad on You Tube",
    "category": "Comedy",
    "publishedAt": "2025-05-05T23:55:07Z",
    "channelTitle": "NELK",
    "viewCount": "1787962",
    "likeCount": "145874",
    "commentCount": "4815",
    "duration": "PT23M17S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.1625,
    "importance": 1.0,
    "relevance": 0.641,
    "authenticity": 0.333,
    "info_gain": 0.295,
    "keywords": [
      "check",
      "dad",
      "happy",
      "send",
      "try"
    ]
  },
  {
    "Id": 6,
    "source": "YouTube",
    "region": "US",
    "title": "FEEDING STARVING CELEBRITES FT. KALI UCHIS",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-05-05T19:18:51Z",
    "channelTitle": "Quenlin Blackwell",
    "viewCount": "1288576",
    "likeCount": "101298",
    "commentCount": "6022",
    "duration": "PT50M26S",
    "definition": "hd",
    "language": "de",
    "translated": "FEEDING STARVING CELEBRITES FT. KALI UCHIS ",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.034,
    "keywords": [
      "celebrites",
      "feeding",
      "ft",
      "kali",
      "starving"
    ]
  },
  {
    "Id": 7,
    "source": "YouTube",
    "region": "US",
    "title": "Met Gala 2025 Red carpet fashion and the Mark Hotel",
    "description": "Watch full fashion arrivals at the 2025 Met Gala carpet and departures from The Mark Hotel in New York with stars including Rihanna, Zendaya, Madonna, Cardi B, Kim Kardashian, Nicki Minaj, Colman Domingo, Chappell Roan, Sabrina Carpenter, Bad Bunny and more. Superfine Tailoring Black Style is the first Met show to focus exclusively on Black designers, and the first in more than 20 years to have a menswear theme. In this video 000000 Scene at The Mark hotel 012200 Colman Domingo 012537 Sabrina Carpenter departs The Mark 012555 Sydney Sweeney 012718 Cynthia Erivo departs The Mark 013737 Mystery guest departs The Mark 015239 Future departs The Mark 021224 Diana Ross 021607 Zendaya 021800 Shah Rukh Khan 021946 Gigi Hadid 022057 Jennie 022607 Simone Biles 023441 Bad Bunny 023831 Mindy Kaling 023933 Karlie Kloss 024238 Nicki Minaj 024444 Lisa 024615 Dua Lipa 024931 Kerry Washington 025145 Walton Goggins 025931 S.Coups 030230 Tyla departs The Mark 030315 Miley Cyrus 030505 Tracee Ellis Ross 030520 Halle Bailey 030631 Cynthia Erivo 031422 Doechii 031700 Serena Williams 032138 Alicia Keys 032448 Demi Moore 033010 Priyanka Chopra 034815 Damson Idris 034915 Stevie Wonder 035127 Freen Sarocha 035428 Russell Wilson and Ciara 035900 Keke Palmer 040137 Lizzo 040816 Shakira 041707 Nicole Scherzinger 041837 Rachel Brosnahan 041900 Madonna 042405 Ros 042620 Quinta Brunson 043000 Kendall Jenner 043238 Andre 3000 043531 Chappell Roan 043800 Kim Kardashian 044431 Kylie Jenner 044647 Cardi B 044900 Rihanna",
    "category": "News & Politics",
    "publishedAt": "2025-05-06T03:11:47Z",
    "channelTitle": "Associated Press",
    "viewCount": "1909733",
    "likeCount": "12827",
    "commentCount": "2049",
    "duration": "PT4H56M28S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.050233100233100264,
    "importance": 0.0,
    "relevance": 0.136,
    "authenticity": 0.333,
    "info_gain": 0.507,
    "keywords": [
      "mark",
      "departs",
      "hotel",
      "met",
      "2025"
    ]
  },
  {
    "Id": 8,
    "source": "YouTube",
    "region": "US",
    "title": "Inside Reacts to ANOTHER Aaron Gordon GameWinner Insane Joki Stat Line NBA on TNT",
    "description": "Watch highlights from Inside the NBA with Shaq, Charles Barkley, Kenny Smith and Ernie Johnson and more! Subscribe now to be updated on the latest videos Connect with NBA on TNT Follow NBA on TNT on Twitter Like NBA on TNT on Facebook Follow NBA on TNT on Instagram",
    "category": "Sports",
    "publishedAt": "2025-05-06T05:18:22Z",
    "channelTitle": "NBA on TNT",
    "viewCount": "1237787",
    "likeCount": "16761",
    "commentCount": "2732",
    "duration": "PT22M29S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.041666666666666664,
    "importance": 1.0,
    "relevance": 0.529,
    "authenticity": 0.333,
    "info_gain": 0.263,
    "keywords": [
      "nba",
      "tnt",
      "follow",
      "inside",
      "aaron"
    ]
  },
  {
    "Id": 9,
    "source": "YouTube",
    "region": "US",
    "title": "MY DEEPEST FEAR. There's a SHARK in the POOL Sharks And Minnows",
    "description": "WELCOME, to Sharks and Minnows. Going to be honest, this was my toughest game to record in a while... READ MY MANGA Join Tiktok Twitter Instagram Game Music Jesus said to love one another and that we should be servants to each other, so I would ask that you all do that in the comment section. Be respectful. We are a community. That means more to me than anything. Thank you. CK",
    "category": "Gaming",
    "publishedAt": "2025-05-05T20:13:35Z",
    "channelTitle": "CoryxKenshin",
    "viewCount": "4786180",
    "likeCount": "567960",
    "commentCount": "33413",
    "duration": "PT34M40S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.24687499999999998,
    "importance": 1.0,
    "relevance": 0.397,
    "authenticity": 0.333,
    "info_gain": 0.441,
    "keywords": [
      "game",
      "minnows",
      "sharks",
      "ask",
      "ck"
    ]
  },
  {
    "Id": 10,
    "source": "YouTube",
    "region": "US",
    "title": "When Abandoned Mines Collapse",
    "description": "An overview of mine subsidence Get Nebula using my link for 40 off an annual subscription Watch The Logistics of Coal Mining The story of mine subsidence is the story of so many things in engineering addressing the difficulties we used to just ignore. This is a real issue that causes real damages today, but its also an issue that a lot of people put a great deal of thought, effort, and ultimately resources into so that we can strike a balance between protection against damage to property and the environment and obtaining the resources that we all depend on. Watch this video adfree on Nebula Signed copies of my book (plus other cool stuff) are available here Practical Engineering is a You Tube channel about infrastructure and the humanmade world around us. It is hosted, written, and produced by Grady Hillhouse. We have new videos posted regularly, so please subscribe for updates. If you enjoyed the video, hit that like button, give us a comment, or watch another of our videos! CONNECT WITH ME Website Twitter Instagram Reddit Facebook Patreon SPONSORSHIP INQUIRIES Please email my agent at practicalengineering.tv DISCLAIMER This is not engineering advice. Everything here is for informational and entertainment purposes only. Contact an engineer licensed to practice in your area if you need professional advice or services. All nonlicensed clips used for fair use commentary, criticism, and educational purposes. SPECIAL THANKS This video is sponsored by Nebula. Stock video and imagery provided by Getty Images, Shutterstock, Pond5, and Videoblocks. Music by Epidemic Sound Tonic and Energy by Elexive is licensed under a Creative Commons Attribution License Source Video by Grady Hillhouse Edited by Wesley Crump Produced by Ralph Crewe Graphics by Nebula Studios",
    "category": "Education",
    "publishedAt": "2025-05-06T13:00:51Z",
    "channelTitle": "Practical Engineering",
    "viewCount": "590818",
    "likeCount": "27789",
    "commentCount": "1022",
    "duration": "PT17M33S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.2943950786056049,
    "importance": 1.0,
    "relevance": 0.115,
    "authenticity": 0.333,
    "info_gain": 0.461,
    "keywords": [
      "video",
      "nebula",
      "engineering",
      "watch",
      "advice"
    ]
  },
  {
    "Id": 11,
    "source": "Google News",
    "region": "US",
    "title": "World leaders call for calm after India strikes Pakistan following attack in Kashmir Axios",
    "summary": "World leaders call for calm after India strikes Pakistan following attack in Kashmir Axios Operation Sindoor India Launches Missile Strike Against Pakistan Forbes IndiaPakistan live updates Pakistan vows retaliation after India strikes over Kashmir attack NBC News India fires missiles into Pakistan, killing at least 19, officials say CBS News Why did India strike Pakistan? All we know about Operation Sindoor Al Jazeera",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1EY1RBU0oxZUktRFlVVzhWOVZKR2tVZzA1SjB6WjNoOXZEaEVyVzZqVXpQLXF6eXE2S25OY250MDZjZy1mdTlTbXNIX0hOYm50TW9acFVQQ00tdDZtTTZBbGU5NmtJeGZCUWZJbmtFMmx4dWVWRkxYcA?oc=5",
    "published": "Wed, 07 May 2025 01:23:00 GMT",
    "sentiment": 0.07272727272727274,
    "importance": 0.667,
    "relevance": 0.433,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "india",
      "pakistan",
      "attack",
      "kashmir",
      "strikes"
    ]
  },
  {
    "Id": 12,
    "source": "Google News",
    "region": "US",
    "title": "Papal Conclave Voting due to start to elect a new pope BBC",
    "summary": "Papal Conclave Voting due to start to elect a new pope BBC Live updates New pope to be elected by the conclave CNN Black smoke vs. white smoke What does each mean during the papal conclave? USA Today God and politics loom over conclave as cardinals choose Pope Francis' successor NBC News How The Times Covers the Papal Conclave The New York Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ibGtSblJBSTlKQkNwYmswLThBV0J4OHk0NHBIWXFZc0Z5bjAtOGJ2b016V3FCWkVYVU9WU29ZaS1XYXN4ajc4aEw0WmJtRVF1RWhKcGxXbGxqUdIBX0FVX3lxTFA0ZHJJNTJqdHB1R0RfekUwMXFWVTMyazV4Z2hQOVNvalJla3lsZHc0ajc5VWFVaTJjaWw4MzNxU0FxQ1JNQnpzNEpIcEgzU3I2cU1HTUJqRUZwU1lLREow?oc=5",
    "published": "Wed, 07 May 2025 01:20:24 GMT",
    "sentiment": 0.12938762626262623,
    "importance": 0.667,
    "relevance": 0.445,
    "authenticity": 0.6,
    "info_gain": 0.329,
    "keywords": [
      "conclave",
      "new",
      "papal",
      "pope",
      "bbc"
    ]
  },
  {
    "Id": 13,
    "source": "Google News",
    "region": "US",
    "title": "Trumps team is finally meeting with China. The future of the global economy is riding on its success CNN",
    "summary": "Trumps team is finally meeting with China. The future of the global economy is riding on its success CNNUSChina Tariff Pause Reasonable to Expect, Council Head Says Bloomberg Trump officials Bessent and Greer to meet with Chinese counterparts on trade, economic issues CNBCU.S. and China to Hold First Trade Talks Since Trumps Tariffs The New York Times Tariffs US and China to start talks over trade war this week BBC",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNLUZoZnoyaWNzT09ncDl2blY0d0F5d0ZLWGxrcERaVlRoZjl5V3FrelRkYkRNUHRxRVBuOExTN0VOUXY1dEZ5ZHJLR0F4TWlxZjRSdUJKUGVTclUxY3E3WUw4VHlZdC1yY3RmSVlBT2lDVm1kWEdIeVZ6ankxY183MGVyMUktbU1L0gGOAUFVX3lxTE5oVzJJejdpWTZTZlczX0d6a0VjVkFaSlkxUm5XT1FQVlpQTEVUbnk1MGxxVXViRlRiVzZGRWRSd0l5dXM1MW1JMjJIb2piQ0VuU2lBUnFZZzVvclNubG1jQW5vLXdBU2ZNRUJtU25tMVprM00zelVNdk5hYXZzeDFUYWZRSVNvbFp5S3JYeEE?oc=5",
    "published": "Wed, 07 May 2025 03:03:00 GMT",
    "sentiment": 0.10664335664335664,
    "importance": 0.8,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.383,
    "keywords": [
      "china",
      "trade",
      "trumps",
      "economy",
      "finally"
    ]
  },
  {
    "Id": 14,
    "source": "Google News",
    "region": "US",
    "title": "Homeland Security chief says travelers with no REAL ID can fly for now, but with likely extra steps ABC News",
    "summary": "Homeland Security chief says travelers with no REAL ID can fly for now, but with likely extra steps ABC News REAL ID is now required for air travel in America. Heres what to expect at airports across the US CNN Travelers Without a Real ID Will Still Be Allowed to Fly, Noem Says The New York Times Kristi Noem says travelers without Real ID will still be able to fly after deadline The Guardian What airlines are saying to people who don't have a Real ID yet Business Insider",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxNN18xQm5rMkJrSThPLWVxZFlqYmloM3p4RjdhbEctZmZtc1d3dGVuN2kyUVYwUFBVUUE1SFVYemt1WGgxWHlQVnhpUjJnaVh0Z1BGUm1FSmtacXRnTEtlTUI4WF9DTmYtVXRvMVBUWGd0NkpQSDVmRjIyNU5GZm1OZWNXRXRoZ0lxUjBrYzVpSjFCcEo0QVNFdExHZ9IBoAFBVV95cUxNajNTcFBqdnJ0aERmdkRlTFZDZVVPeEhKcXF3TGwzaDNQRWhlNm1uUnc3SlduakNjU2JodkNvcHNPVGxfbmFiN3FvQUVtVk5Kc2NBQm1SQ2RXdkpBVFoweFo0bG5lRGQ0T2dmVFlFbnBTSGpOSHlGLTNXaTFBUnowRnlIajMxd1VoVU9Ub2R6TGxwUWh5OXhveWw2TXd2UXhI?oc=5",
    "published": "Tue, 06 May 2025 17:37:30 GMT",
    "sentiment": 0.2772727272727273,
    "importance": 0.667,
    "relevance": 0.306,
    "authenticity": 0.6,
    "info_gain": 0.427,
    "keywords": [
      "id",
      "real",
      "fly",
      "says",
      "travelers"
    ]
  },
  {
    "Id": 15,
    "source": "Google News",
    "region": "US",
    "title": "Declassified intelligence memo contradicts Trump's claims linking gang to Venezuelan government AP News",
    "summary": "Declassified intelligence memo contradicts Trump's claims linking gang to Venezuelan government AP News U.S. intelligence memo says Venezuelan government does not control Tren de Aragua gang NPR Declassified Spy Memo Contradicts Trump on Venezuela Gang Ties The New York Times Trumps Alien Enemies Act invocation gets even more dubious with new evidence MSNBC News NYT investigation finds no evidence linking many deported Venezuelans to Tren de Aragua PBS",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMitwFBVV95cUxNMlNqVnZrZDl2cExGM0d0N0pILVl3MlBENktldnJpc25SdHBWWnhFVlhsRmpKY1d3NEZFakxDNFp4OUxHaDVDTmJseGhHbTdiUGVBcHJ1MlViUVBsN2F5M3g1RnpWWkladkpsYmJid3dXNy1BbVlKODZsa2FGUkg1RnE4OGs5M0J4eDZ1U09wVXNoenV4OEY2VFE0MVd1bnZZOHk2cEZYOUswRDl6QWQ0bjdUZnkxUEE?oc=5",
    "published": "Wed, 07 May 2025 02:08:00 GMT",
    "sentiment": 0.20454545454545453,
    "importance": 0.8,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.369,
    "keywords": [
      "gang",
      "memo",
      "contradicts",
      "declassified",
      "government"
    ]
  },
  {
    "Id": 16,
    "source": "Google News",
    "region": "US",
    "title": "Mark Carney holds his own in Oval Office encounter with Donald Trump Financial Times",
    "summary": "Mark Carney holds his own in Oval Office encounter with Donald Trump Financial Times Trumps Oval Office meeting with Carney didnt reach Zelenskylevel tension. But it wasnt all neighborliness CNN Mark Carney said he's glad people couldn't tell what was going through his mind when he met Trump Business Insider Carney says Canada is not for sale, Trump replies, 'Never say never' Fox News Trump tariffs live updates Trump meets with Canada's Carney, hints at coming pharma tariffs Yahoo Finance",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTFBRWFBZeEc1SVJVYXVhYU11S2tBcUlTaVJiUzN2eEtfakZnZkVReFpOZi1PUWdkeFN3NzNnemRfX2hwWEFmWndsa3FmLTFOazVhVDZic1lmWDVtTGNXMHJIa3lSX1luOGwwb25ZbHQ0bm0?oc=5",
    "published": "Tue, 06 May 2025 23:05:32 GMT",
    "sentiment": 0.3060606060606061,
    "importance": 0.667,
    "relevance": 0.355,
    "authenticity": 0.6,
    "info_gain": 0.429,
    "keywords": [
      "carney",
      "trump",
      "mark",
      "office",
      "oval"
    ]
  },
  {
    "Id": 17,
    "source": "Google News",
    "region": "US",
    "title": "Marjorie Taylor Greene says I can win the Senate primary after Kemp bows out of contention WSBTV",
    "summary": "Marjorie Taylor Greene says I can win the Senate primary after Kemp bows out of contention WSBTV Republicans thought theyd pad their Senate majority. The map is getting tougher. Politico Analysis Marjorie Taylor Greene for Senate? Why the GOP should be scared. The Washington Post Brian Kemp Wont Run for Senate in Georgia, Giving Ossoff a Lift The New York Times The governortoSenate pipeline is suddenly flowing in the other direction Axios",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPU2NNZ3E1N3NPS2t2b2xJaUJnZkd4N3RQMTFmVG95MDZjdjVHMTZVV0o2X1YzQnhuLVBsVTdEdVhHX3RSRUlkdjdhYjRGLThTQWpZTUs3dHd2VUZ2ZFB5V0tLM1VUczUtdmR2bGY3cmp2b0NJR0dEZHgxWE5yQjF4NzN2amlETzQ5cm9sR2hVZF85UWs3c2lPY3V3TXBMa24yZkFrZVAwZHVNZlpnUC1aZ25XSkdYeGxGT2ZOODJrQmVjTDdZd0VXZm5YeTlnTlZsX01Ca1RNbllRaVBPWHZGdWlMdU42blXSAfsBQVVfeXFMTTJQT2hPZjlXSHZ6bFFZdG84amk5cWQ3Tm5vaHE2U3g2eHhRczlLZ2NYVXdOazVkajQycDRpa1owUURDQkxqVGNmRS1jVmYzU05iT2Y1WFUwdWYyUjIwdjJvMmpOSlljbXI2NGVrczRfc2FWTUFXSTlTWWk4clplX0lQamJOU0pjRFJQUzV0dGFsdE4xWEYtZHlRemZUeXFZMkM2TkxVaW1wd3hxLVpLM0ZGN2pyZHZCbEl0dUxTM2lsUG5iVkFkeTU2aW5FVWtqQ2I4LXZ1alZpaVBCRGJzckFXaFB5cW5qYzNJamxjazVxRnZENTI1THFkVzA?oc=5",
    "published": "Tue, 06 May 2025 20:47:01 GMT",
    "sentiment": 0.34448051948051944,
    "importance": 0.667,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.376,
    "keywords": [
      "senate",
      "greene",
      "kemp",
      "marjorie",
      "taylor"
    ]
  },
  {
    "Id": 18,
    "source": "Google News",
    "region": "US",
    "title": "Was First Amendment Violated in Student Arrests? Trump Lawyer Wont Say. The New York Times",
    "summary": "Was First Amendment Violated in Student Arrests? Trump Lawyer Wont Say. The New York Times Judge grills Trump administration on whether detained Tufts student's free speech is protected NBC News Opinion Visa Applicants Dont Have First Amendment Rights Politico Detained Tufts student Rmeysa ztrk sounds alarm on conditions in Louisiana detention facility The Boston Globe Appeals court makes no immediate decision in cases of detained students WCAX",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMioAFBVV95cUxQd2lDTW5yeWFRUnVGeEZ6T2RQTXFZX19Pb2hEX3B5OVZ2YWVtd2l1cURxdTVhaTZZX2lQVm9uZkVPRmQ2ZEh0YlUxd0g4MDFtUHdLR2RWRWZLeHp2b1R5Sm9mZHJ5b0pLVU5ad2I1alVTSmpjNmpsMzNTMnVoNmV4bGJ3V1lZeU5uZHBPVnd0ZUtoemNhc1hjZXRTVFdLLUUx?oc=5",
    "published": "Tue, 06 May 2025 22:13:01 GMT",
    "sentiment": 0.23712121212121215,
    "importance": 0.667,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.382,
    "keywords": [
      "student",
      "amendment",
      "detained",
      "trump",
      "arrests"
    ]
  },
  {
    "Id": 19,
    "source": "Google News",
    "region": "US",
    "title": "Dont tax Bluey Ambassadors to US warn against Trump movie tariffs Politico",
    "summary": "Dont tax Bluey Ambassadors to US warn against Trump movie tariffs Politico Trumps Hollywood tariff threat is already unraveling CNN Newsom Asks Trump to Work With Him on 7.5 Billion Tax Credit for Hollywood The New York Times Trump, Jon Voight meeting led to Hollywood tariff proposal, his manager says CNBC Aussiewood to Mel Gibson save us from Trump's movie tariffs Reuters",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxPQlRDcnVjcTdINUh2R2lBVkRnQU1pQ000ZVhTNzNwcUI0dTZXb1lqVmdVeWFRUWZWTGkxMXdLTEJiLVRKOG40MjBpZTEtN3Y2a3Q4cmk5dDV2Z28zc2ZmQVJERTJqd0Nuc0xFbDZ6T1ltUXA1RzNySmVNYjZVc0RBSGtaRnpTWDNpZjhzZVVyVmQ?oc=5",
    "published": "Wed, 07 May 2025 01:44:34 GMT",
    "sentiment": 0.13636363636363635,
    "importance": 0.8,
    "relevance": 0.451,
    "authenticity": 0.6,
    "info_gain": 0.349,
    "keywords": [
      "trump",
      "hollywood",
      "movie",
      "tariffs",
      "tax"
    ]
  },
  {
    "Id": 20,
    "source": "Google News",
    "region": "US",
    "title": "Trump Administration Plans to Send Migrants to Libya on a Military Flight The New York Times",
    "summary": "Trump Administration Plans to Send Migrants to Libya on a Military Flight The New York Times Exclusive U.S. may soon deport migrants to Libya on military flight, sources say Reuters Trump administration plans to send migrants to Libyas horrific detention centers The Independent Trump administration may soon deport migrants to Libya, U.S. officials say CBS News Donald Trump Planning to Send Migrants to Libya What We Know Newsweek",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE01aEJnX1JubTh0eE1IWkdNTnBWajhtckpmRnVzb2NCU2Y1WDNlQlZqd3NzeVg3SVFHTDl2Mkd5RTdHcjlTNU1OQi0xVDh3RW4yTGxFTFhXeEFUc1d1QjdkOVY0ckxTZ0NMcGtTaUZZYUdwYnhxRllMbEYwRk8?oc=5",
    "published": "Wed, 07 May 2025 01:56:43 GMT",
    "sentiment": -0.14675324675324677,
    "importance": 0.8,
    "relevance": 0.397,
    "authenticity": 0.6,
    "info_gain": 0.29,
    "keywords": [
      "migrants",
      "libya",
      "trump",
      "administration",
      "send"
    ]
  },
  {
    "Id": 21,
    "source": "YouTube",
    "region": "GB",
    "title": "REBUILDING THEN RETURNING MY WRECKED DB12 BACK TO ASTON MARTIN",
    "description": "Check if your car was damaged with Car Vertical 20 off here I bought a crash damaged Aston Martin DB12 which only had 39miles on the odometer. The car was pretty much brand new and we found out it was crashed on a PDI inspection before it got to the customer. We had to wait 6 months for parts and they have finally arrived but we still havent managed to get the car started. FOR A CHANCE TO WIN MY ASTON MARTIN VANTAGE Thanks to Bob at the Machine Shop Thanks to Keezy customs. Get your car wrapped FOR MORE CONTENT CHECK OUT MY SECOND CHANNEL ALL MA MERCHANDISE Follow Me Here Aswell",
    "category": "Autos & Vehicles",
    "publishedAt": "2025-05-05T17:00:29Z",
    "channelTitle": "Mat Armstrong",
    "viewCount": "2403068",
    "likeCount": "126827",
    "commentCount": "3443",
    "duration": "PT42M2S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.20785123966942146,
    "importance": 1.0,
    "relevance": 0.271,
    "authenticity": 0.333,
    "info_gain": 0.511,
    "keywords": [
      "car",
      "aston",
      "martin",
      "check",
      "damaged"
    ]
  },
  {
    "Id": 22,
    "source": "YouTube",
    "region": "GB",
    "title": "Buying My Dream Home at 22",
    "description": "U Se code JOE at Young LA to get 15 off Use code JOE at checkout to get discounts on Myprotein My Workout Program Instagram joefazer Snapchat joefazerfitness Business Enquiries itsfazzler.com Hi i'm Joe, I have created this You Tube channel to show my progression from a skinny teenager who is sick of being skinny to hopefully in the future being more muscular and just better in general both physically and mentally. If you do enjoy my content it would mean lot if you could hit the like button and maybe even consider subscribing. Thank you! Music Music licensed from Lickd. The biggest mainstream and stock music platform for content creators. Bulletproof by La Roux, License ID Jq P7WY3DP Av If you want to use music from famous artists, try Lickd to get track credits and unlimited stock music",
    "category": "Entertainment",
    "publishedAt": "2025-05-05T18:00:27Z",
    "channelTitle": "Joe Fazer",
    "viewCount": "590663",
    "likeCount": "39666",
    "commentCount": "1500",
    "duration": "PT7M6S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0768262987012987,
    "importance": 1.0,
    "relevance": 0.23,
    "authenticity": 0.333,
    "info_gain": 0.513,
    "keywords": [
      "music",
      "joe",
      "code",
      "content",
      "la"
    ]
  },
  {
    "Id": 23,
    "source": "Google News",
    "region": "GB",
    "title": "Kashmir crisis live airlines forced to divert flights Financial Times",
    "summary": "Kashmir crisis live airlines forced to divert flights Financial Times IndiaPakistan live 'Dozens dead' as India launches strikes; Pakistani military says five Indian jets shot down Sky News24 Strikes, 9 Terror Camps, 70 Killed India Rained Hell For 25 Minutes NDTV IndiaPakistan live Pakistan says it shot down jets following Indian air strikes The Independent IndiaPakistan latest Countries at brink of war amid escalation in Kashmir The Telegraph",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE92bGVnVUpVZXZwT1F1UkNPSXZGODJWay1kWmNnZ2NIckI3T205VEhuMnVyRU9NbjRRcG10WEV5c3JudVNIVzNDV2dWemxDTE5UdWJVSjlSUEFpRzZMeGN4Z0J5Wm1CUkI1d0piV0hmZlo?oc=5",
    "published": "Wed, 07 May 2025 06:10:20 GMT",
    "sentiment": -0.022853535353535362,
    "importance": 0.8,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "live",
      "indiapakistan",
      "kashmir",
      "strikes",
      "airlines"
    ]
  },
  {
    "Id": 24,
    "source": "Google News",
    "region": "GB",
    "title": "India trade deal could undercut UK business, opposition parties say BBC",
    "summary": "India trade deal could undercut UK business, opposition parties say BBC'Twotier' trade deal and 'Labour turmoil' over winter fuel BBC Faisal Islam UKIndia deal secured as Trump tariffs everywhere BBC Anger at Indian payoff in biggest deal since Brexit The Times Starmer beats Trump to the line in race for trade deal with India The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE1uWmxKTjMwYmZjS1M1Q25aemo3dm9FaFhzeDE3MUVuNFdrX3NsT3hHSGlUS1VfazJLc1c3a1VZbHpBalpyU01jbzJyQW9DaUVqbTF2dEZra1owYk440gFiQVVfeXFMUDRKbzlfN3pNX0tFdVZVazNycl84azNWVkoyTTFSZ3dXNE1pc3YyZll6RjBxZlJESENvd0lyVkhXUDF6WW9fOGItRTdqV1dnX09RRlV6WmVjQlp2dnhnSEZseHc?oc=5",
    "published": "Tue, 06 May 2025 20:40:15 GMT",
    "sentiment": -0.7,
    "importance": 0.667,
    "relevance": 0.497,
    "authenticity": 0.6,
    "info_gain": 0.295,
    "keywords": [
      "deal",
      "bbc",
      "trade",
      "india",
      "business"
    ]
  },
  {
    "Id": 25,
    "source": "Google News",
    "region": "GB",
    "title": "Bitterly divided cardinals retreat for conclave to elect new pope Financial Times",
    "summary": "Bitterly divided cardinals retreat for conclave to elect new pope Financial Times Conclave live Cardinals from across the world gather in the Vatican to elect new pope BBC Black smoke vs. white smoke What does each mean during the papal conclave? USA Today Cardinals to begin choosing new pope in largest ever conclave The Guardian Age, ideology and Donald Trump The factors facing the conclave as it chooses the next pope Sky News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1WSnFna3ZJOUhiVHZtcnZzN1NkcTQydERxOWdDTV84QmVHbVJWRjAtaGQtemhDNk81Vk9hbXU5NllldkNkN2lyVGlPQ3JOck9JN3Ixc0RZYXk4VDhPUnc2NXlWMXlVTHJCVVhkU0VGM0s?oc=5",
    "published": "Wed, 07 May 2025 04:00:58 GMT",
    "sentiment": 0.1501657196969697,
    "importance": 0.8,
    "relevance": 0.392,
    "authenticity": 0.6,
    "info_gain": 0.356,
    "keywords": [
      "conclave",
      "pope",
      "cardinals",
      "new",
      "elect"
    ]
  },
  {
    "Id": 26,
    "source": "Google News",
    "region": "GB",
    "title": "Trump says we just want to be friends as Canada PM torpedoes 51st state idea The Guardian",
    "summary": "Trump says we just want to be friends as Canada PM torpedoes 51st state idea The Guardian Carney tells Trump that Canada 'won't be for sale, ever' BBC Donald Trump humiliated Mark Carney at their White House meeting The Telegraph Carney played nice then Trump delivered the insult hed been planning all along The Independent Canada PMs elbowsup defense keeps Trump at bay as both parties play it cool The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPQk9HZHV4YnNIOERQdHdYaTBVWW04cTYtdWFHaHhGNjJ1UlJ6VUFTaVhhZnZrYVA1TXdDaTJaWldraGR0Rm1aZGJ6TmdQVTJ0SGEwR1JJOExSX3M0MlRtVUd0bXhGME4yVzZXZVZJLXVRTFVtcUpLamVfS0V1ZmY4Y2gxdG5LOEU?oc=5",
    "published": "Tue, 06 May 2025 17:53:00 GMT",
    "sentiment": 0.2375,
    "importance": 0.667,
    "relevance": 0.379,
    "authenticity": 0.6,
    "info_gain": 0.376,
    "keywords": [
      "trump",
      "canada",
      "carney",
      "guardian",
      "51st"
    ]
  },
  {
    "Id": 27,
    "source": "Google News",
    "region": "GB",
    "title": "Germanys Merz confirmed as chancellor in second parliamentary vote after shock firstround defeat The Independent",
    "summary": "Germanys Merz confirmed as chancellor in second parliamentary vote after shock firstround defeat The Independent Merz's messy path to power raises questions for future government BBC Germany's Merz Heads to Paris and Warsaw After Chaotic Start as Chancellor Bloomberg.com Germanys Merz confirmed as chancellor in second vote following first round humiliation as it happened The Guardian Merz is weakened from Day 1. Europe will pay the price. politico.eu",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxNR2lnM2Rpc25YMnkyQWJzeWJLbW11SjVoMG9tMjAzY0NfeXhhZTVrMlRXN3FNc192RVhmdXMzRDVKVUl2cWlibWtVNjYwSW01TER5OTRqRkpzdExoNV9rS3ZadVd1R3N0b3gxVmtEdHN0dUJ6ZmxjVjI2cnBveDdxekFRRjZtSTFBV184LUFjOEtqcHFQeTFIRGRqbU1lb0tmSGc?oc=5",
    "published": "Tue, 06 May 2025 21:03:00 GMT",
    "sentiment": 0.08076923076923077,
    "importance": 0.667,
    "relevance": 0.401,
    "authenticity": 0.6,
    "info_gain": 0.369,
    "keywords": [
      "merz",
      "chancellor",
      "confirmed",
      "germanys",
      "second"
    ]
  },
  {
    "Id": 28,
    "source": "Google News",
    "region": "GB",
    "title": "Biden accuses Trump of modernday appeasement towards Russia The Guardian",
    "summary": "Biden accuses Trump of modernday appeasement towards Russia The Guardian Trump appeasing Putin with pressure on Ukraine, Biden tells BBC BBCWhat the hells going on? Biden slams Trump for appeasing Putin in first interview since leaving office The Independent Without mentioning his name, Biden calls Trump's pressure on Ukraine 'modernday appeasement' towards Russia The Kyiv Independent Watch Biden's first interview since leaving the White House BBC",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNdnJRLTVjQ21OT3lMTV9EWjkxVHRoZW90NjRyaEpMT0xUQWtGWlBfSnhzeXJVeFFHbGJLSGY0MHVkMGJ0SG9pRnNPbEUyNU9XUnBYUEROOU1wNkFydnkwUnFLUXM0RmhkTVhLQlJlNFJMWTVJN0ZkMG5DQlEwVGRZbk9HZDJsbUM5TFZaLW5YdVNTUUk5UHk3N2FjTGthRGlvQktiaVJLVDNYRUJs?oc=5",
    "published": "Wed, 07 May 2025 06:19:00 GMT",
    "sentiment": 0.1,
    "importance": 0.8,
    "relevance": 0.439,
    "authenticity": 0.6,
    "info_gain": 0.27,
    "keywords": [
      "biden",
      "trump",
      "appeasement",
      "modernday",
      "russia"
    ]
  },
  {
    "Id": 29,
    "source": "Google News",
    "region": "GB",
    "title": "Criminals in England and Wales face sanctions for refusing to attend sentencing The Guardian",
    "summary": "Criminals in England and Wales face sanctions for refusing to attend sentencing The Guardian Criminals who skip sentencing could face more jail time BBC More jail time for criminals who refuse to attend sentencing hearings Sky News Common sense at last! Killers to face these punishments for hiding in cells when sentenced Daily Express Criminals who refuse to attend sentencing to face longer jail time and loss of prison privileges The Independent",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNQ1c4dEdtSG5jSjlhMVVFS3dKWWpmVzRseTJkcmdwRW41YXk4R1FGX2RGSE9NX1JxVmZRRjloZkVzNk5ncTh2RVUyME5wb2JnQmdPUkpNU0NBSkpaUUtaS0VwbXFFSWg0U2VzNGZBU25rbVpnTDNpLVk5aHdZMmtnTWQxdzhnLTRwWW54Y1BvT2l4bkJkRUFaQ213VF9OZm15TTlHaFVJRmNXVUgzcFo4bA?oc=5",
    "published": "Wed, 07 May 2025 06:00:00 GMT",
    "sentiment": 0.044444444444444446,
    "importance": 0.8,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.303,
    "keywords": [
      "criminals",
      "face",
      "sentencing",
      "attend",
      "jail"
    ]
  },
  {
    "Id": 30,
    "source": "Google News",
    "region": "GB",
    "title": "UK Foreign Office travel warning issued as Pakistan and India clash Full list of airlines cancelling flights Daily Mail",
    "summary": "UK Foreign Office travel warning issued as Pakistan and India clash Full list of airlines cancelling flights Daily Mail Britons warned to avoid IndiaPakistan border as Heathrow flights delayed London Evening Standard Britons told to be 'extremely cautious' in fresh Asia travel guidance 'consider your plans carefully' GB News Urgent travel warning issued after deadly attacks The Nightly India Pakistan war fears Live updates amid huge tensions between nucleararmed powers The Mirror",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi7gFBVV95cUxQd0tLRE4wZE42V2N3TzJsaG9KaXFTRVBaenprbTBxMW9mLWI1RktlNndPSGlIZTExeEFUZkNNQ3gtOEJheUZZNElyRVFkOUQxb1JQRjFCeTRYWFpUR2VJWGdqMHpSbUk3X2RjZU5OTGVMRVhQVzhqcWZQSmdlUm1idEhKS0ZsY010bmZZZU1ueEt5MUZKYks0Z2tfZTdtRTBBNFdBZjhjbzRjcGw2Nzc5SnpKRDJQQkpiS1h1MDVYdmNESDVzWlNQYnNRZ1lJdlFUbHBiTnIwOUJBSzgwcDJNU0VLcWdpcDIyX0NzZjhB0gHzAUFVX3lxTE9jOG1hSllEeldpN1IyR1NWbDI5TnBXVmRkRHp5S2wtdVIteHRjQktWdWl0WGMxdTZYQkFVb1RySUdJejBqWEZkTjVEdUUxVWVUQWFWS2FSYVQta3lKaGVhcG5aVlZCbkNpajl4VWlKVmFGTjBIaHlXXzBQVS1iX2tlZk55V1VvVmg2bWh6VUtLdktsVWhLd0Z3VEVaQ3pZQmk3OXdNcHg2c20xWTlFZmE3MWtmY1pnVEtiYUZyTzE4ZHZPOVIyUjBtcDYyeGF3aERaY00xTlVfTFRhZlFfanlMMkhpRkVwSERhWGYzRURuaUM3VQ?oc=5",
    "published": "Wed, 07 May 2025 00:52:27 GMT",
    "sentiment": 0.06625874125874126,
    "importance": 0.667,
    "relevance": 0.366,
    "authenticity": 0.6,
    "info_gain": 0.402,
    "keywords": [
      "travel",
      "flights",
      "india",
      "issued",
      "pakistan"
    ]
  },
  {
    "Id": 31,
    "source": "Google News",
    "region": "GB",
    "title": "Four times Rachel Reeves got her maths wrong The Telegraph",
    "summary": "Four times Rachel Reeves got her maths wrong The Telegraph No 10 resists Labour calls for winter fuel rethink BBC Cuts leave voters doubting Labours ability to deliver change The Guardian Starmer rules out winter fuel allowance Uturn despite local elections backlash The Independent Downing Street rules out reversing cut to winter fuel payment Financial Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxNQnZONmtQWW1Yc05hZDRLMTlWQ1NkdXBUbmpRcVRLLW1fWmdLc0NneUNMWGFTbzFBZkpNbWZMUFNaSVZSZUpCdHBuZEsyd0F2Z25NWXNvSW1TU1VSLUN3RXV0bUNuelV3Mm5JR2VpeHBTUnpnbDk4WGVnNEdULUtveg?oc=5",
    "published": "Wed, 07 May 2025 06:00:00 GMT",
    "sentiment": -0.2,
    "importance": 0.8,
    "relevance": 0.505,
    "authenticity": 0.6,
    "info_gain": 0.309,
    "keywords": [
      "fuel",
      "times",
      "winter",
      "got",
      "maths"
    ]
  },
  {
    "Id": 32,
    "source": "Google News",
    "region": "GB",
    "title": "Three children mauled by XL Bully in horror attack in Norfolk home EDP24",
    "summary": "Three children mauled by XL Bully in horror attack in Norfolk home EDP24",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNR2lOSGhUUV9Bd2dtcmJJQm41YlhTbzNvaTl5ZkJnendJMzdsbEltRFlpUjVGanZTMnNOcG05Rzh3Ykd1SklCRXpQYWRoWHV0V3lmQ19OZ0hfVGVleWZldXlSQzRxMGJfMW5CcXJqRlh2OF9DMFNLUlJZWEZJM1JTZ0hUR3lacWxhV05HVm04c09WSDViRmc?oc=5",
    "published": "Wed, 07 May 2025 05:00:00 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.077,
    "keywords": [
      "attack",
      "bully",
      "children",
      "edp24",
      "home"
    ]
  },
  {
    "Id": 33,
    "source": "YouTube",
    "region": "PK",
    "title": "We want justice for potato",
    "description": "",
    "category": "Gaming",
    "publishedAt": "2025-04-30T11:30:13Z",
    "channelTitle": "Koushal Monga",
    "viewCount": "39453022",
    "likeCount": "655268",
    "commentCount": "508",
    "duration": "PT20S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.028,
    "keywords": [
      "justice",
      "potato",
      "want"
    ]
  },
  {
    "Id": 34,
    "source": "YouTube",
    "region": "PK",
    "title": "Devious prank on Madni",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-29T09:37:04Z",
    "channelTitle": "BROTHERS VLOG",
    "viewCount": "47106203",
    "likeCount": "697175",
    "commentCount": "395",
    "duration": "PT18S",
    "definition": "hd",
    "language": "hr",
    "translated": "Devious prank on Madni ",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.021,
    "keywords": [
      "devious",
      "madni",
      "prank"
    ]
  },
  {
    "Id": 35,
    "source": "YouTube",
    "region": "PK",
    "title": "Last one Subscribe",
    "description": "",
    "category": "People & Blogs",
    "publishedAt": "2025-05-01T07:04:50Z",
    "channelTitle": "Cheri's World",
    "viewCount": "31911771",
    "likeCount": "800417",
    "commentCount": "350",
    "duration": "PT46S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.015,
    "keywords": [
      "subscribe"
    ]
  },
  {
    "Id": 36,
    "source": "YouTube",
    "region": "PK",
    "title": "DIY Bamboo Creations with new Three Clour Balloone Slingshots",
    "description": "",
    "category": "People & Blogs",
    "publishedAt": "2025-05-04T01:00:01Z",
    "channelTitle": "Bamboo Art",
    "viewCount": "32536443",
    "likeCount": "541900",
    "commentCount": "426",
    "duration": "PT24S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.13636363636363635,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.054,
    "keywords": [
      "balloone",
      "bamboo",
      "clour",
      "creations",
      "diy"
    ]
  },
  {
    "Id": 37,
    "source": "YouTube",
    "region": "PK",
    "title": "wow",
    "description": "",
    "category": "Comedy",
    "publishedAt": "2025-05-02T12:59:15Z",
    "channelTitle": "dednahype",
    "viewCount": "58471917",
    "likeCount": "691004",
    "commentCount": "598",
    "duration": "PT16S",
    "definition": "hd",
    "language": "pl",
    "translated": "wow ",
    "sentiment": 0.1,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.003,
    "keywords": [
      "wow"
    ]
  },
  {
    "Id": 38,
    "source": "YouTube",
    "region": "PK",
    "title": "Anant gya andaman nicobar island Mumma ka hand bag dene",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-29T09:08:01Z",
    "channelTitle": "PoonamSikarwar",
    "viewCount": "24803554",
    "likeCount": null,
    "commentCount": "299",
    "duration": "PT26S",
    "definition": "hd",
    "language": "tl",
    "translated": "Anant gya andaman nicobar island Mumma ka hand bag dene ",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.061,
    "keywords": [
      "anant",
      "andaman",
      "bag",
      "dene",
      "gya"
    ]
  },
  {
    "Id": 39,
    "source": "YouTube",
    "region": "PK",
    "title": "Air Conditioner Mini Cooling Fan,Portable USB Desk Fan 3 Wind Speed 360Rotatable humidifier",
    "description": "",
    "category": "People & Blogs",
    "publishedAt": "2025-05-01T13:06:37Z",
    "channelTitle": "Rj Mobile 01",
    "viewCount": "46654354",
    "likeCount": "1259444",
    "commentCount": "2811",
    "duration": "PT1M52S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.081,
    "keywords": [
      "fan",
      "360rotatable",
      "air",
      "conditioner",
      "cooling"
    ]
  },
  {
    "Id": 40,
    "source": "YouTube",
    "region": "PK",
    "title": "Laalach buri bala hai",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-05-01T14:33:22Z",
    "channelTitle": "Jahaann",
    "viewCount": "21848669",
    "likeCount": "1210285",
    "commentCount": "1841",
    "duration": "PT1M5S",
    "definition": "hd",
    "language": "id",
    "translated": "Laalach buri bala hai ",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.021,
    "keywords": [
      "bala",
      "buri",
      "hai",
      "laalach"
    ]
  },
  {
    "Id": 41,
    "source": "YouTube",
    "region": "PK",
    "title": "Garmi ke side effects most viral comedy",
    "description": "",
    "category": "Gaming",
    "publishedAt": "2025-05-02T06:02:52Z",
    "channelTitle": "Bihari Ladka",
    "viewCount": "27284980",
    "likeCount": "1077967",
    "commentCount": "1487",
    "duration": "PT1M18S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.041,
    "keywords": [
      "comedy",
      "effects",
      "garmi",
      "ke",
      "viral"
    ]
  },
  {
    "Id": 42,
    "source": "YouTube",
    "region": "PK",
    "title": "Reels lover wait for end",
    "description": "",
    "category": "People & Blogs",
    "publishedAt": "2025-05-03T12:30:52Z",
    "channelTitle": "Pavan Ramya❤️",
    "viewCount": "20730321",
    "likeCount": "251266",
    "commentCount": "217",
    "duration": "PT16S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.028,
    "keywords": [
      "end",
      "lover",
      "reels",
      "wait"
    ]
  },
  {
    "Id": 43,
    "source": "Google News",
    "region": "PK",
    "title": "In pictures Aftermath of Indias latenight strikes in Pakistan Dawn",
    "summary": "In pictures Aftermath of Indias latenight strikes in Pakistan Dawn What we know about India's strike on Pakistan and Pakistanadministered Kashmir BBC Pakistan downs 5 Indian jets as retaliation for latenight strikes at 6 sites officials Dawn India launches strikes deep inside Pakistan and Pakistan claims 5 Indian jets shot down, in major escalation CNN Why did India strike Pakistan? All we know about Operation Sindoor Al Jazeera",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPcU50MWlOTHB0UEFmb0h1bXRlZy1KckRPVGZtRWVwY1habzRmUmF1RnVyUTdpUGI3RjRzZHFHMEhHUlU0QndCaDJ0SXJSY3FvRnBHdXR2MHJycVZ2bG9Jc3psUG81WGJSNWg4WmNyczA5NlBjSFNacnFjb0FmTU50cmVPNXhnWlYza0tGdGQ2STVEdmRoWUHSAU5BVV95cUxQZDVwQWNmd0tTVTVDT2ZnVGhEdXpUT1cxUVJ6aXNnVUdaZktYcjM4S0txRUVuMkZla2NfYVJRV1A5Z2ZxbER3M1JZYl9KcVE?oc=5",
    "published": "Wed, 07 May 2025 04:23:10 GMT",
    "sentiment": -0.03101851851851853,
    "importance": 0.8,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.323,
    "keywords": [
      "pakistan",
      "strikes",
      "dawn",
      "india",
      "latenight"
    ]
  },
  {
    "Id": 44,
    "source": "Google News",
    "region": "PK",
    "title": "IndiaPakistan Conflict Escalates in a Changing World Order Bloomberg.com",
    "summary": "IndiaPakistan Conflict Escalates in a Changing World Order Bloomberg.com View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxOczRMcHIzVzBhT1pENXlvNXA2SXNibUFFeDFQWjA1Q1N1M2lodDZqV19HTjdCM3lZMDZXcXhDRWJpWUNhcUtiVlVJYUlWZU9UbXNEWVhsNnZSbjEwd0tfV1lEck02bXJvLVB0dU5Rc3BiZU5zRFg3S2p4QVlFSnJNNFhQNXhLdl95SllXblpvZ3ZlVGxIRklQNHVENEkwUHBJRm1zcGJlNW5Na2VJeWRMRnNmRXN4aVUxSnJvclZjeHhibmRNZWxuOEdaUQ?oc=5",
    "published": "Wed, 07 May 2025 03:01:00 GMT",
    "sentiment": 0.35,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.103,
    "keywords": [
      "bloomberg",
      "changing",
      "com",
      "conflict",
      "escalates"
    ]
  },
  {
    "Id": 45,
    "source": "Google News",
    "region": "PK",
    "title": "PIA grounds flights for 12 hours amid IndiaPakistan military escalation Arab News",
    "summary": "PIA grounds flights for 12 hours amid IndiaPakistan military escalation Arab News Asian airlines reroute, cancel flights due to IndiaPakistan fighting Reuters Major airlines are avoiding Pakistans airspace as tensions with India simmer following tourist massacre CNN Foreign airlines avoiding Pakistan airspace Dawn After India's Operation Sindoor strikes on Pakistan, several airports closed Here's a list Hindustan Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9ZXzBkN3ZGUkQydGVUQ201bWVKaS1pdmhlakhrYVF3cGZzU2FyYTYwRGIxM3FHZXhRbU1MVG5ndkFVRG1VNXhwdTFLSEZiV0dpTGVfSFJhWHZTUQ?oc=5",
    "published": "Wed, 07 May 2025 05:21:49 GMT",
    "sentiment": -0.05416666666666667,
    "importance": 0.8,
    "relevance": 0.476,
    "authenticity": 0.6,
    "info_gain": 0.335,
    "keywords": [
      "airlines",
      "flights",
      "indiapakistan",
      "12",
      "airspace"
    ]
  },
  {
    "Id": 46,
    "source": "Google News",
    "region": "PK",
    "title": "Judges disagree on fate of reviews against reserved seats verdict Dawn",
    "summary": "Judges disagree on fate of reviews against reserved seats verdict Dawn Two judges object as SC accepts review pleas on reserved seats for hearing Dawn How ECP can seek a review while failing to implement ruling, asks Justice Ayesha nation.com.pk Review petitions against PHC judgement Clear error in verdict must be identified, rules SC Business Recorder SC forms new larger bench for reserved seats case ARY News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMioAFBVV95cUxOM0hjZ0hTQUI4U3dfOEFYZ0I3UWktZTNhYWg2dTFndVIyTnU0cTlmYzUzb0RsZ3hEVVpvV3RoSWlSSTVkWnh1UGRTbURQUVNKb2lWaG82UXc3QklxVEdjWHgtclJLcmNiVGl5YTRDWlozcFhqUnJkUnpydTBGdWdla1VXdWpxZ1FVdnFkbHlFSVlsOS0yanJwRExXdDRHekw30gFOQVVfeXFMT0lpTTRTSHZhVnNjR2tuazJZeFBUcTh4SFpoVEJRRjh2emFueVZJOThmYWZmNHJPQnQteW16bWtsS2N3ZmhXMGZIdlgyTmRR?oc=5",
    "published": "Wed, 07 May 2025 00:37:27 GMT",
    "sentiment": 0.0787878787878788,
    "importance": 0.667,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.375,
    "keywords": [
      "reserved",
      "seats",
      "dawn",
      "judges",
      "review"
    ]
  },
  {
    "Id": 47,
    "source": "Google News",
    "region": "PK",
    "title": "UN chief urges restraint after India's missile attacks on Pakistan The Express Tribune",
    "summary": "UN chief urges restraint after India's missile attacks on Pakistan The Express Tribune View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxPa0hBRUtBVl9LOWg5Zjd1MXZqNkQxbzBxN2t5aFlPRHlCbGtzOS1lLXhhUlExMW5YWUhBSnFlb1JyUTlkQjQ4RGVrWE1UdnNUSENEdTVuQzU0MHFjdkZVb1RFcWZaZVBrR0dKdzBnTXluYzdFUEZaSWhGbzY3ZzlVaUlRQTBjNUlCUGtvaDJWd21uOWxYMlgwcGpFRC1BdXhzQXE0QtIBrAFBVV95cUxQTERXY3RnRl9tdVYzS2ZBSUFTX2xaNUdvVXhSZzFjR3lTb2w2VDVObmtUMGx4NjdIYm5qd3N4T0VsNWFMaE1rYVFRZ3pXWXBjcE1MTEFNRU9MZi1SMnNVdUxJMTRZWjNvdGQ1NFhVZlFKTGhUdHAzUVlyc3dKVi1meGxBTUtLaHh0enV5MG9udkVObWkxVlN5TVh4bng0LW9fbXJyQ3R0RUFBRHV4?oc=5",
    "published": "Wed, 07 May 2025 04:40:07 GMT",
    "sentiment": 0.35,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.123,
    "keywords": [
      "attacks",
      "chief",
      "express",
      "india",
      "missile"
    ]
  },
  {
    "Id": 48,
    "source": "Google News",
    "region": "PK",
    "title": "PM Shehbaz, others condemn Indian strikes on Pakistan The News International",
    "summary": "PM Shehbaz, others condemn Indian strikes on Pakistan The News International PM lauds role of ISI in safeguarding national interests RADIO PAKISTAN Pakistan calls on world to pave way for peace Dawn HighLevel NSC meeting begins for robust response to Indian attacks ARY News PM Shehbaz invites UK to join neutral probe into Pahalgam incident The Express Tribune",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxOMVgyQ0tTWE1RWlduTjg2dFlPMkZvcUlpb1g3RXJjR1BDYTh0MVBJY0pETFZwQ2tQWnhpdVR6SzFTQlZXZG43SW9WcUwwMEMwcmx6ODhZQUhQbVJUTnNjOHBGZEh6MGJrc093LTNKOTEtUmtHa1RpcGEwN0RpSUpxUXVMcFYzNDRWS3E5c0ZTUW1UUUg4aFlqQ3lR?oc=5",
    "published": "Wed, 07 May 2025 00:41:00 GMT",
    "sentiment": 0.0,
    "importance": 0.667,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.309,
    "keywords": [
      "pakistan",
      "pm",
      "indian",
      "news",
      "shehbaz"
    ]
  },
  {
    "Id": 49,
    "source": "Google News",
    "region": "PK",
    "title": "India to stop water flowing across international borders, Modi says BBC",
    "summary": "India to stop water flowing across international borders, Modi says BBCInternational pressure credited for improvement in Chenab flows Dawn Dams, Deception, And The Drumbeats Of War Unmasking Indias Outdated Narrative The Friday Times Indias Water Terrorism nation.com.pk Modi says India will retain share of water it once sent outside the country Reuters",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE0wTmVITjVMN2d2T0Fvdk1OQTBQVUFDR3pxb1c2YTJpdHJCYk1fMTdYa21hVmZoTXZNaTlsYW9aTWwzUHV5dGZqc2s5MEpVeUFHaDk5SjZDUFRHZ9IBX0FVX3lxTE9sa1BqenI0TUh6dHcwcndDV1ZPMzk0SDl0d0Z5ZVdldk5FS2pYaC05U3RxbzVlT1NTbml2TElNZnhJSlkyazJmRWs2Qno1ZDluZmt6a0hIWURNRzBuaTBn?oc=5",
    "published": "Wed, 07 May 2025 04:42:35 GMT",
    "sentiment": -0.10000000000000002,
    "importance": 0.8,
    "relevance": 0.529,
    "authenticity": 0.6,
    "info_gain": 0.322,
    "keywords": [
      "water",
      "india",
      "modi",
      "says",
      "borders"
    ]
  },
  {
    "Id": 50,
    "source": "Google News",
    "region": "PK",
    "title": "Pension, tax relief thresholds FBR working on two major budget proposals Business Recorder",
    "summary": "Pension, tax relief thresholds FBR working on two major budget proposals Business Recorder No relief Dawn Govt mulls tax on Rs400,000 monthly pensions ahead of IMF talks Mettis Global FBR mulls new tax on high pensions, increase in income tax exemption threshold report Profit by Pakistan Today FBR suggests pension tax ahead of key IMF budget talks Geo.tv",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiUEFVX3lxTFBISFhVM0w3VlRqdVlQQmVFc2lhOVRzN0ZFUmpHTFNyTHVram93VVI1a3NDZWRRbzBINjVhZ2JYd2tudjdqNm83dDdjMV9aZWVi0gFWQVVfeXFMT3VtV1c1dENBbTNZcS10UlFJcWpwMHNhMDlWc2JSRWJfMnVidDdWWE9odGp4X21DWGhIS1RDTXFJNEdfeTRPWEktY1c2N1VyNnJ0TUlPaWc?oc=5",
    "published": "Mon, 05 May 2025 22:19:36 GMT",
    "sentiment": 0.07022727272727274,
    "importance": 0.533,
    "relevance": 0.469,
    "authenticity": 0.6,
    "info_gain": 0.289,
    "keywords": [
      "tax",
      "fbr",
      "budget",
      "pension",
      "relief"
    ]
  },
  {
    "Id": 51,
    "source": "Google News",
    "region": "PK",
    "title": "Live Updates India attacks Pakistan from 3 sides; Pakistan shoots down 5 Indian jets SamaaNews",
    "summary": "Live Updates India attacks Pakistan from 3 sides; Pakistan shoots down 5 Indian jets SamaaNews Seven dead, 38 injured as Pakistan Army targets civilian areas along Lo C in Jamp;K Times of India Operation Sindoor Live Updates PM's 3nation visit to Norway, Croatia, Netherlands called off, says report India Today Six killed, over 30 injured in Pak shelling; Indian Army responding in equal measure Officials The Hindu Indian Army inflicts casualties on Pakistani forces in retaliation to ceasefire violations Defence source The Economic Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOTGRRcndwQlpFYWhGTnd6WU9fWEdIVnl4MWtrOTFVdDVoTkwwYlBXY08yOVhGMkxkVFp5Tl93X09QWmdvWmJNcDhlS002SDVBTGRkeUhPZFd6VjdlX2RQUC1zX0tLTktZNEdyTXpHVUlKUkJ2dHBCd0ZsSzh3QzdtLUZsdnNOWVJva1R2Zjk4TE5Ydklua0E?oc=5",
    "published": "Tue, 06 May 2025 21:03:34 GMT",
    "sentiment": -0.01133557800224468,
    "importance": 0.667,
    "relevance": 0.337,
    "authenticity": 0.6,
    "info_gain": 0.451,
    "keywords": [
      "pakistan",
      "india",
      "indian",
      "army",
      "live"
    ]
  },
  {
    "Id": 52,
    "source": "Google News",
    "region": "PK",
    "title": "Trump news at a glance Canada not for sale, says Carney; trans military ban proceeds for now The Guardian",
    "summary": "Trump news at a glance Canada not for sale, says Carney; trans military ban proceeds for now The Guardian Carney tells Trump that Canada 'won't be for sale, ever' BBC Key takeaways from Donald Trumps meeting with Canadas PM Mark Carney Al Jazeera Statement by Prime Minister Carney on World Press Freedom Day pm.gc.ca May 6, 2025 Donald Trump presidency news CNN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxNV25zQXhyWFNMR2pPZk92M3R3ZGJRMHc1M09DOHlCY1FNbDdBT1pEMTRjRk1SRHlMTUxyVy1LYnIzY3FianZLeTd3WWtWQ25CUXdpalgtOGlMQkE5N1I0T05CbGFvM2FGYmFpVFpmUU9xbFA0dmhxSl9VVVc4SnRVYjZlMW9uSHh3QzROZmxsTjhGZnhZZnpMblFrZU1zZw?oc=5",
    "published": "Wed, 07 May 2025 01:25:59 GMT",
    "sentiment": -0.06666666666666667,
    "importance": 0.667,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.356,
    "keywords": [
      "carney",
      "trump",
      "canada",
      "news",
      "sale"
    ]
  },
  {
    "Id": 53,
    "source": "Google News",
    "region": "US",
    "title": "REAL ID is now required for air travel in America. Heres what to expect at airports across the US CNN",
    "summary": "REAL ID is now required for air travel in America. Heres what to expect at airports across the US CNN Travelers Without a Real ID Will Still Be Allowed to Fly, Noem Says The New York Times Kristi Noem says travelers without Real ID will still be able to fly after deadline The Guardian What airlines are saying to people who don't have a Real ID yet Business Insider The Real ID deadline is finally here. How bad will it get at airports as longdelayed rules hit? Los Angeles Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1MREdGUEFLakZXY0tibHI4aDFHQ29LWHVzaEI2QlY3RXlCQW9mQ0ZWRWh4QllBeFZPLTNkSEl3UTdtQmF1cXJKeXJGR0xDdnVIUm8tSTRlb2F6QUJOWDBWZ0xnTThES0EyRng0cnExZkJvcWNEZUN3atIBfkFVX3lxTE9HalZEdmRxeC1vTUVscVNzaC0tdkxMcHlRMzItbnpGUFJFMHU4M1hDeWVocXcySjdRRVAwbGtXNktxeHRZeEhqblpPamlzQ0J5U3dOTmN6M3J1MzQ3OTZ4cFExNllQckl2alJCSGtoMmlEdU5EUmd5MGZuZGNuZw?oc=5",
    "published": "Wed, 07 May 2025 04:30:00 GMT",
    "sentiment": 0.22803030303030306,
    "importance": 0.8,
    "relevance": 0.303,
    "authenticity": 0.6,
    "info_gain": 0.423,
    "keywords": [
      "id",
      "real",
      "airports",
      "air",
      "america"
    ]
  },
  {
    "Id": 54,
    "source": "Google News",
    "region": "US",
    "title": "Trump Says U.S. Will End Bombings of Houthi Militants in Yemen The New York Times",
    "summary": "Trump Says U.S. Will End Bombings of Houthi Militants in Yemen The New York Times Trump says bombing of Yemen to stop as Oman confirms USHouthi ceasefire Al Jazeera Trump announces US, Houthis to stop bombing each other Houthis argue they will 'evaluate' ceasefire proposal ABC News A confusing US peace deal, explained vox.com White House calls Yemen ceasefire a 'WIN' experts warn Houthis may not hold the line Fox News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTFByaURPY3hjbkwxaExQWXhwa1RNRXVqVHp2TTBMRWl3WlU1bHVUdHp3NmVQWHBaRVZCNUdZZkJGMWtlNUlBVkZUeVlUcXo4Yjd1MWxTTjFlSEN2akFRMmVFYWh4NkpCYy1RRFVrSkV4emNtUm8tTXY1bkJLQjBXdw?oc=5",
    "published": "Wed, 07 May 2025 03:27:09 GMT",
    "sentiment": 0.10795454545454546,
    "importance": 0.8,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "trump",
      "yemen",
      "ceasefire",
      "houthis",
      "says"
    ]
  },
  {
    "Id": 55,
    "source": "Google News",
    "region": "US",
    "title": "Salt Lake City unveils new flags to circumvent Utah's flag law FOX 13 News Utah",
    "summary": "Salt Lake City unveils new flags to circumvent Utah's flag law FOX 13 News Utah Salt Lake City adopts 3 new flags to bypass new state flag law KSL News Salt Lake City backs 3 new flags to get around Utah ban on Pride flags NBC News SLC council unanimously pass Pride, Juneteenth themed city flags ahead of state flag ban ABC4 Utah Salt Lake City adopts four flags to represent residents, visitors SLC.gov",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxOdk1ULTREdU5HZEh3WXctMDJXcHlMdWtfYmVBSjRJVkxLNllvdGZGX2JSVGdFejAtVUNXMktUUGFZRDFwRWxKc213bDJUVV9OLVdBZzhDNTZna0FVZW9TSmdPWk5VQ3dHYTBxdVVJUDhZOFJhUURhY1dyRG84SEF5eUp2TWFFalAyOF9yOGFuanU4UGc?oc=5",
    "published": "Wed, 07 May 2025 00:10:13 GMT",
    "sentiment": 0.13636363636363635,
    "importance": 0.667,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.277,
    "keywords": [
      "flags",
      "city",
      "utah",
      "lake",
      "new"
    ]
  },
  {
    "Id": 56,
    "source": "Google News",
    "region": "GB",
    "title": "Wednesday briefing Pakistan vows response to act of war after Indias crossborder strikes The Guardian",
    "summary": "Wednesday briefing Pakistan vows response to act of war after Indias crossborder strikes The Guardian IndiaPakistan live 'Dozens dead' as India launches strikes; Pakistani military says five Indian jets shot down Sky News Who is Wing Commander Vyomika Singh, IAF chopper pilot at centre stage for 'Operation Sindoor' briefing Times of India IndiaPakistan live Pakistan says it shot down jets following Indian air strikes The Independent IndiaPakistan latest Countries at brink of war amid escalation in Kashmir The Telegraph",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPVFZPQmYtcmVmY18wRGJRSXpNSWVCYTZNNjVQM3dIZF8tbjNlNXpGTFJfQTh6amJFQURIMVI4WGR2aHhCMjNaeEJhMzNNN216bFdEQkcybVExNGxDTGN3ZmF3dUV2Mng5NUFNbjZPb01wTXU2MFBvYnB6eVZUaTVBa3U1Qlhvb1FyUnZNWHZYNGk1eUh3czV0cllQMjktWTZMd2V0Q0hTMDE3ZWw5eS10NUdaVENXbkhrank2YzM0cGh5RjRfOXVTSFFLbWlYLTNG?oc=5",
    "published": "Wed, 07 May 2025 06:29:00 GMT",
    "sentiment": 0.017957351290684615,
    "importance": 0.8,
    "relevance": 0.355,
    "authenticity": 0.6,
    "info_gain": 0.396,
    "keywords": [
      "strikes",
      "briefing",
      "indiapakistan",
      "pakistan",
      "war"
    ]
  },
  {
    "Id": 57,
    "source": "Google News",
    "region": "GB",
    "title": "Donald Trump humiliated Mark Carney at their White House meeting The Telegraph",
    "summary": "Donald Trump humiliated Mark Carney at their White House meeting The Telegraph Carney tells Trump that Canada 'won't be for sale, ever' BBC Carney played nice then Trump delivered the insult hed been planning all along The Independent Trump news at a glance Canada not for sale, says Carney; trans military ban proceeds for now The Guardian Mark Carney holds his own in Oval Office encounter with Donald Trump Financial Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQOWYyYm1ZZFJuZ3ozTEJPb1VlMVNYMVpEU1B4S3lDcEJLT3Q2OVhGdklrOWxFUm5XRzVEbWhzZ2FlOF9TNFpJNVlLRWl5aDc5bmQtYlZhcEtPSXhURkpId01sTnVJQkg0SmZObEw1eDBxWmlaNDFNM2J0T1hmM0lINU9XYURpRFVUMzBmTU94Nms1Q0VoeXExWUFrNFBqS041N1NEOWVBanRLdw?oc=5",
    "published": "Tue, 06 May 2025 21:14:00 GMT",
    "sentiment": 0.15714285714285717,
    "importance": 0.667,
    "relevance": 0.401,
    "authenticity": 0.6,
    "info_gain": 0.363,
    "keywords": [
      "carney",
      "trump",
      "donald",
      "mark",
      "canada"
    ]
  },
  {
    "Id": 58,
    "source": "Google News",
    "region": "GB",
    "title": "Criminals who skip sentencing could face two more years in jail BBC",
    "summary": "Criminals who skip sentencing could face two more years in jail BBC Criminals who skip sentencing could face more jail time BBC Criminals in England and Wales face sanctions for refusing to attend sentencing The Guardian More jail time for criminals who refuse to attend sentencing hearings Sky News Common sense at last! Killers to face these punishments for hiding in cells when sentenced Daily Express",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE0zVlZiTmpiWmRkdDc1Y3RyLTRET1JHbHc3VFdzTHprbEpMSDVPTWx2R3MtOVMycVlzdWRiR1Z1ajZvWlctaEdaNk5QemI3eHlnRGxPQVZLMGN2Z9IBX0FVX3lxTE9iZ3diQ1pTU1dxSVRmVkh1b29KOTl3MWpoN2wyLUNjQ3NEYjg1aV9QMmFlSFBVMW5XMHRDUXRtZXoyVHVlNGFFR2JHOE9zX2xodHdoMzBKSi1DOVBtSEZZ?oc=5",
    "published": "Wed, 07 May 2025 06:15:20 GMT",
    "sentiment": 0.11818181818181817,
    "importance": 0.8,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.277,
    "keywords": [
      "criminals",
      "face",
      "sentencing",
      "jail",
      "bbc"
    ]
  },
  {
    "Id": 59,
    "source": "Google News",
    "region": "GB",
    "title": "MSC Virtuosa cruise ship murder suspect released on bail BBC",
    "summary": "MSC Virtuosa cruise ship murder suspect released on bail BBC Murder arrest after man's death on cruise ship BBC Man arrested on suspicion of murder after cruise ship death ITVX Man who died on luxury cruise ship was 'on stag do when chaos broke out' Devon Live Tributes paid after tragic death of man on cruise ship Daily Echo",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE5ZVUl6STBhVEF2blJ0MzhzUlRfdXI3cFI0SWY4dDk3S245QWFLeDZnMVd5a3dxejM2Nms3aHNkZjNTSjVOaURnV1hQQXVfSExUS0ozQzZmVEs3OVZw0gFiQVVfeXFMTzNIWkR4Wl9ZTF9IS1R0aXE4R2RXYUxXaUN5d0V2Si1TbVlkSGQ2bWVCSnhnTVVtY0Z0R0d1c2R4SUNaSkdKUWZfbzAzYVNxa3kwLVlLMGRDb3NGNEMzV1FwZVE?oc=5",
    "published": "Wed, 07 May 2025 06:20:53 GMT",
    "sentiment": -0.16590909090909092,
    "importance": 0.8,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.25,
    "keywords": [
      "cruise",
      "ship",
      "man",
      "murder",
      "bbc"
    ]
  },
  {
    "Id": 60,
    "source": "Google News",
    "region": "PK",
    "title": "What we know about India's strike on Pakistan and Pakistanadministered Kashmir BBC",
    "summary": "What we know about India's strike on Pakistan and Pakistanadministered Kashmir BBC In pictures Aftermath of Indias latenight strikes in Pakistan Dawn Residents of Pakistani Kashmir say they fled into hills during Indian strikes Reuters Operation Sindoor India Launches Missile Strike Against Pakistan Forbes India strikes Pakistan after tourist attack; Islamabad vows to settle the score The Times of Israel",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE83ZG1tY0xacEJXM1piVzh4OHhKejEtU3RxWGg3UmJ2NUY2SDZQMTM1cXdLdjZxNUx5azExTl9HNnNOMWI3bUdPQVBTRUFCWms5b0E5N05RZXJxZ9IBX0FVX3lxTE9TV0FtQkdLRWZZRVJSQmR4RFhhTm45ZFAwNDZCME13T0M1WFRIcHkzdEFhdXI1S01kb0FLVDJnYWRSM1dZNG1JQndFaEVSNWFzVjVEa0FJb3RKODZhWkdF?oc=5",
    "published": "Wed, 07 May 2025 06:26:47 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 0.463,
    "authenticity": 0.6,
    "info_gain": 0.335,
    "keywords": [
      "pakistan",
      "india",
      "kashmir",
      "strike",
      "strikes"
    ]
  },
  {
    "Id": 61,
    "source": "Google News",
    "region": "PK",
    "title": "Info Minister condemns Indian attacks on civilian population inside Pakistan RADIO PAKISTAN",
    "summary": "Info Minister condemns Indian attacks on civilian population inside Pakistan RADIO PAKISTAN Pakistan vows ongoing response to Indian aggression Tarar The Express Tribune Pakistan Minister Denies Terror Camps After India's Op Sindoor, Anchor Shuts Him Down On Live TV News18 News18India admits defeat by raising white flag at Lo C, says Tarar english.aaj.tv Pakistan leads journalists group to Azad Kashmir, aiming to debunk Indian claims on militant camps Arab News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxOcXRYdlFjdHJrZk44ZFBGMjFGcW84OGs2Q01qV3dBR3Z0T2tGX0NpWG96T244eUxVZTZCUlBaQi05MjZRNi1VOFg1bWF4QlhCVVhyVUlkeFdzTkV0LUF3b1JSdHZJV25HNGwxNmRlcHhvem5CLVlaVi0wQkNTWTZhVnJqQi1ZSlZYQ1RuXzhoamhMR1ZNZkFTbXg0WjMxUHB2UGcycnNCUkN3ZUNVZlBPRFN3?oc=5",
    "published": "Wed, 07 May 2025 02:36:49 GMT",
    "sentiment": -0.006397306397306411,
    "importance": 0.8,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.415,
    "keywords": [
      "pakistan",
      "indian",
      "minister",
      "attacks",
      "camps"
    ]
  },
  {
    "Id": 62,
    "source": "Google News",
    "region": "PK",
    "title": "Netanyahu's plan for Gaza risks dividing Israel, killing Palestinians and horrifying world BBC",
    "summary": "Netanyahu's plan for Gaza risks dividing Israel, killing Palestinians and horrifying world BBC No sense in Gaza ceasefire talks amid Israels hunger war Hamas Al Jazeera Gaza will be entirely destroyed, Israeli minister says The Guardian Netanyahu chooses war and his political survival as Israelis demand hostage deal CNN Smotrich Gaza will be 'totally destroyed' within months, population 'concentrated' in narrow border area The Times of Israel",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5laWNKQ2FBMnhKR0dVWVZZUUNpYnEtb3VNU2ozSEszQUVXMl93bVBKRXNYV3NGUG5BdjRfSU1DWTVvTllFS3I0Ylp0ZkNPaTdEdVpkaHRIbkxfUdIBX0FVX3lxTE1Va3JxbEpJNnZtVFFVaDRJcUx1dkxSS1pLbnBFME5ibE5jXzExdVRwdWpJQ1NyLS1vSWF1aEdxVkJMQXBMdEc5V2ZyRWZRTU9NZzdhNDVUNmdiaEg4YTBZ?oc=5",
    "published": "Tue, 06 May 2025 19:40:40 GMT",
    "sentiment": -0.3333333333333333,
    "importance": 0.667,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.369,
    "keywords": [
      "gaza",
      "israel",
      "netanyahu",
      "bbc",
      "destroyed"
    ]
  },
  {
    "Id": 63,
    "source": "Google News",
    "region": "PK",
    "title": "India admits defeat by raising white flag at Line of Control Tarar ARY News",
    "summary": "India admits defeat by raising white flag at Line of Control Tarar ARY News Seven dead, 38 injured as Pakistan Army targets civilian areas along Lo C in Jamp;K Times of India Six killed, over 30 injured in Pak shelling; Indian Army responding in equal measure Officials The Hindu Lo C hots up after Op Sindoor strikes, 3 Indians killed; evacuations ordered India Today Indian Army inflicts casualties on Pakistani forces in retaliation to ceasefire violations Defence source The Economic Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNSXMwdDFYOV9JMkpUZG9GNVp1d200ZnhTUFFIUHVadjNtQmdwdFFEQjBfUFhHZjRKcWRaVi13TXFINzMtd3ZKdVd3dngtR2s1TXpvcjBLeWNaRVdQQ2poajlVV1RWdlNMQ25KUjljRF9OQWNobmJxUnlUV3g2YUpFN2FWdDV6cmhIV2JzOFlB0gGTAUFVX3lxTFBoQkV1d3BHYzFqSTJTT0VNUlVtenFZbF9vXzk4THpPa2ZQOXo2SnFSbWRGd2VPMWpQWEdFQjRwTXF4RWJxbF9kNTZpeldlTU44aTdyeDZzQTAyZlBkTjAzS3pENkRpNkczMzQ2UFVGekl4SnhvQ1ZkTTNDWXluNC13SmNnbDVobU9LX3duamdjY3hENA?oc=5",
    "published": "Wed, 07 May 2025 05:00:58 GMT",
    "sentiment": -0.057142857142857155,
    "importance": 0.8,
    "relevance": 0.351,
    "authenticity": 0.6,
    "info_gain": 0.442,
    "keywords": [
      "india",
      "army",
      "admits",
      "ary",
      "control"
    ]
  },
  {
    "Id": 64,
    "source": "Google News",
    "region": "PK",
    "title": "Amid global decline, Pakistan ranked among 26 lowest HDI states Dawn",
    "summary": "Amid global decline, Pakistan ranked among 26 lowest HDI states Dawn Human Development progress slows to a 35year low according to UN Development Programme report United Nations Development Programme UN warns of unsettling development slowdown in 2024 The News International UNDP reports life expectancy income growth stalling and number of conflicts rising NEWS ON AIRUN Navigating AI's Promise and Climate Change's Urgency Jobaaj Stories",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQanVMWHB6a2gtRHNSWWJzQ0w5Ujk4QkhYUkFhMk90dVNFb1ZfSjdsVkFkdDBjYmd0SFpLMzdYRDQtanhySGRfUnltQ002RUw3ZUUtdjJKUkE4SndHUmczM29kZlJ3LTQ5LVBmVVBBRHV4MHdqOWpZWmxZbk1FLTNVMnNJcHpEMDg5LUFWeFBvU185ZDNPMmp3eU1WQ1Q?oc=5",
    "published": "Wed, 07 May 2025 00:37:37 GMT",
    "sentiment": -0.08333333333333333,
    "importance": 0.667,
    "relevance": 0.445,
    "authenticity": 0.6,
    "info_gain": 0.382,
    "keywords": [
      "development",
      "26",
      "amid",
      "dawn",
      "decline"
    ]
  },
  {
    "Id": 65,
    "source": "YouTube",
    "region": "US",
    "title": "Surprising Our Son with DREAM Room Transformation",
    "description": "Surprising Our Son with DREAM Room Transformation HERE To Gaming Channel More AMAZING Videos! Our Son's EPIC 14th Birthday Surprise Eating Only GAS STATION FOOD for 24 Hours!! i Survived the World's STRICTEST Babysitter First Class Dream Vacation! HOME ALONE Without Parents for 24 Hours Security Cameras Our Son's EPIC 13th BIRTHDAY SURPRISE! He Finally Got His DREAM Christmas PRESENT!! EMOTIONAL Father Tries to Find his SON Blindfolded! Son Tries to Find his MOM Blindfolded! our Son's EPIC Birthday Surprise! Extreme HIDE SEEK at LARGEST IKEA! ft Jordan Matter We ADOPTED a GIRL, But Our SON Gets JEALOUS! ft Jordan Matter FERRAN Has NEW PARENTS! Goodbye Son...W Rebecca Zamolo Watch our RECENT VIDEOS Watch Our POPULAR VIDEOS! Watch Our CHALLENGES FOLLOW ITG HERE ANDREA ALI FERRAN MILAN FAMILY DAWGS BUSINESS INQUIRIES royaltyfambusiness.com Welcome To THEROYALTYFAMILY! We're a multiculturalfamilybased in LA, here to spread positivity. We're all about challenges, fun games, adventure, and sharing ourfamilyjourney. Join us every week in sharing the good times of Andrea, Ali, Ferran Milan (and of course, our 2 dogs Gucci Princessa)! Best of all, we believe everyone can beROYALTYso dont forget to SUBSCRIBE!! The Worst Day of My Life... The Royalty Family",
    "category": "People & Blogs",
    "publishedAt": "2025-05-04T16:07:34Z",
    "channelTitle": "The Royalty Family",
    "viewCount": "6464454",
    "likeCount": "123451",
    "commentCount": "31355",
    "duration": "PT24M30S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.2474017518939394,
    "importance": 1.0,
    "relevance": 0.163,
    "authenticity": 0.333,
    "info_gain": 0.476,
    "keywords": [
      "son",
      "dream",
      "birthday",
      "epic",
      "ferran"
    ]
  },
  {
    "Id": 66,
    "source": "Google News",
    "region": "US",
    "title": "Operation Sindoor India Launches Missile Strike Against Pakistan Forbes",
    "summary": "Operation Sindoor India Launches Missile Strike Against Pakistan Forbes India and Pakistan are on the brink of wider conflict. Heres what we know CNN Devastation among locals after India strikes Pakistan and Pakistanadministered Kashmir BBC Indias missile attack shows that managing an IndiaPakistan crisis is easier said than done Bulletin of the Atomic Scientists'No Regret, No Despair' 10 Of Terror Boss Masood Azhar's Family Killed In Op Sindoor NDTV",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi3gFBVV95cUxOSWRwTDFISUFCNUMxcGlrQXlJS3dBU1JJeURDbnlsNzBYdmlDVXR1SUh5UkVsWERZZGJVRURXNXlJajh4VlZWaTAwR3RmR0I0ZVk3Ni1qUFNlVDVKaWxoSEpISkhnQjJBdVVha2FhTnI3QUtRem5yejJRb1Q2bTZQcXNNOTN2YjJ2ekZwYU0yTjd2TmZ0d2RCcEtDdUEya2hWdDJoTHEzbXp4bnlqakF3NFFGYVdxakRqNmJKWUI2V0NtT0V2Wm1BZ3hGV2dVU1BJVG9IS2N6NGtyckVnR1E?oc=5",
    "published": "Wed, 07 May 2025 05:59:00 GMT",
    "sentiment": -0.2,
    "importance": 0.8,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.408,
    "keywords": [
      "india",
      "pakistan",
      "missile",
      "sindoor",
      "forbes"
    ]
  },
  {
    "Id": 67,
    "source": "Google News",
    "region": "US",
    "title": "Trump says we just want to be friends as Canada PM torpedoes 51st state idea Trump administration The Guardian",
    "summary": "Trump says we just want to be friends as Canada PM torpedoes 51st state idea Trump administration The Guardian Trumps Oval Office meeting with Carney didnt reach Zelenskylevel tension. But it wasnt all neighborliness CNN Trump Live Updates Mark Carney Meeting, Houthis Announcement and More The New York Times Carney says Canada is not for sale, Trump replies, 'Never say never' Fox News Trump tariffs live updates Trump meets with Canada's Carney, hints at coming pharma tariffs Yahoo Finance",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPQk9HZHV4YnNIOERQdHdYaTBVWW04cTYtdWFHaHhGNjJ1UlJ6VUFTaVhhZnZrYVA1TXdDaTJaWldraGR0Rm1aZGJ6TmdQVTJ0SGEwR1JJOExSX3M0MlRtVUd0bXhGME4yVzZXZVZJLXVRTFVtcUpLamVfS0V1ZmY4Y2gxdG5LOEU?oc=5",
    "published": "Tue, 06 May 2025 17:53:00 GMT",
    "sentiment": 0.22727272727272727,
    "importance": 0.667,
    "relevance": 0.34,
    "authenticity": 0.6,
    "info_gain": 0.435,
    "keywords": [
      "trump",
      "canada",
      "carney",
      "says",
      "51st"
    ]
  },
  {
    "Id": 68,
    "source": "Google News",
    "region": "US",
    "title": "Judge presses Trump administration on returning 2nd wrongly deported man The Washington Post",
    "summary": "Judge presses Trump administration on returning 2nd wrongly deported man The Washington Post Federal judge orders return of deported migrant to US, rejecting Trump request Fox News Identity of second man illegally deported to El Salvador prison revealed The Guardian Illegal deportations are piling up, but no ones coming home Courthouse News Service Judge Declines to Remove Order Requiring Return of Deported Migrant The New York Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxNVVgxelJHRUhwVzF5TjQxR0lZSC1pUHZ5RHJFRnZDMUpmT1QxU1B6WDZ1a0EtUXd0eDFZQ0U1T1hiZml6NE1mTWRFejdCd2ZQRnhQV1RkZkRfWUlvNEYtcTBleWtwWW5KVThtcWNMUkhuUE0xOVBQSnBYeHJ6MGxoMllNcFhqRXZDbVEyeWNzdzY?oc=5",
    "published": "Wed, 07 May 2025 04:35:09 GMT",
    "sentiment": -0.23295454545454547,
    "importance": 0.8,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "deported",
      "judge",
      "man",
      "trump",
      "2nd"
    ]
  },
  {
    "Id": 69,
    "source": "Google News",
    "region": "US",
    "title": "Exclusive U.S. may soon deport migrants to Libya on military flight, sources say Reuters",
    "summary": "Exclusive U.S. may soon deport migrants to Libya on military flight, sources say Reuters Trump Administration Plans to Send Migrants to Libya on a Military Flight The New York Times Trump administration plans to send migrants to Libyas horrific detention centers The Independent Trump administration may soon deport migrants to Libya, U.S. officials say CBS News Donald Trump Planning to Send Migrants to Libya What We Know Newsweek",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQalVTRUVMVVlucjVjWF81TmVRU094ajVSelVmSHlVeUdwQXVVazlBcW8zSlBLWWdVa0tsZDdIVFVxTGxtWDdaMjMtUW9XT1hLZGwwQWRVaGJDY2NpcmtaSnJpR0N0UGM2VFpYc1lnZC1RdGQ3X3dLUFp4cE9pdy12UkptRDBzNG9FN3g2SmNEbk1EV0UweWgwNm1XMEVBQ2FobUNObWRma0hXUQ?oc=5",
    "published": "Wed, 07 May 2025 01:42:00 GMT",
    "sentiment": -0.19393939393939394,
    "importance": 0.667,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.29,
    "keywords": [
      "migrants",
      "libya",
      "trump",
      "administration",
      "deport"
    ]
  },
  {
    "Id": 70,
    "source": "Google News",
    "region": "US",
    "title": "5 Charged After Deadly Migrant Boat Incident in California The New York Times",
    "summary": "5 Charged After Deadly Migrant Boat Incident in California The New York Times5 people charged after migrant boat capsized off San Diego coast, killing 3, including 14yearold boy from India ABC7 Los Angeles Feds arrest 5, say all missing panga boat passengers found except for girl, 10 NBC 7 San Diego UPDATE 5 charged in fatal human smuggling incident at Torrey Pines State Beach 10News.com Eight migrants thought lost at sea found alive in southern California Reuters",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiigFBVV95cUxOejRzMnBiYXpOemVYejRnYlRheHU1TU14NklPdmpuQ0pYQ2g4MFFRWnZ2VkhzVDZyWl8wVTROWTlTWnFCVmNGcEZTa1FGaS1wa1NTNnI0Sm0xMm4zbGR4bEhJYndaNU1saS1Fenp1TFlRQnU4NThldjdwRmJSTENuZWpFOHRGMWRYRHc?oc=5",
    "published": "Wed, 07 May 2025 04:21:33 GMT",
    "sentiment": -0.030808080808080816,
    "importance": 0.8,
    "relevance": 0.371,
    "authenticity": 0.6,
    "info_gain": 0.449,
    "keywords": [
      "boat",
      "charged",
      "california",
      "incident",
      "migrant"
    ]
  },
  {
    "Id": 71,
    "source": "YouTube",
    "region": "GB",
    "title": "NCIS Tony Ziva First Look Trailer Paramount",
    "description": "Tony Ziva return this fall, only on Paramount! NCIS TONY ZIVA picks up in Paris, where Ziva and Tony have been raising their daughter. However, when Tonys security company is attacked, they must go on the run and try to figure out who is after them while learning to trust each other again. Like Paramount on Facebook Follow Paramount on X Follow Paramount on Instagram Follow Paramount on Threads Follow Paramount on Tik Tok With Paramount you can stream over 40,000 episodes and movies from CBS, BET, Comedy Central, MTV, Nickelodeon, Smithsonian Channel, Paramount Pictures, and Showtime including exclusive originals, live sports, and news. Plus, you can count on Paramount for the most iconic movies and the latest in live sports and news with your local CBS station, CBS News, CBS Sports HQ, and ET Live. Grab your free trial now and start streaming! Stream on Paramount where Paramount is available.",
    "category": "Entertainment",
    "publishedAt": "2025-05-05T21:59:23Z",
    "channelTitle": "Paramount Plus",
    "viewCount": "1107078",
    "likeCount": "4780",
    "commentCount": "350",
    "duration": "PT2M17S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.22569930069930066,
    "importance": 1.0,
    "relevance": 0.211,
    "authenticity": 0.333,
    "info_gain": 0.446,
    "keywords": [
      "paramount",
      "cbs",
      "follow",
      "tony",
      "ziva"
    ]
  },
  {
    "Id": 72,
    "source": "Google News",
    "region": "GB",
    "title": "Conclave live Cardinals from across the world gather in the Vatican to elect new pope BBC",
    "summary": "Conclave live Cardinals from across the world gather in the Vatican to elect new pope BBC Cardinals to begin choosing new pope in largest ever conclave The Guardian Conclave live Cardinals gather for secretive vote electing the next pope Sky News How to follow Papal Election on Vatican Media Vatican News Scheming cardinals plot to block another progressive pope The Telegraph",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE54RnYxR1IycURrX0dPUlA5RGhBVGNEaGhxTnY0UGxXOU15amJJSDZxXzJ0WkpMYVdBZlktX2ZCQkJFTjYyUERiMTJ2cDZ2cnlwMk5oVzBGYw?oc=5",
    "published": "Tue, 06 May 2025 22:43:00 GMT",
    "sentiment": 0.26868686868686864,
    "importance": 0.667,
    "relevance": 0.433,
    "authenticity": 0.6,
    "info_gain": 0.277,
    "keywords": [
      "cardinals",
      "pope",
      "conclave",
      "vatican",
      "gather"
    ]
  },
  {
    "Id": 73,
    "source": "Google News",
    "region": "GB",
    "title": "Government defends National Insurance exemption in UKIndia deal BBC",
    "summary": "Government defends National Insurance exemption in UKIndia deal BBC View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE83YW1DcjJkUjQ1aUNUQzRLbHI2UG9Oa01YOERESWFKTWRQaEhYYjFvN1dES0lhNU41aHZ5SnRtdTNKQ0x4Q0NHNklkTXRGQXhMTWlwZC05M3JPUdIBX0FVX3lxTE1aQ2JHdmRndDBXb2pjVGxhOW85MFUwaXpTaWFWNFFKdFVQdmtBM3JVNVpub2I2SHVKWTdBeFdNWFVpN3lmQ2x0RjlMY1pYaXUwckQyNmxvcUN2YWwtS3pR?oc=5",
    "published": "Wed, 07 May 2025 07:44:21 GMT",
    "sentiment": 0.35,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.096,
    "keywords": [
      "bbc",
      "deal",
      "defends",
      "exemption",
      "government"
    ]
  },
  {
    "Id": 74,
    "source": "Google News",
    "region": "GB",
    "title": "Criminals who refuse to attend sentencing to face longer jail time and loss of prison privileges The Independent",
    "summary": "Criminals who refuse to attend sentencing to face longer jail time and loss of prison privileges The Independent Criminals who skip sentencing could face two more years in jail BBC More jail time for criminals who refuse to attend sentencing hearings Sky News Criminals in England and Wales face sanctions for refusing to attend sentencing The Guardian Criminals who refuse to face judges risk tougher sentences The Telegraph",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMivAFBVV95cUxNQ1NjdWpBRVNoTW9uRWt0RTZRTW1CelVaNU11UVdnRzlSZEEzVU1ZdVFNYmZGdmVyNWhwZGRwZVpxeXRyTHpIbjVUQTVLdk0tUXFLMElERk4yWm9rbVNoT1g3US1QZmZTcy1ld2ZFTnNpQ0tkTTRCck5lTU8zZy1WbksxZW5TenhZYm1ndU5qS1N5dmNKZW51TGJVYVlxdkpld1I1Z0dIYWFUbFlFUHpENUFEYmxCenJqX2dNSA?oc=5",
    "published": "Wed, 07 May 2025 06:56:00 GMT",
    "sentiment": 0.075,
    "importance": 0.8,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.263,
    "keywords": [
      "criminals",
      "face",
      "sentencing",
      "attend",
      "jail"
    ]
  },
  {
    "Id": 75,
    "source": "Google News",
    "region": "GB",
    "title": "No 10 completely tone deaf on harm caused by winter fuel cut, critics say The Guardian",
    "summary": "No 10 completely tone deaf on harm caused by winter fuel cut, critics say The Guardian No 10 resists Labour calls for winter fuel rethink BBC Four times Rachel Reeves got her maths wrong The Telegraph Cuts leave voters doubting Labours ability to deliver change The Guardian Starmer rules out winter fuel allowance Uturn despite local elections backlash The Independent",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxQM0I2UVNkcWV3bVJXYXlDa0Q4cGVfdmFWV1gwbll1MzItcXFocnFwU3JsU3JkbXpGcEdoU2hXRVR3eFJpMG9wVmQ4VWh1V3d4Sm84aTZ1VUpHZVVjMmlwZWhLbkROWmpFY08yVUNXZVQ0aEI3dlFuUzFSbm5WZy1Td3pzTldxT3VqR25FZmpfRFVFNTJqYUUxUVpMdExKaW5TUDI3cm9DYW0wekRwTmZVZlJZYVBtUTFYNFVxaGpn?oc=5",
    "published": "Tue, 06 May 2025 17:55:00 GMT",
    "sentiment": -0.06,
    "importance": 0.667,
    "relevance": 0.439,
    "authenticity": 0.6,
    "info_gain": 0.329,
    "keywords": [
      "fuel",
      "winter",
      "10",
      "guardian",
      "caused"
    ]
  },
  {
    "Id": 76,
    "source": "Google News",
    "region": "GB",
    "title": "GCSE results day to change for thousands of students with new app BBC",
    "summary": "GCSE results day to change for thousands of students with new app BBCGCSE results to be released digitally in governmentbacked pilot Sky News Government brings exam records into 21st century GOV.UK Ministers hope new GCSE results app will save 30m a year Schools Week Thousands to receive GCSE results via app in pilot scheme The Independent",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTE93YWVxZ1JsV3RXanBUblNxMkx5NUh4ekw3T0F1alVuWm9DaU5EWXAwdVRyTmt0ZW14V3p6eHpsQUtybVlIQmFEOTZfVFMxV0FXWjFsemt3TmQ1bXM50gFiQVVfeXFMTUpRLW03bmYyNm1NemRtLXpHVXBpaHdwT1FUellnc2J4ci1KR1FBdzRDa3pYdWVtYWpWcVcyV00zdGlSQ2YwTHQ4RkNsRHA4OUxIY3RVQmJpZEg5aXY3OHZiOEE?oc=5",
    "published": "Tue, 06 May 2025 23:02:34 GMT",
    "sentiment": 0.06818181818181818,
    "importance": 0.667,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.303,
    "keywords": [
      "results",
      "app",
      "gcse",
      "new",
      "thousands"
    ]
  },
  {
    "Id": 77,
    "source": "Google News",
    "region": "PK",
    "title": "Devastation among locals after India strikes Pakistan and Pakistanadministered Kashmir BBC",
    "summary": "Devastation among locals after India strikes Pakistan and Pakistanadministered Kashmir BBC Global community reacts to Indian strikes in Pakistan Dawn Where did India hit Pakistan? Mapping Operation Sindoor and border strikes Al Jazeera Operation Sindoor India Launches Missile Strike Against Pakistan Forbes Indian strikes in Pakistan kill Jaish chief Masood Azhars 10 family members, 4 close aides Hindustan Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE53TWNrbFRZODZkc3ZRWEVoZzRucE9VOHZIMEtwRm1Ybmh1NmFveFNRWkg1alA2cTZEcmJLN3ZEbzZKNG1MRGdfVzM5VVVxTFdIWGItM1M5UUFCZ9IBX0FVX3lxTE03aVdjYmNFZklJOUtDWUw2Q2p6em1tbFZpdDJGQzhXNnU4N1V2cEZFUFhoYVF1aS1zaENQVVM5TVZ1R3ZmYWgtOTMtQlNlY0g4NkRCaDh3REFyU3FBWms0?oc=5",
    "published": "Wed, 07 May 2025 07:54:29 GMT",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 0.476,
    "authenticity": 0.6,
    "info_gain": 0.296,
    "keywords": [
      "pakistan",
      "strikes",
      "india",
      "bbc",
      "devastation"
    ]
  },
  {
    "Id": 78,
    "source": "Google News",
    "region": "PK",
    "title": "Netherlands urges review of EUIsrael trade deal over catastrophic Gaza aid block The Guardian",
    "summary": "Netherlands urges review of EUIsrael trade deal over catastrophic Gaza aid block The Guardian Jeremy Bowen Netanyahu's plan for Gaza risks dividing Israel, killing Palestinians and horrifying world BBC No sense in Gaza ceasefire talks amid Israels hunger war Hamas Al Jazeera Gaza will be entirely destroyed, Israeli minister says The Guardian Netanyahu chooses war and his political survival as Israelis demand hostage deal CNN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxPeE5tNzh2ei1EV1BzajVuS3VPcFZLWWowa0s5Q0pyaXJuMmhFXzI5dFo5REFDa19ZcmxaejY4MlJyczAxY21ucHg2S3BqbjNKdmw5MzdVb2VnXzFaNkQ5aU1LMkNxVlc1RU12N2ZDNXpUazJ0UVRjN2dzZ2pvMHJBQzQ4bHNpVjB4WlBDUzJKQktwZUM5MVF3dlI4TzYyWGZPVllsc0FlZGxuNnFqR3BvRWZnQVI1Z0NWeEJqQ1lkbjljbHBrQWc?oc=5",
    "published": "Wed, 07 May 2025 07:50:00 GMT",
    "sentiment": -0.3,
    "importance": 1.0,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.375,
    "keywords": [
      "gaza",
      "deal",
      "guardian",
      "aid",
      "block"
    ]
  },
  {
    "Id": 79,
    "source": "Google News",
    "region": "PK",
    "title": "SC judges disagree on fate of reviews against reserved seats verdict Dawn",
    "summary": "SC judges disagree on fate of reviews against reserved seats verdict Dawn Two judges object as SC accepts review pleas on reserved seats for hearing Dawn How ECP can seek a review while failing to implement ruling, asks Justice Ayesha nation.com.pk Review petitions against PHC judgement Clear error in verdict must be identified, rules SC Business Recorder SC forms new larger bench for reserved seats case ARY News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiSEFVX3lxTE1RUUZyalBBWFhiM3NOS3pGN01zYnNMQnBOVnFuM2MxUnIxeTFpaG15bWFGOUdQbjdGM1J2dWJ6UVoxazRxRTY4ddIBTkFVX3lxTE9JaU00U0h2YVZzY0drbmsyWXhQVHE4eEhaaFRCUUY4dnphbnlWSTk4ZmFmZjRyT0J0LXltem1rbEtjd2ZoVzBmSHZYMk5kUQ?oc=5",
    "published": "Wed, 07 May 2025 00:37:27 GMT",
    "sentiment": 0.0787878787878788,
    "importance": 0.667,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.369,
    "keywords": [
      "sc",
      "reserved",
      "seats",
      "dawn",
      "judges"
    ]
  },
  {
    "Id": 80,
    "source": "Google News",
    "region": "PK",
    "title": "Airspace reopened in Lahore, Karachi following Indian strikes Dunya News",
    "summary": "Airspace reopened in Lahore, Karachi following Indian strikes Dunya News Flight Operations Resume at All Major Pakistani Airports After Suspension Amid Retaliatory Strikes Pakistan Today Pakistan airspace closed for 48 hours; Islamabad Airport shut down SamaaNews High alert temporarily shuts down Islamabad airport's airfield UNITED NEWS OF INDIAPIA partially resumes flight operation after IndiaPakistan tensions ARY News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPZUhZTi00LXU1aUhsX3JMa1c1WGY2WG1DSkxXazBsOUJDRHJzM3NWQnJqT2Z4VS1acHcxaUg3VF96bEIxNWUzRElEb0tsNWxtODNIWGlyWXJtUkN5azBuOFdUQV9zS0FGQnlfTnk3ZjBuaTVHR095clFuVkxRcmo1WUFWWjFwTXdMOERaNkpwbHVGc29GN2xCNDFLWXVMUWtpWUHSAVZBVV95cUxOQ1JfTk9welBROUdOQXFNeDRhM1BTeHVSWjVqeDJlOWo1aDRaRVBaUTB5LXphT2FCR0ppNHNUOHZIc3haaEpQd2xNeTAtWkpwRGU5LWFpQQ?oc=5",
    "published": "Wed, 07 May 2025 05:25:25 GMT",
    "sentiment": -0.036076388888888894,
    "importance": 0.8,
    "relevance": 0.497,
    "authenticity": 0.6,
    "info_gain": 0.355,
    "keywords": [
      "news",
      "airspace",
      "strikes",
      "airport",
      "dunya"
    ]
  },
  {
    "Id": 81,
    "source": "Google News",
    "region": "PK",
    "title": "Gaza 31 killed in Israeli strikes on school sheltering displaced ARY News",
    "summary": "Gaza 31 killed in Israeli strikes on school sheltering displaced ARY News Israeli attacks kill at least 16 as Gaza blockade accelerates starvation Al Jazeera Israeli airstrike on central Gaza school compound housing displaced people kills 22, as military operation intensifies CNNLIVE BLOG School Bombed in AlTuffah AlQassam Detonates Minefield in Khan Yunis Day 579 Palestine Chronicle Israeli army fire kills 4 more Palestinians in warravaged Gaza Anadolu Ajans",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxQclZid0R3Ni1MNGN0Vnk2LThVVHNhWkU2ZjdiQUo2c1l0R1EwLUdOZzFRakh1UVd3YWJwd3cxSzI1VXN3cV96NTZFQnpqRW9UbC1GT2s1clF1M3RFWkZKRVctOHc5VFBIV3BSbjdIcmNzd0tFRE5uWGhnRmhGZko5WEVORm5lSGNJcmdNQdIBkgFBVV95cUxNbDNfZ19tN2VDOFBpNUY5eGY2R003NXpGZFNkMUhPbkZ4bnVnNDdQa3RUaER5SEtsZjRXV3piNTQ2RW5KZWFRcWhxdEVvTXdsQTMzNjlSV0ZzV3NxdmNoZEhPMUk2NVR2RFBLaDhGZ1Z5TzdtMm9qNkktQWJjUzJtNlE4TWJQYnU1TkIwdGdTb2xvUQ?oc=5",
    "published": "Wed, 07 May 2025 05:21:13 GMT",
    "sentiment": -0.04999999999999999,
    "importance": 0.8,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "gaza",
      "israeli",
      "school",
      "displaced",
      "31"
    ]
  },
  {
    "Id": 219,
    "source": "Google News",
    "region": "GB",
    "title": "UK Foreign Office updates travel advice for British citizens in India and Pakistan as nations exchange fire Manchester Evening News",
    "summary": "UK Foreign Office updates travel advice for British citizens in India and Pakistan as nations exchange fire Manchester Evening News A war between India and Pakistan could soon spill onto British streets The Telegraph Britons warned to avoid IndiaPakistan border as Heathrow flights delayed London Evening Standard UK ready to support deescalation after India and Pakistan exchange fire The Independent Trump admin's latest warning 'Reconsider travel to Pakistan because...' Hindustan Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxOS0pxYVdPRFUwRm0xS3BpZlhqT2VFVzhQbFNMR3JHZHUzSGJqb0xMd3RwamduUXFfcmJGQTFlUTJOYTRiN1FTLURZZnBMdTg5RDBhdFp0REUyTlhtX3lvU2RzMGpLM2lKMDBienpFUjF0SE9pa01mT09JM3gyMXVzQkZ1OFluRzZLYkhkWm5vUTluZTNUX0ZyNGNzRnREd9IBowFBVV95cUxOdmh3enlXRmdhQ1VCblNCZWZvc29yVmlPUzNYc3hEYkZYNDhtWlNadWJ0SDIwVWlJS0FYckw3cmpJaVNpYkRHNksxa3dXSS14a2pUUXNqX1IyMTBQZmFuWnNpSjExaGM0SEhLTU52VGlnRjZCLTVaNGZYWkpPU3U5TEE4RkY1MmU5Nl9HbUJ0UTdQR2x3UURWQmtJSnRXWDZxZUU4?oc=5",
    "published": "Tue, 06 May 2025 23:42:00 GMT",
    "sentiment": 0.05,
    "importance": 0.667,
    "relevance": 0.366,
    "authenticity": 0.6,
    "info_gain": 0.363,
    "keywords": [
      "Pakistan",
      "India",
      "British",
      "Evening",
      "Foreign"
    ]
  },
  {
    "Id": 231,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan claims to have downed Indian warplanes, vows response to strikes The Washington Post",
    "summary": "Pakistan claims to have downed Indian warplanes, vows response to strikes The Washington Post View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPZjBwVTQ3aGNZNy1PMGF1azlGclNZTWlZYjZHamliMEM2Qm9IekN5YjZyREtSZ09ORFRoc0hGalNDdFg1dnBSYkgyM1BZOXBDSVZacWxnRWNQMlBsQUczQTNKY2w4Yk1aazltZmFpMllOVmh3ZjFsUFJ0ZjR1TUZfZm1MTjJSZ0k2?oc=5",
    "published": "Wed, 07 May 2025 07:35:04 GMT",
    "sentiment": 0.35,
    "importance": 0.8,
    "relevance": 0.981,
    "authenticity": 0.6,
    "info_gain": 0.123,
    "keywords": [
      "Indian",
      "Washington",
      "Post",
      "warplanes",
      "vows"
    ]
  },
  {
    "Id": 232,
    "source": "Google News",
    "region": "PK",
    "title": "FO summons Indian Charge dAffaires over unprovoked strikes in Pakistan RADIO PAKISTAN",
    "summary": "FO summons Indian Charge dAffaires over unprovoked strikes in Pakistan RADIO PAKISTANPM lauds role of ISI in safeguarding national interests RADIO PAKISTAN Pakistan calls on world to pave way for peace Dawn PM Shehbaz invites UK to join neutral probe into Pahalgam incident The Express Tribune National Security Committee to meet today amid Indian attack tensions english.aaj.tv",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPb0lKRjY0Q2Q1UW5kSVZXdGg5V0xxRlZPV1Zsd3VZOENtWEphaGh3d2xIMzhXdGxPX1VOQ0VCRWVDYVJRd2VIZVoxNFN1c1hjck9uSC12dTY1OWtqc1dieDFOR1RzMHJnQTV6UFo2N1RQWXlKUzRwcGtsMEU1RXUxZWVOVzQ4N1lUeWVYSWlSS2FlMTEwZjhHamFBYmN6T3pmb3pHcW95Wm9lUQ?oc=5",
    "published": "Wed, 07 May 2025 06:54:39 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.349,
    "keywords": [
      "Pakistan",
      "Indian",
      "RADIO",
      "Charge",
      "summons"
    ]
  },
  {
    "Id": 313,
    "source": "Google News",
    "region": "US",
    "title": "Stocks rise in tepid cheer for USChina talks Reuters",
    "summary": "Stocks rise in tepid cheer for USChina talks Reuters Trumps team is finally meeting with China. The future of the global economy is riding on its success CNNU.S. and Chinese officials will meet in Geneva in first sign of thaw in trade war NPR Stock market today Asian stocks rise as USChina trade talks announced, China cuts interest rates Yahoo Finance U.S. and China to Hold First Trade Talks Since Trumps Tariffs The New York Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBtbEtCMjQwSnJaQlFYSGxmRzZ0Mk1wSElrYzFUMXhpc3BrMDAwSEl4U21vUjBXaU9JOXVVSExhVVVtZW9XNXVkQ1JlUlozNmdoQnI2RUtUcXA2YmdMSVRDbFJDM21pS0hHOUNjTWtQcXhYNUFCV1E?oc=5",
    "published": "Wed, 07 May 2025 05:54:00 GMT",
    "sentiment": 0.802,
    "importance": 0.8,
    "relevance": 0.392,
    "authenticity": 0.6,
    "info_gain": 0.415,
    "keywords": [
      "Reuters",
      "talks",
      "China",
      "tepid",
      "cheer"
    ]
  },
  {
    "Id": 331,
    "source": "Google News",
    "region": "GB",
    "title": "Cardinals celebrate Mass in the Vatican before conclave to elect new pope BBC",
    "summary": "Cardinals celebrate Mass in the Vatican before conclave to elect new pope BBC Cardinals to begin choosing new pope in largest ever conclave The Guardian Age, ideology and Donald Trump The factors facing the conclave as it chooses the next pope Sky News Scheming cardinals plot to block another progressive pope The Telegraph Bitterly divided cardinals retreat for conclave to elect new pope Financial Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiV0FVX3lxTE54RnYxR1IycURrX0dPUlA5RGhBVGNEaGhxTnY0UGxXOU15amJJSDZxXzJ0WkpMYVdBZlktX2ZCQkJFTjYyUERiMTJ2cDZ2cnlwMk5oVzBGYw?oc=5",
    "published": "Tue, 06 May 2025 22:43:00 GMT",
    "sentiment": 0.5106,
    "importance": 0.667,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.296,
    "keywords": [
      "Cardinals",
      "pope",
      "Mass",
      "Vatican",
      "BBC"
    ]
  },
  {
    "Id": 335,
    "source": "Google News",
    "region": "GB",
    "title": "No 10 won't rethink winter fuel despite admitting it hurt them at ballot box ITV News ITVX",
    "summary": "No 10 won't rethink winter fuel despite admitting it hurt them at ballot box ITV News ITVX No 10 resists Labour calls for winter fuel rethink BBC Four times Rachel Reeves got her maths wrong The Telegraph Cuts leave voters doubting Labours ability to deliver change The Guardian Politics latest Farage hits polling high after election win with Starmer facing M Ps after election drubbing Sky News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQZXlDUmNWYXNEd2lkRHdLY3Q5ajd3dmMxaU9lYjNpQnRzdndaRGNaQnVyWWN6OVlIS0s0OFk5OHRLTTZrU2FwR2hMUTV5ODN5bGZoV1pUWEtrcmUydWlLQ04teko1RW5Vb05JWG8yemcwd1VObHYyTkVMUUJRUHJtalVlMXd0M2dLOGhEc0xua1RGUFNPdkpMZUlfTVFTSHdwMW1abDNCZnVFYUVHX2ktbUhR?oc=5",
    "published": "Tue, 06 May 2025 17:50:00 GMT",
    "sentiment": -0.2139,
    "importance": 0.667,
    "relevance": 0.397,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "ITV",
      "ITVX",
      "winter",
      "fuel",
      "rethink"
    ]
  },
  {
    "Id": 337,
    "source": "Google News",
    "region": "GB",
    "title": "A war between India and Pakistan could soon spill onto British streets The Telegraph",
    "summary": "A war between India and Pakistan could soon spill onto British streets The Telegraph UK ready to support deescalation after India and Pakistan exchange fire The Independent Britons warned to avoid IndiaPakistan border as Heathrow flights delayed London Evening Standard Trump admin's latest warning 'Reconsider travel to Pakistan because...' Hindustan Times UK warns against travel to parts of India and Pakistan amid deadly conflict ITVX",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxPM1VJNWpWZ3NjYzYydHBHSHNkR0VIVU9YUXBKSlVQQV9PT0l6ODVzVlY1RHNXWEZKTlk4Ny14a3gtTFFTZDdmWnhFM01fMUwxNWh2a2pDUFozc0NwcmtjMVJtbFRRekUxcEFVNWEtVUI5WWI3MERNTzNOcTZ2YjhKZ0pVNFZERDNEQ0dpNHhYQTUzbC1zNEdJQWdHNWc5UnA4clE?oc=5",
    "published": "Wed, 07 May 2025 08:12:00 GMT",
    "sentiment": -0.936,
    "importance": 0.8,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.349,
    "keywords": [
      "Pakistan",
      "India",
      "British",
      "Telegraph",
      "war"
    ]
  },
  {
    "Id": 338,
    "source": "Google News",
    "region": "GB",
    "title": "Police looking for 21yearold woman following 'out of character disappearance' Bournemouth Echo",
    "summary": "Police looking for 21yearold woman following 'out of character disappearance' Bournemouth Echo View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxNX0k0Z3diNW5YMWtOMHFKenNGclRSRmYzTVliVkFYWlBMSWo1OGFwSVNWaU1ZNHZBYTgtLXA2LXV2NS01NFd3c3ZyVlVvOFptejFwdUQ3WEsxTThaLThmS3VadzFZbWV5THJRYlJhLUUzMXhrTi1Ka3lzaFN5R1FuUGwtckhTeUlmRVl1NjFvNA?oc=5",
    "published": "Wed, 07 May 2025 06:15:54 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.116,
    "keywords": [
      "Bournemouth",
      "woman",
      "disappearance",
      "Echo",
      "Police"
    ]
  },
  {
    "Id": 339,
    "source": "Google News",
    "region": "GB",
    "title": "'Large' fire breaks out in block of flats opposite O2 arena Metro.co.uk",
    "summary": "'Large' fire breaks out in block of flats opposite O2 arena Metro.co.uk View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNWTVjU2JieXF0dXRnTjdsY21SOHZ3NGZJejVMWjVnNTl5SjZta2NncUt0NmViUy1ucEhzNkdpNWw2Q2tSU21Pem5IZ0F2ZUYwemFoQWdMUmxySGxBRFByU3FFa0RYdnlpYjJ3WUlHTmVaQXJrMXBLMGlHV0ZaTkxlQjBaMnFuX1hLVDIyQlVmUDQ3Z9IBlwFBVV95cUxObjJhZ0ZIT2NsejV3cWYtaGZucmVKMm5USUtsMlQxTzdzQ2VHc1BPQ003dlVvU09xMEtvejlReGlFQzNaVWxVOF95YjFuLUlUNEhiMERhZXB2SXJ1dkFCczJJLW9GU3JDMkZYSjl6YW94ODd1RnhVcUlXWmpuLXJUTDh2V2Jvb3MwREFhRzVleTF4T3Vocy0w?oc=5",
    "published": "Tue, 06 May 2025 20:17:00 GMT",
    "sentiment": -0.8625,
    "importance": 0.667,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.129,
    "keywords": [
      "Large",
      "arena",
      "fire",
      "opposite",
      "View"
    ]
  },
  {
    "Id": 352,
    "source": "Google News",
    "region": "PK",
    "title": "India admits 3 jets destroyed, hoists white flag to accept defeat SamaaNews",
    "summary": "India admits 3 jets destroyed, hoists white flag to accept defeat SamaaNews Operation Sindoor Live Updates Amit Shah holds key security meet after India's strikes in Pak, Po K India Today Seven dead, 38 injured as Pakistan Army targets civilian areas along Lo C in Jamp;K Times of India Six killed, over 30 injured in Pak shelling; Indian Army responding in equal measure Officials The Hindu India conceded 'defeat' at Lo C by raising white flags Tarar The Express Tribune",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxNNlNBbUI5TWZGZmQwcTdpQzBldG1fdUNNVnhJOGhEbnhla3hlZ0NUVXJSb0hmR2tfQ2lzcWdRdEVzUE56Tmc5MUx4Ujd2NVdNNWJ3R0RCNmhfaWk5VFN0R0lMeVpMZDhkOERwTkU3S0NOR2UwZElRekV3eVdYc2xtaTI5Yk03RTFDalM3OXc5ZERCWEFnRl9uYTM1VFY?oc=5",
    "published": "Wed, 07 May 2025 05:22:26 GMT",
    "sentiment": -0.9709,
    "importance": 0.8,
    "relevance": 0.362,
    "authenticity": 0.6,
    "info_gain": 0.435,
    "keywords": [
      "India",
      "Pak",
      "white",
      "defeat",
      "Army"
    ]
  },
  {
    "Id": 355,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan PM briefed on preparations against threat from India on visit to ISI headquarters Arab News",
    "summary": "Pakistan PM briefed on preparations against threat from India on visit to ISI headquarters Arab News PM lauds role of ISI in safeguarding national interests RADIO PAKISTAN Pakistan calls on world to pave way for peace Dawn National Security Committee to meet today amid Indian attack tensions english.aaj.tv PM Shehbaz invites UK to join neutral probe into Pahalgam incident The Express Tribune",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTFBrcDdoM05tZTR5ejVNTjBSTzN0VEVHejZ6Rl9BR1MtcEttc0hyQUtYaG5sd2lGVGRfRk1tclRzWUZuMjdBLTVWZjF1MWFIT2dKaEVsbEtNakY4UQ?oc=5",
    "published": "Tue, 06 May 2025 15:15:43 GMT",
    "sentiment": -0.34,
    "importance": 0.667,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "ISI",
      "India",
      "Arab",
      "Pakistan",
      "briefed"
    ]
  },
  {
    "Id": 358,
    "source": "Google News",
    "region": "PK",
    "title": "Israeli strikes kill 13 in Gaza school housing displaced families, medics say Middle East crisis live The Guardian",
    "summary": "Israeli strikes kill 13 in Gaza school housing displaced families, medics say Middle East crisis live The Guardian Israeli attacks kill at least 16 as Gaza blockade accelerates starvation Al Jazeera Israeli airstrike on central Gaza school compound housing displaced people kills 22, as military operation intensifies CNN Israeli strikes across Gaza kill more than 40 people as Israel prepares to ramp up its offensive Arab News LIVE BLOG School Bombed in AlTuffah AlQassam Detonates Minefield in Khan Yunis Day 579 Palestine Chronicle",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxORE1rcHJhaTZnSExOemE5azJvRnBnRjBmZDZURjd1OFN2R3hxX3YyUGpjbE0zVVlWOFdnblhWd1Q3MkMzems5bGtMNVE1dDNGOU5pcTcxT24yUkJ1d3FsWVFfYWhwNDBzSm9hSk95c0F4VEF1REtQMGstbWljVjNkeDVYMHRYNFpkNVgtT1dGSDNiV29EZ0ROQkRsYi1zUy05YkZtbU1ucWZZVV9zQjN0VnhieWZKcFZwLUZQLWY3MGoyeVJC?oc=5",
    "published": "Wed, 07 May 2025 07:27:00 GMT",
    "sentiment": -0.9927,
    "importance": 0.8,
    "relevance": 0.33,
    "authenticity": 0.6,
    "info_gain": 0.431,
    "keywords": [
      "Gaza",
      "Israeli",
      "school",
      "Middle",
      "East"
    ]
  },
  {
    "Id": 600,
    "source": "YouTube",
    "region": "US",
    "title": "Inter vs. Barcelona Extended Highlights UCL Semifinal Leg 2 CBS Sports Golazo",
    "description": "Inter jumped to an early twogoal lead away in the first leg, but Barcelona rallied back and then responded again after conceding in a threethree draw. Stream UCL on Paramount Watch UCL Extended Highlights Watch UCL Today with Thierry Henry, Kate Scott, Micah Richards and Jamie Carragher Subscribe to our other CBS Sports Golazo channels!",
    "category": "Sports",
    "publishedAt": "2025-05-06T22:21:03Z",
    "channelTitle": "CBS Sports Golazo",
    "viewCount": "1375194",
    "likeCount": "23053",
    "commentCount": "3634",
    "duration": "PT15M38S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 0.497,
    "authenticity": 0.333,
    "info_gain": 0.348,
    "keywords": [
      "Leg",
      "Barcelona",
      "UCL",
      "Sports",
      "Inter"
    ]
  },
  {
    "Id": 601,
    "source": "YouTube",
    "region": "US",
    "title": "HIGHLIGHTS Inter vs Barcelona UEFA Champions League Semifinal Vuelta TUDN",
    "description": "Partidazo que termina con el cuadro italiano avanzando a la gran Final del campeonato. Todos los partidos de la UEFA Champions League en Vi X",
    "category": "Sports",
    "publishedAt": "2025-05-06T21:57:51Z",
    "channelTitle": "TUDN USA",
    "viewCount": "1006945",
    "likeCount": "11444",
    "commentCount": "1830",
    "duration": "PT15M20S",
    "definition": "hd",
    "language": "es",
    "translated": "Highlights Inter vs Barcelona UEFA Champions League Semifinal Vuelta Tudn Partidazo that ends with the Italian painting by moving to the grand final of the championship.All UEFA Champions League matches in VI X",
    "sentiment": 0.7783,
    "importance": 1.0,
    "relevance": 0.953,
    "authenticity": 0.333,
    "info_gain": 0.201,
    "keywords": [
      "HIGHLIGHTS",
      "Champions",
      "UEFA",
      "League",
      "Inter"
    ]
  },
  {
    "Id": 605,
    "source": "YouTube",
    "region": "US",
    "title": "WARRIORS at TIMBERWOLVES FULL GAME 1 HIGHLIGHTS May 6, 2025",
    "description": "The Warriors defeated the Timberwolves, 9988 tonight in Minnesota. Buddy Hield finished with a teamhigh 24 points along with 8 rebounds 5 three pointers and 3 assists for the Warriors, while Jimmy Butler III tallied 20 points, 11 rebounds and 8 assists in the game. Anthony Edwards recorded 23 points, 14 rebounds and 3 steals. The Warriors lead the series 10. Never miss a moment with the latest news, trending stories and highlights to bring you closer to your favorite players and teams. Download now Subscribe to the NBA",
    "category": "Sports",
    "publishedAt": "2025-05-07T04:26:46Z",
    "channelTitle": "NBA",
    "viewCount": "1248215",
    "likeCount": "19131",
    "commentCount": "1832",
    "duration": "PT10M57S",
    "definition": "hd",
    "language": "en",
    "sentiment": -0.4508,
    "importance": 1.0,
    "relevance": 0.337,
    "authenticity": 0.333,
    "info_gain": 0.489,
    "keywords": [
      "WARRIORS",
      "TIMBERWOLVES",
      "Minnesota",
      "FULL",
      "GAME"
    ]
  },
  {
    "Id": 613,
    "source": "Google News",
    "region": "US",
    "title": "Canadian PM Carney Tries to Disarm Trump With Real Estate Talk Bloomberg.com",
    "summary": "Canadian PM Carney Tries to Disarm Trump With Real Estate Talk Bloomberg.com Trumps Oval Office meeting with Carney didnt reach Zelenskylevel tension. But it wasnt all neighborliness CNN Carneys ControlAltDelete Politico Trump Surprises Canada and Carney With New Message We Love You The New York Times Morning Report Carneys art of the Oval Office deal The Hill",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQQ0ZiRFNtaXRvbXA2ODU5WW81SEhyVG9OYVBON1ZOblM0Q3FFQXpGbklhVGdPMTZ4NGZpRVAxYU9DZ0xWcVpEN3lTWlFqbXJIdW1XYnpiYlA1cDM3WUl4MW5jT3BiOUVHMWdlclBUSnNrTFlRV2FFNkxTUlh6YVNYRU1ROGFLaHBIQ0ltT1Nfb0F3YzlSanhkQS1oaTJRTFlMRVdhWmdBNGdyWG1QS2hxYjByZGJHRWdkS2VITFNCVTNBZ1FNbmFtZmVB?oc=5",
    "published": "Tue, 06 May 2025 20:34:56 GMT",
    "sentiment": 0.8623,
    "importance": 0.667,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.322,
    "keywords": [
      "Disarm",
      "Real",
      "Estate",
      "Talk",
      "Bloomberg.com"
    ]
  },
  {
    "Id": 615,
    "source": "Google News",
    "region": "US",
    "title": "CNN Data Chief Reveals What Trump 'Actually Speaks To' With Alcatraz Plan Huff Post",
    "summary": "CNN Data Chief Reveals What Trump 'Actually Speaks To' With Alcatraz Plan Huff Post Alcatraz 2.0 Fmr. FBI agent floats 'perfect' new prison site that would scare even most hardened criminals Fox News One of Alcatrazs last living inmates speaks out on Trumps plan to reopen prison The Independent Trumps order to reopen Alcatraz is the perfect metaphor for his second term CNN Why San Francisco Hates the Idea of Turning Alcatraz Back Into a Prison WSJ",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMipgFBVV95cUxNMW1rdmtmZDBuVDQtUUF2eXNDSHhfSWJrdUdQeXUzYjUxSDhaX0VGbWhRMy0zcEk1d0lGOUtlcVI3M2lfUFhkazJHZ3lCd2xPTkZZNTViSzFWWkc5LWNCYnpoTXdIM2xaSXgycUp5SU1ETUctZUNvcC1EdHVrN3QxdEdPUTd5M3JaeHBOX1l3YzR2MVFnTmZYdlQ4NklOZnBrOVN2SXlB0gGrAUFVX3lxTE9FQlJWWjRMZHpKNGozV2hHWWt2XzlSUkFPeVJnUTBraGgwZks1dTRtcU1HQzBXSGMwRFgta3h3ckx5NG1sSFQ0TURxS1M0X2JmRC1oZXpLT1F6WlRYVGhPTGw3M1ZtUXU4WTM3WV9fYV9oMkl2OG5hb2cyZ0lvU0k5Ml96NW5IOUc0WVl4cHBtWHBZQ3J6UWVjSGUwVEpMODJYWDd3Ump6UFhUVQ?oc=5",
    "published": "Wed, 07 May 2025 02:04:45 GMT",
    "sentiment": -0.9458,
    "importance": 0.667,
    "relevance": 0.366,
    "authenticity": 0.6,
    "info_gain": 0.442,
    "keywords": [
      "Data",
      "Chief",
      "Reveals",
      "Huff",
      "Alcatraz"
    ]
  },
  {
    "Id": 616,
    "source": "Google News",
    "region": "US",
    "title": "Republicans search for a backup plan in crucial Georgia Senate race NBC News",
    "summary": "Republicans search for a backup plan in crucial Georgia Senate race NBC News GOP senators fear Marjorie Taylor Green could cost them Georgia Senate race The Hill Analysis Marjorie Taylor Greene for Senate? Why the GOP should be scared. The Washington Post Brian Kemp Wont Run for Senate in Georgia, Giving Ossoff a Lift The New York Times Kemps move scrambles GOP effort to oust Ossoff The Hill",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMitwFBVV95cUxPX3JpRE1NMjlBdUtueFdTRmdOVFJuc21hSUJXSVdEQ21mOFJ4U2J2TGxlZC1vMHVPWG1QMXkzdkgzT2dkTmRMUzEwQWRKMENDVFBuQW1jUDdDSXU5THFabERUMXREX3dYWWRYeWhyZDZ3N0pHem1hSFAyVVR0TTF2T2otbGtxWlJ4QS1kclBDem0zc09idlZ0ZGMxVU1OaHotazB5QVBUNVJCYU0tdGpEeWJmb3BrazjSAVZBVV95cUxQWjgxdWw2cTlCWFNoN2k5YnVJQWtHYUxvZm0tdmdaMHZpdmNBeGJjbWYzSXhvZ1hQaHQwVTU5Rk1saXFjWkkzRVM0ZXRTeUVUWVV5cS1XUQ?oc=5",
    "published": "Wed, 07 May 2025 09:00:00 GMT",
    "sentiment": -0.5719,
    "importance": 0.8,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.323,
    "keywords": [
      "NBC",
      "Senate",
      "Marjorie",
      "Taylor",
      "Georgia"
    ]
  },
  {
    "Id": 617,
    "source": "Google News",
    "region": "US",
    "title": "JD Vance's brother to run for Cincinnati mayor BBC",
    "summary": "JD Vance's brother to run for Cincinnati mayor BBCELECTION RESULTS Cincinnati mayor, Ohio Issue 2, school levies more WLWTJD Vances half brother advances in Cincinnati mayoral primary The Washington Post JD Vances Half Brother Advances in Race for Cincinnati Mayor The New York Times What the primary tells us about Hyde Park, JD Vance, and the November election Cincinnati Enquirer",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE9VMFRkZDhiQnVXYm82X2lVTGRFNEFRQ18wYmNrRmJ1YWdBQWd4WF9HZUtpbXFObXB3VnRrSkl3OEtEWkFXOGxURW1zQnFYeFNrcWxZSTBQQ2pMd9IBX0FVX3lxTE9GUmhxbzZjbzVyN0ZkN1lNVlVwenB1Ty1fa2FFVUF5MHhxLU41X3ZUb0ZHSk13YTdqWlJpcVV6cmxNblRBemc5VDZlLWRWNnhxWGNlS3cweUNBZS1neDVv?oc=5",
    "published": "Wed, 07 May 2025 03:03:06 GMT",
    "sentiment": 0.0,
    "importance": 0.667,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.309,
    "keywords": [
      "Cincinnati",
      "Vance",
      "brother",
      "Vances",
      "mayor"
    ]
  },
  {
    "Id": 619,
    "source": "Google News",
    "region": "US",
    "title": "Alligator near Florida lake attacks and kills woman in small boat, authorities say NBC News",
    "summary": "Alligator near Florida lake attacks and kills woman in small boat, authorities say NBC News Kayaker killed in alligator attack in Central Florida, officials say FOX Weather Alligator attacks, kills woman canoeing with her husband on lake in central Florida CBS News Woman killed in alligator attack on Lake Kissimmee in Polk County WESH Woman Killed in Alligator Attack While Kayaking in Florida Newsweek",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiowFBVV95cUxNb2Rxd0YzZGNaSFg5ZWFCZnM3S0lSVXBkSHVfRjRLZlpaTlhSWnViTTdCVHlnaFFSVGNiQlJsWGZPdTNDYUdyUXI1cDRTM3BSd3h2dXN4UGwxWTdmNDZ5YjB1NlU5MndxRzQ0SGsteWNscFRxOGl4dFVTSHBhek1EVFFDX2todlNIR1NyTkhiNkx3TmxoSzgwOVdtV19LSHR0OEc00gFWQVVfeXFMUEZUdGc4S1QyZ09QOTA0Vnk0NTZmdnBMZU94dXNDclM4eU5YSnVvSUVLNnV2ZWdEREFlTVVtU2FnVFVDNGZyUFdiVG1WLVRFZTZ3Q0o0NkE?oc=5",
    "published": "Wed, 07 May 2025 01:11:00 GMT",
    "sentiment": -0.9918,
    "importance": 0.667,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.27,
    "keywords": [
      "Alligator",
      "Florida",
      "woman",
      "lake",
      "killed"
    ]
  },
  {
    "Id": 620,
    "source": "YouTube",
    "region": "GB",
    "title": "Inter reach Final after EPIC battle Inter v Barcelona UEFA Champions League Highlights",
    "description": "In an absolutely EPIC encounter, it was Inter who came out on top to reach the 202425 UCL Final! SUBSCRIBE TO AMAZON PRIME VIDEO SPORT Follow Amazon Prime Video Sport on Tik Tok Follow Amazon Prime Video Sport on Instagram Follow Amazon Prime Video Sport on Twitter",
    "category": "Sports",
    "publishedAt": "2025-05-06T21:49:04Z",
    "channelTitle": "Amazon Prime Video Sport",
    "viewCount": "714929",
    "likeCount": "8154",
    "commentCount": "1231",
    "duration": "PT5M6S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.8236,
    "importance": 1.0,
    "relevance": 0.555,
    "authenticity": 0.333,
    "info_gain": 0.275,
    "keywords": [
      "PRIME",
      "VIDEO",
      "Inter",
      "Final",
      "EPIC"
    ]
  },
  {
    "Id": 622,
    "source": "YouTube",
    "region": "GB",
    "title": "I RETURNED MY WRECKED DB12 BACK TO ASTON MARTIN",
    "description": "Check if your car was damaged with Car Vertical 20 off here I bought a crash damaged Aston Martin DB12 which only had 39miles on the odometer. The car was pretty much brand new and we found out it was crashed on a PDI inspection before it got to the customer. We had to wait 6 months for parts and they have finally arrived but we still havent managed to get the car started. FOR A CHANCE TO WIN MY ASTON MARTIN VANTAGE Thanks to Bob at the Machine Shop Thanks to Keezy customs. Get your car wrapped FOR MORE CONTENT CHECK OUT MY SECOND CHANNEL ALL MA MERCHANDISE Follow Me Here Aswell",
    "category": "Autos & Vehicles",
    "publishedAt": "2025-05-05T17:00:29Z",
    "channelTitle": "Mat Armstrong",
    "viewCount": "2463547",
    "likeCount": "128561",
    "commentCount": "3503",
    "duration": "PT42M2S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.9513,
    "importance": 1.0,
    "relevance": 0.273,
    "authenticity": 0.333,
    "info_gain": 0.504,
    "keywords": [
      "car",
      "WRECKED",
      "BACK",
      "Vertical",
      "RETURNED"
    ]
  },
  {
    "Id": 624,
    "source": "YouTube",
    "region": "GB",
    "title": "We Finally Answered The MOST Important Question",
    "description": "Get the exclusive Nord VPN deal 4 months extra here It's riskfree with Nords 30day moneyback guarantee! ITS HERE! The Limited Edition Strange Matter Pin just dropped. Its glowing, limited, and probably not dangerous. Only available for 72 hours Sources further reading Can jellyfish power Tokyo? What would happen if it rained bananas for a day? We're taking two of your most absurd (and brilliant) questions and answer them with real science. OUR CHANNELS German Spanish French Portuguese Arabic Hindi Japanese Korean HOW CAN YOU SUPPORT US? This is how we make our living and it would be a pleasure if you support us! Get Products designed with Join the Patreon Bird Army DISCUSSIONS SOCIAL MEDIA Instagram Tik Tok Reddit Discord Twitter Bluesky Facebook Newsletter OUR VOICE The kurzgesagt voice is from Steve Taylor OUR MUSIC 700 minutes of kurzgesagt soundtracks by Epic Mountain Spotify Soundcloud Bandcamp Youtube Facebook The soundtrack of this video Sound Cloud Bandcamp If you want to help us caption this video, please send subtitles to subtitle.org You can find info on what subtitle files work on You Tube here Thank you! PATREON BIRD ARMY Many thanks to our wonderful Patreons (from who support us every month and made this video possible Nicolas Souilah, Jan, ihyx, Engbert Blaauw, Justin Ward Garza, Luke Schnipper, Ash Lee, Lubomir Hanulik, Dirty Talk Podcast, Danny Karapetian, C Hill, Penny Leigh Carlson, Michalina lemp, Rocky, Sonia Blair, Benjamin Ben David, William duck, Nick Elvis, Verteiron",
    "category": "Education",
    "publishedAt": "2025-05-06T14:00:01Z",
    "channelTitle": "Kurzgesagt – In a Nutshell",
    "viewCount": "1394777",
    "likeCount": "76705",
    "commentCount": "6587",
    "duration": "PT11M11S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.9811,
    "importance": 1.0,
    "relevance": 0.133,
    "authenticity": 0.333,
    "info_gain": 0.554,
    "keywords": [
      "Nord",
      "Nords",
      "Finally",
      "Answered",
      "Important"
    ]
  },
  {
    "Id": 627,
    "source": "YouTube",
    "region": "GB",
    "title": "Oblivion but this happens instead.",
    "description": "Thank you to Bethesda for sponsoring this video. Click the link to play The Elder Scrolls IV Oblivion Remastered today Featuring and Lily Yin. Animated by and myself! Music by More Animations Other Channels Joel Talks About Movies goodlongpee Support Patreon Paypal Merch Social Instagram Twitter Drawings Letterboxd",
    "category": "Film & Animation",
    "publishedAt": "2025-05-06T17:48:39Z",
    "channelTitle": "Joel Haver",
    "viewCount": "409322",
    "likeCount": "48503",
    "commentCount": "2101",
    "duration": "PT6M53S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.8805,
    "importance": 1.0,
    "relevance": 0.629,
    "authenticity": 0.333,
    "info_gain": 0.314,
    "keywords": [
      "Oblivion",
      "Yin",
      "Bethesda",
      "Letterboxd",
      "Elder"
    ]
  },
  {
    "Id": 628,
    "source": "YouTube",
    "region": "GB",
    "title": "Get Ready With Me feat. KATSEYE Glossier",
    "description": "Good morning, How do the six members of a global sensation get ready for their star filled days? We had to know. Manons Routine Mario Badescu Facial Spray Chanel WaterFresh Complexion Touch in B50 Glossier Brow Flick in Black Glossier Cloud Paint in Dawn Chanel Healthy Glow Bronzing Cream. in 395 Soleil Tan Deep Bronze Glossier Lip Line in Buff Glossier Ultralip in Trench Glossier Brow Flick in Brown Sophias Routine Glossier Futuredew Oil Serum Solid Chanel WaterFresh Complexion Touch in B30 Glossier Boy Brow Arch in Black Grey Glossier Cloud Paint in Wisp Glossier Lashslick in Black Glossier Generation G in Like Glossier Lip Gloss in Clear Danielas Routine Benefit Cosmetics Precisely, My Brow Pencil in 4.5 Hourglass Vanish Airbrush Concealer in Cotton Makeup by Mario Soft Pop Cream Blush Stick in Dusty Rose Tartelette in Bloom Clay Eyeshadow Palette in Smarty Pants Glossier No. 1 Pencil in Black Glossier You Eau du Parfum in Doux Rve Megans Routine Glossier Stretch Fluid Foundation in Very Light 4 Kosas Brow Pop in Soft Brown Glossier Stretch Concealer in Very Light 4 Glossier Cloud Paint in Beam Tag Muli Connor Stick in Nude Brown Glossier Shadow Stick in Stereo Glossier Lip Line in Buff Laras Routine Glossier Futuredew Glossier Stretch Fluid Foundation in Medium Tan 4 Glossier Stretch Concealer in Light 4 Glossier No. 1 Pencil in Frame ONESIZE Point Made Liquid Eyeliner in Black Vasanti Kajal Waterline Eyeliner in Black Glossier Lip Line in Nip Yoonchaes Routine Jungsaemool Foundation in Light Glossier Boy Brow Arch in Cool Dark Brown Glossier Cloud Paint in Puff Soar Glossier Lashslick in Black Kiss Me Smooth Liquid Eyeliner in Black Romnd Dewyful Water Tint in 11 Lilac Cream Subscribe to our channel and watch more videos like this About Glossier Glossier Inc. is a peoplepowered beauty ecosystem. We make intuitive, uncomplicated products designed to live with you. Get Ready With Me is an original Glossier series with a dialed backed approach to selfcare, giving a behindthescenes glimpse into our favorite friends reallife morning routines.",
    "category": "People & Blogs",
    "publishedAt": "2025-05-06T16:00:47Z",
    "channelTitle": "Glossier",
    "viewCount": "315526",
    "likeCount": "30337",
    "commentCount": "1174",
    "duration": "PT12M28S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.9901,
    "importance": 1.0,
    "relevance": 0.096,
    "authenticity": 0.333,
    "info_gain": 0.367,
    "keywords": [
      "Glossier",
      "Black",
      "Brow",
      "Routine",
      "Cloud"
    ]
  },
  {
    "Id": 630,
    "source": "Google News",
    "region": "GB",
    "title": "New pope will face complex moment in history, senior cardinal says, before conclave to select Pope Francis successor live The Guardian",
    "summary": "New pope will face complex moment in history, senior cardinal says, before conclave to select Pope Francis successor live The Guardian New pope taking over at 'difficult' time, says dean of cardinals as conclave set to begin BBC'Profound, mysterious' conclave to pick new pope begins Live updates USA Today Cardinal Re United in prayer before the Conclave, we ask the Holy Spirit for guidance Vatican News What to Expect From the Conclave, the Process of Electing a New Pope The New York Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMizwFBVV95cUxQaWRJQmJyS05vWlZIUG1fVldfNDlRdzdTRnoxbmJrdXFCd1RLOGk0UUQtLWU3NUxJaTY0TUlYeVZucWwteG51amVBY2hvVi1IY3ZIbmhsbXphaDFXWWZXNDlJbWVzSjRYOU0yMmtzMEJLMi1UNFJrYmZzVkN6NWdIMlFtNHVMSWNpVWFDUEVQeXJmaDVDRDAxWHR1Y3dKZlpFMlhQYy04dkN1aG1fX000R1p2TFBtR2x3OGJqNDh1UFM1UVBvUkt0RUsxUWt3eEU?oc=5",
    "published": "Wed, 07 May 2025 07:30:00 GMT",
    "sentiment": 0.743,
    "importance": 0.8,
    "relevance": 0.321,
    "authenticity": 0.6,
    "info_gain": 0.403,
    "keywords": [
      "pope",
      "conclave",
      "Francis",
      "Guardian",
      "live"
    ]
  },
  {
    "Id": 631,
    "source": "Google News",
    "region": "GB",
    "title": "Pakistan says Indian air strikes killed 26 and vows response, as Delhi says 10 killed by Pakistan shelling BBC",
    "summary": "Pakistan says Indian air strikes killed 26 and vows response, as Delhi says 10 killed by Pakistan shelling BBC IndiaPakistan live Islamabad vows revenge after 'dozens killed' in Indian missile strikes Sky News Operation Sindoor Army Videos Show Indian Strikes On Terror Camps In Pakistan NDTV IndiaPakistan live updates Pakistan vows retaliation after Indian airstrikes follow Kashmir attack NBC News Devastation among locals after India strikes Pakistan and Pakistanadministered Kashmir BBC",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE5tMjZkeDlOOEh6N0tsVkppZzAwU20zSzZ3cExOTmlobGR1MG4xUGtWblBqZnR6WXJqamFDenRyTGlQbmtOd0tkSmN4RFRfSGd2TG1Nbw?oc=5",
    "published": "Wed, 07 May 2025 03:20:15 GMT",
    "sentiment": -0.9935,
    "importance": 0.667,
    "relevance": 0.371,
    "authenticity": 0.6,
    "info_gain": 0.323,
    "keywords": [
      "Pakistan",
      "Indian",
      "BBC",
      "killed",
      "strikes"
    ]
  },
  {
    "Id": 635,
    "source": "Google News",
    "region": "GB",
    "title": "Two arrested after customer stabbed to death in Lloyds bank ITV News ITVX",
    "summary": "Two arrested after customer stabbed to death in Lloyds bank ITV News ITVX Customer stabbed to death inside Lloyds bank in Derby as two men arrested Sky News Bank customer stabbed to death inside Lloyds Bank branch in Derby The Guardian Derby bank stabbing Suspects being questioned after man dies BBC Derby restaurant owner named locally as victim in city centre stabbing Derbyshire Live",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNeENmaDhodEVFVWtVaUYyNnl0Z0l0QXJVQjlUMVMzdC11ZlFSM2wzSXBfV0hxakFVNGNKbTBUaVpSYnBsYkhPbVl1M0JxODdhZ1RSV090dXBJM0toS1B4aUJQNHQ2Q0l0REZLVlFTbTYtWS1VOGE5Z0NNTlBUM0g0OFBCYW40akUyVmp6WFNIRDR2U0xxdjV6QjVESWpjSlhpNm5IMkN5QkpMcmVO?oc=5",
    "published": "Tue, 06 May 2025 19:54:03 GMT",
    "sentiment": -0.9908,
    "importance": 0.667,
    "relevance": 0.433,
    "authenticity": 0.6,
    "info_gain": 0.263,
    "keywords": [
      "Lloyds",
      "bank",
      "stabbed",
      "Derby",
      "customer"
    ]
  },
  {
    "Id": 650,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan Zindabad, always Celebrities condemn cowardly India after attack on Pakistan Comment Images Dawn",
    "summary": "Pakistan Zindabad, always Celebrities condemn cowardly India after attack on Pakistan Comment Images Dawn IndiaPakistan live updates Pakistan vows retaliation after Indian airstrikes follow Kashmir attack NBC NewsHigh risks Indian attacks in Pakistan raise fears of wider conflict Al Jazeera Ground report from the site of air strikes in Pakistan's Muridke BBC Global community reacts to Indian strikes in Pakistan Dawn",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiugFBVV95cUxPeU9kbUZQeGpROFQyeDNhb2tyS05PTDVMMDY5S1BRZFFucXRfa2xSVmxCMU5rMzZiOTRzSnVDal9iS05JR1F2VDFVOHNlNW1oaTNCclJra2VOSElyNWlMbnhwdkFmbDBEQ2VqcWhNSmF1ZmxENXoteVZjRnJiQXhJQUVmQlJBODBoZi1tUkFWdUYzQ2RUdDktX1N6S0NqcW1kWmE0SE5BNVRpUy02SnhWYVo5UFZtS1RHRWc?oc=5",
    "published": "Wed, 07 May 2025 07:55:36 GMT",
    "sentiment": -0.9846,
    "importance": 0.8,
    "relevance": 0.445,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "Pakistan",
      "Dawn",
      "Zindabad",
      "Indian",
      "Celebrities"
    ]
  },
  {
    "Id": 651,
    "source": "Google News",
    "region": "PK",
    "title": "India conceded 'defeat' at Lo C by raising white flags Tarar The Express Tribune",
    "summary": "India conceded 'defeat' at Lo C by raising white flags Tarar The Express Tribune Six killed, over 30 injured in Pak shelling; Indian Army responding in equal measure Officials The Hindu Seven dead, 38 injured as Pakistan Army targets civilian areas along Lo C in Jamp;K Times of India Indian Army inflicts casualties on Pakistani forces in retaliation to ceasefire violations Defence source The Economic Times Lo C hots up after Op Sindoor strikes, 10 Indians killed; evacuations ordered India Today",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxQQzdUOW9fN2NMWnI2MTN0eWphU2Q2MTEzR2lybUpYckN0eWF0NDYwazdjbjJuRF9qOVFGNGtsWlpuVVl6U0ZER2dpRTk4RzQ0VHdXYlY1X0tuNVJ5anNoWHNyeWZMQXFTNUk0eGtNNEhSb29XaG0xeGZfaVU0SjVwWEZRbUpKcVpWN3oxaU43ZGdBOFdIUFltbDJn0gGiAUFVX3lxTE9DdVEwNXp3LTJuYTNlQW5YaGxyajYtZkw0cUJ3X0hxWUhJRkFtNXlGVGhEbnJKbEpCRGl1TmlqbElyZHh0TnMtVW1NSkpyVG8tejgxcTZJV1FHNWRJMnM5d0NyMHJGNHRhbk9aeVJOc0Y0ajRuYXBJX0JfanJycnhzaldyb3ZqSnp2d2hIU2d3N1otOUszMk41NGhSLVlMYVNZQQ?oc=5",
    "published": "Wed, 07 May 2025 08:30:44 GMT",
    "sentiment": -0.9756,
    "importance": 0.8,
    "relevance": 0.351,
    "authenticity": 0.6,
    "info_gain": 0.429,
    "keywords": [
      "defeat",
      "India",
      "Army",
      "Tarar",
      "Express"
    ]
  },
  {
    "Id": 652,
    "source": "Google News",
    "region": "PK",
    "title": "India and Pakistan Strikes Risk Escalation After Kashmir Attack Bloomberg.com",
    "summary": "India and Pakistan Strikes Risk Escalation After Kashmir Attack Bloomberg.com View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQMDR3MWlmeWd5MDBGYTlXVHF0Z2FqVlNZeGdMR0dGRUxod0dkVkp6M3MtWUxzdTNPRDZEV2ZhV3N4cW5pWFdubjV0TlQ2aFZnamhoaWQ2MFFVMTF6aG1YczB0Q0NtMnZXTEc1ZWc4TmpDNThtZC1IQ3ZsYjRQVVFvRHRrWHVDa05pdmRNcTVwRE44RXlmY1lra3VuLTRWSGc5dXJmYnU4emlOYUZaQXhvZnNyWVVLc2Z3Rm1OU1pqcXM0UQ?oc=5",
    "published": "Wed, 07 May 2025 09:45:59 GMT",
    "sentiment": -0.9246,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.109,
    "keywords": [
      "Pakistan",
      "Strikes",
      "Risk",
      "Escalation",
      "Kashmir"
    ]
  },
  {
    "Id": 653,
    "source": "Google News",
    "region": "PK",
    "title": "PIA partially resumes flight operation after IndiaPakistan tensions ARY News",
    "summary": "PIA partially resumes flight operation after IndiaPakistan tensions ARY News Flight Operations Resume at All Major Pakistani Airports After Suspension Amid Retaliatory Strikes Pakistan Today Pakistan airspace closed for 48 hours; Islamabad Airport shut down SamaaNews Lahore and Karachi airspace reopened after 48hour suspension Daily Times Islamabad Airport Temporarily Shuts Runway During LateNight High Alert The Media Line",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxQTWdCc2dKMEVMTTFBNlViQzd3RFFKbF85WHhsamdvNXZTMkN3RVowWmZtX1RHY1hmaGZRVzRqVjY4ZEhTUUFaSHJYX0pZWGhhbEsxaGZwWjNFZk9yT3BwNGRMWllQS2JpVGd3c2lucXlBRHJqNHpwN3BjVnhTSnhWSnc0eUZyOWRLX0RYcE1WRHRGUdIBlwFBVV95cUxPUS1aSm9TS1BoNGRsX213UmpJVkd0UXBaTXlfaXczUV9LT2RiWWtSOE8yZ05xTDhpT3haTUFwdzV0UkhGLVBBYVhhLXRWVTh6UUtkcWRtYzA4TERNV0IwdWRQYm51VzQ5MEstRTRnQkR2Sk9kenZXSTFVOXE1aS1oXzBmcEhtSEhxOHU2R2JBSGZEb0RWZ3Rz?oc=5",
    "published": "Wed, 07 May 2025 06:43:17 GMT",
    "sentiment": -0.6908,
    "importance": 0.8,
    "relevance": 0.49,
    "authenticity": 0.6,
    "info_gain": 0.348,
    "keywords": [
      "ARY",
      "flight",
      "PIA",
      "Islamabad",
      "Airport"
    ]
  },
  {
    "Id": 654,
    "source": "Google News",
    "region": "PK",
    "title": "UK says it stands ready to support India and Pakistan to move towards dialogue and deescalation The Hindu",
    "summary": "UK says it stands ready to support India and Pakistan to move towards dialogue and deescalation The Hindu Security Alert U.S. Mission to Pakistan (May 07, 2025) U.S. Embassy Consulates in Pakistan (.gov)Trump admin's latest warning 'Reconsider travel to Pakistan because...' Hindustan Times UK Foreign Office issues travel warning for India and Pakistan as Heathrow flights are delayed inkl Canada, UK Issue Travel Advisories For India Amid Escalating Tensions with Pakistan BW Businessworld",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi8gFBVV95cUxPcVlCNVNCMWpuYUxoN0JHMTRpYjFCNTFKam9xTDF5YUgzTjk1UHlBOGlRdkRMbG5IbUZWX3A0NXE1dEZldEtvY25TcTYyTmlMR2g2OTBiRlJ0eXVUU29Td0NUVWpNOVFTZG9oQ2ZjQXE5WEF0MW8teVFzT3MweTlndk5ZUXJoamd1ZFFtVkNZUnV4UDJGWEF2bDhXOWdYV0g5V1hRa3FYV21QemVTa3psMUpETXFXRE10bldqcUpqXzlDNGtIdmRxaDI3aGdiRENhbkRWeVdudTVHN3YxVzBITXhwelhEM1hSQlRibXFpU242Z9IB-AFBVV95cUxOZy10Z2hGOVdTcWxXSl9JMVBHaXBlcXNidVE3dk9jVkhSdEMtUXg2ZThMWlJGeXdfaXp2RVc1blZRZVBGN2hyUUdXTVNja0p4X2JJZmFYMm9DQm1UOHdmaS0yV3pQQ0Y3akFXVF9KRkJRT21lazg1NUY3Si1DOTV6SUpQVlNNcXl2cUY1LXRWT3ZMcTBadXBCVjd3b1lSTEVBZkhBa3htU2lfRkhicnZfX1FoX1R3ZGl6dGdoQXUtUm1oMHhzMVdBUkVVaUpHeGxVSnVOcjFGXzVTWFA1MlUxYW5LMFhnX0x2a0xGV0c5dlE2aXMwZDVsWg?oc=5",
    "published": "Wed, 07 May 2025 09:51:00 GMT",
    "sentiment": 0.6808,
    "importance": 0.8,
    "relevance": 0.366,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "Pakistan",
      "India",
      "Hindu",
      "stands",
      "ready"
    ]
  },
  {
    "Id": 655,
    "source": "Google News",
    "region": "PK",
    "title": "UN asked to end its silence on Kashmir dispute Dawn",
    "summary": "UN asked to end its silence on Kashmir dispute Dawn View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPbnhFQW5RLU1OR3p2MFF1dEw5Z0IzVDYzcXBVZVFCZmNlTmI1QjBzTExBdlFFRWVxbl90Nkk1VFlQVmZWdWxLUllxUmVMcHZTWkNIOEtnTjAtWWpsUGs2bmphQ0RjN3JMY09pSjlsQnFwRUNpSHlXOHhHLWxWS0J1djl0TTRZVTQ?oc=5",
    "published": "Wed, 07 May 2025 00:37:27 GMT",
    "sentiment": -0.6597,
    "importance": 0.667,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.096,
    "keywords": [
      "Kashmir",
      "Dawn",
      "asked",
      "end",
      "silence"
    ]
  },
  {
    "Id": 656,
    "source": "Google News",
    "region": "PK",
    "title": "Sindh home department issues high alert after Indian strikes ARY News",
    "summary": "Sindh home department issues high alert after Indian strikes ARY News Sindh on high alert amid escalating border tensions nation.com.pk Indias cowardly actions expose true face of fascist govt President Zardari The Express Tribune Indias cowardly attack sparks emergency across Pakistan hospitals on high alert Daily Times Ali Amin Gandapur extends full cooperation to federal govt, armed forces Dunya News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxQMXlYV25uQ0RNRXd6VnlRVF9mdVBYemxiaGJJazZVdVZOTXRLTVZOdHZHQkRTRUhkd3B4c1RLVDBHRmVOWjdEeTloQ0RoV2dkZnVRd3YyMGlrNDdISndzZFl3bnBzaVZqQXludzdPOW5KQ2w3Yko1UXBfTmVLU3RIQUtyQVVCc2M?oc=5",
    "published": "Wed, 07 May 2025 08:27:12 GMT",
    "sentiment": -0.8934,
    "importance": 0.8,
    "relevance": 0.469,
    "authenticity": 0.6,
    "info_gain": 0.342,
    "keywords": [
      "high",
      "Sindh",
      "Indian",
      "ARY",
      "alert"
    ]
  },
  {
    "Id": 658,
    "source": "Google News",
    "region": "PK",
    "title": "'Canada largest client of US' Mark Carney factchecks Donald Trump in first meeting at White House Times of India",
    "summary": "'Canada largest client of US' Mark Carney factchecks Donald Trump in first meeting at White House Times of India'A transformational president' how Carney flattered Trump to defuse 51st state row BBC Trump says we just want to be friends as Canada PM torpedoes 51st state idea Trump administration The Guardian Trumps Oval Office meeting with Carney didnt reach Zelenskylevel tension. But it wasnt all neighborliness CNN Trump, Carney faceoff in Oval Office leaves gaping differences on tariffs, 51st state AP News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi-wFBVV95cUxNWEl1TElORFQybmNCMWZBQXk3TG5vckFXSjZJb3BIX2gxaHJTcVFMQjBnZGNGeVQxVUJvVlBoeE1XVmY5clBOWk1lTTZNeDBRUGNmUE9qWWh1RDI2ak1raUk5LVJRN0RIMDZxZThheGZIZmh1bGR1emE1cTcyUUUzXzV4RmNFVjlhMHUyQmhra0pYNVZEcFpFWGFBOEQ2STZ0YTlXQ1FwVHdfdWxvQ2xKaldFN2R1X1RzZWdaZ3ZYYmpWVk01NnZGdHJ6NFJ1a3pxZElEbzh2bjRnUFVXRlZ4dmpCQXJGR0VFRVUwdTU5Zk9oUGQwNXBveFVsSdIBgAJBVV95cUxOZ0hpYlVPbDk1WWRYeFpMYnpORkVMVTJTTW9tdV9NME9meTFUNUNmTWY5R3dJVmFkdlBJX3A0YVZiOGVaT3FPakQxU3dTVnZ1RlVCandhUS1POVJJbHROTnJXRXVaUjFSZ3pmdzNyQXpsSnJuV2pkYWhNNzZPWEpSNkdhYnVwMGdIWGllOXZVS0dWSVNSZmFhbGxsbXlTaS1sQlEzeTFLQjNoaEsyUjdiUlRCeVc2RVNENmhRVG5uUFJYVk9zZmgwbm5DNjZua1dsUXpGcUdmSW9HY0lCQl9KME9aaXJsMjZDQWQ4bUNEMnpYM0lHZGlBYWFnYXYxS3Zw?oc=5",
    "published": "Wed, 07 May 2025 08:19:00 GMT",
    "sentiment": 0.5337,
    "importance": 0.8,
    "relevance": 0.333,
    "authenticity": 0.6,
    "info_gain": 0.418,
    "keywords": [
      "Canada",
      "Mark",
      "Trump",
      "Carney",
      "Donald"
    ]
  }
]