[
  {
    "Id": 0,
    "source": "YouTube",
    "region": "US",
    "title": "Young Boy Never Broke Again Where I Been Shot Callin Official Video",
    "description": "Young Boy Never Broke Again New Music Directed by Top Connect with Young Boy Never Broke Again The official You Tube channel of Young Boy Never Broke Again. Subscribe for the latest music videos, performances, and more.",
    "category": "Music",
    "publishedAt": "2025-05-03T00:42:17Z",
    "channelTitle": "YoungBoy Never Broke Again",
    "viewCount": "1011528",
    "likeCount": "144409",
    "commentCount": "18421",
    "duration": "PT7M28S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.2545454545454545,
    "importance": 1.0,
    "relevance": 0.68,
    "authenticity": 0.333,
    "info_gain": 0.222,
    "keywords": [
      "boy",
      "broke",
      "young",
      "music",
      "official"
    ]
  },
  {
    "Id": 1,
    "source": "YouTube",
    "region": "US",
    "title": "RYAN GARCIA VS ROLANDO ROMERO FIGHT HIGHLIGHTS",
    "description": "Watch Buy fight now on DAZN dazn.comyoutube May 3 Powered by City of Wolves Subscribe to our You Tube channel Subscribe to the DAZN X Series You Tube channel Sign up to DAZN now Follow DAZN Boxing On Social Media Twitter Instagram Facebook The DAZN Boxing Show DAZN Rewind",
    "category": "Sports",
    "publishedAt": "2025-05-03T02:41:31Z",
    "channelTitle": "DAZN Boxing",
    "viewCount": "930861",
    "likeCount": "12959",
    "commentCount": "3021",
    "duration": "PT3M30S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.03333333333333333,
    "importance": 1.0,
    "relevance": 0.595,
    "authenticity": 0.333,
    "info_gain": 0.288,
    "keywords": [
      "dazn",
      "boxing",
      "channel",
      "fight",
      "subscribe"
    ]
  },
  {
    "Id": 2,
    "source": "YouTube",
    "region": "US",
    "title": "DDG what i prefer (Official Music Video)",
    "description": "DDG what i prefer (Official Music Video) \"blame the chat\" available at Follow DDG (C) 2025 DDG Entertainment Inc., under exclusive license to Epic Records, a division of Sony Music Entertainment.",
    "category": "Music",
    "publishedAt": "2025-05-02T04:00:06Z",
    "channelTitle": "DDGVEVO",
    "viewCount": "774781",
    "likeCount": "73020",
    "commentCount": "7756",
    "duration": "PT2M9S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.25,
    "importance": 1.0,
    "relevance": 0.877,
    "authenticity": 0.333,
    "info_gain": 0.175,
    "keywords": [
      "ddg",
      "music",
      "entertainment",
      "official",
      "prefer"
    ]
  },
  {
    "Id": 3,
    "source": "YouTube",
    "region": "US",
    "title": "I was almost in Squid Game.",
    "description": "i was just too good at squid game Friends my brother The Team Adam X Brooskee Ciara Checkers Corin Colleen Claudia David Baron Art Dee Helm Denny Devon Dxmnduke Eman Fawnlouette Flippmeister JRF Kam Leslie V Pink Papi Rocket Sockit Tiffany Seng Vijaylante Willard Yin Zangeiti SUBSCRIBE for more animations! MERCH TWITTER INSTAGRAM Wanna Send Fanart? You can send it to me through Twitter or Instagram (links above) Music nintendo music my beloved",
    "category": "Film & Animation",
    "publishedAt": "2025-05-02T17:02:27Z",
    "channelTitle": "JaidenAnimations",
    "viewCount": "2594065",
    "likeCount": "211174",
    "commentCount": "7650",
    "duration": "PT14M28S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.16071428571428573,
    "importance": 1.0,
    "relevance": 0.422,
    "authenticity": 0.333,
    "info_gain": 0.507,
    "keywords": [
      "game",
      "instagram",
      "music",
      "send",
      "squid"
    ]
  },
  {
    "Id": 4,
    "source": "YouTube",
    "region": "US",
    "title": "Why is Everything So Boring Now?",
    "description": "NEW US DATES ON SALE NOW in this video i complain about how everything is boring and sad ok that's it enjoy MERCH FOLLOW ME WATCH MY PODCAST LISTEN TO MY PODCAST thumbnail by comment who up praying over this video if ur reading this thanks for watching! 000 US tour promo 036 introduction 342 the loss of colour 646 phones early tech 1050 the coolest design trend of all time 1343 the internet 1737 movies tv 2203 architecture 2528 retail stores 2654 why is this happening? 2936 sad beige its consequences 3500 what do we do?",
    "category": "Comedy",
    "publishedAt": "2025-05-02T19:13:08Z",
    "channelTitle": "Kurtis Conner",
    "viewCount": "981791",
    "likeCount": "83219",
    "commentCount": "7105",
    "duration": "PT38M11S",
    "definition": "hd",
    "language": "en",
    "sentiment": -0.1792929292929293,
    "importance": 1.0,
    "relevance": 0.323,
    "authenticity": 0.333,
    "info_gain": 0.571,
    "keywords": [
      "boring",
      "podcast",
      "sad",
      "video",
      "000"
    ]
  },
  {
    "Id": 5,
    "source": "YouTube",
    "region": "US",
    "title": "Fortnite SEASON 3 is HERE! (Star Wars)",
    "description": "Fortnite Star Wars First Win Chapter 6 Season 3 gameplay with Typical Gamer! SUBSCRIBE CLICK THE BELL! SUBSCRIBE to the NEW CHANNEL! MY GAMES in FORTNITE! PLAY THE PIT OF LEGENDS 562912474118 (Or Search JOGO) PLAY SUPER RED vs BLUE 278621148349 PLAY SUPER RED vs BLUE ZERO BUILD 203743147548 PLAY TMNT SUPER RED vs BLUE 149865886678 PLAY ONLYUP TIME TRAVEL 526417619807 PLAY TOY BED WARS 547145508290 PLAY FORTNUT GUN GAME 850050913965 PLAY RANKED BOX PVP 517888559263 Make sure to FAVORITE and LIKE the maps if you enjoy them! Use my Support a Creator code \"Typical Gamer\" in the Fortnite item shop if you'd like to support me! (Epic Partner) Join my Discord Buy my Merch Follow me on Twitter Follow me on Instagram Music by Epidemic Sound",
    "category": "Gaming",
    "publishedAt": "2025-05-02T13:38:09Z",
    "channelTitle": "TG Plays",
    "viewCount": "767649",
    "likeCount": "11906",
    "commentCount": "860",
    "duration": "PT16M41S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.16971590909090908,
    "importance": 1.0,
    "relevance": 0.249,
    "authenticity": 0.333,
    "info_gain": 0.481,
    "keywords": [
      "play",
      "fortnite",
      "blue",
      "red",
      "super"
    ]
  },
  {
    "Id": 6,
    "source": "YouTube",
    "region": "US",
    "title": "Ivan Cornejo Me Promet (Lyric Video)",
    "description": "Escucha Me Promet en todas las plataformas Sigue a Ivan Tik Tok Instagram Facebook Lyrics Me promet Para ti soy nada Nunca es suficiente para ti Me promet Sultala, no es pa' ti Aunque pierdas esta guerra Djala ir Vete al espejo Y dime, ests feliz? Tienes que despertar Tienes que aceptar la verdad No te tapes los ojos No te quieras escapar No le llames de nuevo Cuando segn queras cambiar Me promet que nunca Iba a hablar ms de ti Que te iba a olvidar (Que te iba a olvidar) Me promet que esta vez, esta vez Segn iba a cambiar Arde tanto Escuchar tu voz Era dulce Hasta que minti Quisiera ser ms consciente Cumplir lo que es no quererte Me tengo que ir Me tengo que ir Irme una vez ms Y esta vez de verdad Ya no mirar hacia atrs Irme una vez ms Y ms nunca voltear Ya necesito sanar Me promet que nunca Iba a hablar ms de ti Que te iba a olvidar (Que te iba a olvidar) Me promet que esta vez, esta vez Segn iba a cambiar Sultala, no es pa' ti...",
    "category": "Music",
    "publishedAt": "2025-05-02T00:00:06Z",
    "channelTitle": "Ivan Cornejo",
    "viewCount": "810188",
    "likeCount": "80626",
    "commentCount": "5793",
    "duration": "PT2M52S",
    "definition": "hd",
    "language": "es",
    "translated": "Ivan Cornejo Me Promet (Lyric Video) Listen to me on all the platforms follow Ivan Tik Tok Instagram Facebook Lyrics I promise me for you, I am never enough for you to promise me, it is not for you even if you lose this war to go go to the mirror and tell me, are you happy?You have to wake up you have to accept the truth you do not cover your eyes you do not want to escape, do not call him again when they according to changing me that I was never going to talk about you that I was going to forget you (that I was going to forget you) I promise that this time, this time according to I was going to change so much to listen to your voice was sweet until I would like to be more awareI am not looking to go to go to go once more and more never turned to heal I promised that I was never going to talk about you that I was going to forget you (that I was going to forget you) I promise me that this time, this time according to I was going to change SULTALA, it is not pa 'ti ...",
    "sentiment": 0.25,
    "importance": 1.0,
    "relevance": 0.169,
    "authenticity": 0.333,
    "info_gain": 0.328,
    "keywords": [
      "que",
      "iba",
      "promet",
      "vez",
      "esta"
    ]
  },
  {
    "Id": 7,
    "source": "YouTube",
    "region": "US",
    "title": "Athletic Club vs. Man. United Extended Highlights UEL Semifinal Leg 1 CBS Sports Golazo",
    "description": "Man. United took a thriller in the quarterfinal and now hope to secure a spot in the Europa League final against Athletic Club. Stream every UEFA Champions League match live on Paramount Watch all the extended highlights from the UEFA Champions League HERE Watch the epic UCL punditry from Thierry Henry, Micah Richards, and Jamie Carragher HERE Follow us across our social media! TWITTER FACEBOOK INSTAGRAM TIK TOK Subscribe to our other CBS Sports Golazo channels! CBS SPORT GOLAZO EUROPE ATTACKING THIRD CBS Sports Golazo Asia Home of Serie A, NWSL, Concacaf Men's and Women's Nations League and World Cup Qualifiers, Argentinas Liga Profesional de Ftbol, Brazils Campeonato Brasileiro Srie A and UEFA mens club competitions including the Europa League, Europa Conference League and... THE CHAAAMPIONSSS",
    "category": "Sports",
    "publishedAt": "2025-05-01T21:27:36Z",
    "channelTitle": "CBS Sports Golazo - Europe",
    "viewCount": "685952",
    "likeCount": "7883",
    "commentCount": "2438",
    "duration": "PT11M21S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.07454004329004328,
    "importance": 1.0,
    "relevance": 0.238,
    "authenticity": 0.333,
    "info_gain": 0.475,
    "keywords": [
      "league",
      "cbs",
      "golazo",
      "club",
      "europa"
    ]
  },
  {
    "Id": 8,
    "source": "YouTube",
    "region": "US",
    "title": "planes if they were 10,000 times better",
    "description": "Get Nord VPNs 2 year plan 4 extra months free here ( Its risk free with Nord VPNs 30 day money back guarantee! What if planes were 10 thousand times better than they are now? I have the answer for you. A question you never asked but great minds like me know you wanna know. obviously. I hope you like this cool and awesome video made by me (whomst is also cool and awesome) Thank you for watching!!! TEAM Produced in collaboration with Jellybox! Gene Goldstein Executive Producer bluesky and instagram Laura Estrella Director bluesky and instagram Sean Aitchison Production bluesky Jane Mahoney Production bluesky and instagram Brooke Burnett Animator bluesky .bsky.social David KalevRoy Animator bluesky .com instagram Cris Mestre Animator bluesky and instagram Willard the Worm Animator instagram Mazzy Foy Animator bluesky and instagram Danny Reyes Animator bluesky and instagram Harry Barnett Animator bluesky .bsky.social instagram Joel Spencer Animator bluesky .bsky.social instagram Tanimayto Animator bluesky .com instagram and me! a whole bunch of stuff twitter instagram",
    "category": "Comedy",
    "publishedAt": "2025-05-03T02:01:54Z",
    "channelTitle": "Ice Cream Sandwich",
    "viewCount": "393569",
    "likeCount": "49232",
    "commentCount": "2894",
    "duration": "PT9M49S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.4230769230769231,
    "importance": 1.0,
    "relevance": 0.191,
    "authenticity": 0.333,
    "info_gain": 0.408,
    "keywords": [
      "bluesky",
      "instagram",
      "animator",
      "bsky",
      "social"
    ]
  },
  {
    "Id": 9,
    "source": "YouTube",
    "region": "US",
    "title": "Kelly Clarkson Where Have You Been (Official Music Video)",
    "description": "Where have you been What took so long I thought Id found you Found out I was wrong I almost gave up My light was so dim And now here you are Where have you been Stream \"Where Have You Been\" on Spotify Stream \"Where Have You Been\" on Apple Music Stream \"Where Have You Been\" on Amazon Music Subscribe for more content from Kelly Clarkson Follow Kelly Clarkson",
    "category": "Music",
    "publishedAt": "2025-05-02T23:00:37Z",
    "channelTitle": "Kelly Clarkson",
    "viewCount": "239325",
    "likeCount": "18953",
    "commentCount": "1526",
    "duration": "PT4M5S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.09,
    "importance": 1.0,
    "relevance": 0.427,
    "authenticity": 0.333,
    "info_gain": 0.296,
    "keywords": [
      "clarkson",
      "kelly",
      "music",
      "stream",
      "amazon"
    ]
  },
  {
    "Id": 10,
    "source": "Google News",
    "region": "US",
    "title": "Trump's social media post targeting Harvard's taxexempt status could create problems for the IRS NBC News",
    "summary": "Trump's social media post targeting Harvard's taxexempt status could create problems for the IRS NBC News Harvards President Alan Garber Talks About His Legal Fight With Trump The New York Times Harvards Brawl With Trump Casts Doubt on Its Pristine Credit WSJ Harvard professor reveals university was 'not ready' after Oct 7 as Trump revokes taxexempt status Fox News Trump says the government will revoke Harvards taxexempt status. The universitys president says that would be illegal CNN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxPR2pSM0hKS1g5LXVoc1RWeXBaTXlsWVJTVDB4U2VTY01DWXpzUzNXRnVOSDlrSlI2Si1VUGFrY3dlRW82WGVCZ1dzNUN0ZWZveUppVzhVdm9JeU1vc04zMmRWRUFQU2w0M3lUV00tSWFzYWJIb3RIcnFFU09kSXJQSEZrc256OERYSXhZX2MtMF9BOGRzbV9SVkZiMUNBbVhDTjFzd2Fjb1JlWUYwalJFZzlYNWpiLVFuekNnYUN2MDZrTFdzd3drd3BJWVdfUmFm?oc=5",
    "published": "Sat, 03 May 2025 11:00:00 GMT",
    "sentiment": -0.03282828282828284,
    "importance": 0.8,
    "relevance": 0.359,
    "authenticity": 0.6,
    "info_gain": 0.409,
    "keywords": [
      "trump",
      "status",
      "taxexempt",
      "harvard",
      "harvards"
    ]
  },
  {
    "Id": 11,
    "source": "Google News",
    "region": "US",
    "title": "Australias centerleft Labor Party retains power as conservative leader loses seat, networks report CNN",
    "summary": "Australias centerleft Labor Party retains power as conservative leader loses seat, networks report CNN Albanese set to remain Australian prime minister as Labor wins election politico.eu Australias Prime Minister Clinches Second Term The New York Times Live Results Australia federal election 2025 BBC Australian federal election 2025 live Labor wins election in crushing victory; Anthony Albanese acknowledges traditional owners; Peter Dutton concedes after losing own seat in Dickson electorate latest updates The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOaWNDdkxDekZJSWxxMzJUOHhKbm1PX3JEcUxsUmpQcld0UXNzNHh2SFhIc1d1VVJxMUdPbzZrcHpEWG9xR3FIVHpYR21Ka3dnNS05VE9vSGcyNi1UTDlxcHJkSjlvQ3gwdmppUFF0ajlqdEk1QmN2am1BcDJXMlRIaTlhR1pBSjNocGllS29QQnU2d252d2Vj0gGcAUFVX3lxTFBoZ1haS3NaSDhPLTdSRHd2LXpITEFPdEdjdk1WYWFHM0FFNy1SS2x0VjdQYUZZa1NVU21KcG1TOVJXeU83WHJvcU84UmI3OEg0NUFOQmRtaUZZelZzeTRVV3JuSlFRNFpjMzNMQ1NqWm12X3FrYUR0d2NqRmQyVjRuazEtWDB4ZWU3cy05LTJGU0VfOF85clJ6VjdqTg?oc=5",
    "published": "Sat, 03 May 2025 10:29:00 GMT",
    "sentiment": 0.13636363636363638,
    "importance": 0.8,
    "relevance": 0.383,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "election",
      "labor",
      "australias",
      "seat",
      "2025"
    ]
  },
  {
    "Id": 12,
    "source": "Google News",
    "region": "US",
    "title": "Judge strikes down Trump order punishing law firm Perkins Coie The Washington Post",
    "summary": "Judge strikes down Trump order punishing law firm Perkins Coie The Washington Post Judge permanently blocks unconstitutional Trump order targeting law firm Perkins Coie CNN Trump order targeting law firm Perkins Coie is unconstitutional, judge rules The Guardian White House budget calls for less domestic spending, more military funding NBC News Judge snaps at DOJ lawyer arguing Trump executive order targeting Big Law firm can't be illegal Business Insider",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxORTl5NU5pTngtcEVyc1p3NDNYUVNZZ3FrM0RKXzNRVm1wSUdYV2JmdGJHT0dBTzRzQXRHQWpoLWk2dTBoU1FXX0VDYnozUVdRTWdTRkxISXF5RkZGNG5NcXo2NmNMRUVxUUJ1eUpwSVRYRWlhTHViZnZ6c09LYWFtbUthWTBfeXhkZ2Z3c3N1MHZudw?oc=5",
    "published": "Sat, 03 May 2025 04:28:00 GMT",
    "sentiment": -0.11269841269841271,
    "importance": 0.667,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.323,
    "keywords": [
      "firm",
      "judge",
      "law",
      "order",
      "trump"
    ]
  },
  {
    "Id": 13,
    "source": "Google News",
    "region": "US",
    "title": "Waltzs Use of Messaging Platform Raises New Security Questions The New York Times",
    "summary": "Waltzs Use of Messaging Platform Raises New Security Questions The New York Times Waltz angered Trump over conversations with Israel The Washington Post Waltz ouster adds to tumult in Trump's national security team but consolidates power in fewer hands AP News How Marco Rubio defied expectations and rose to the top of Trumps orbit Politico5 things to know for May 2 May Day protests, PBSNPR funding, Alien Enemies Act, Mike Waltz, Gaza CNN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOSjFfOGtYV3BsaTduT2ExQ2syTEpGNk1GT3EwaERpVGNhNkM1UVZ0ZVlmR19ad3c0NlRkaHZOZFNJd21UVUJJMVRqcUNadnhtNG55dVlwa0U4UEY3Z09hMUNFeDNiWlNiTTF2b2pZajNWeU9TM2JOR2JRanFPWFFuaA?oc=5",
    "published": "Sat, 03 May 2025 07:26:00 GMT",
    "sentiment": 0.08068181818181817,
    "importance": 0.8,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.422,
    "keywords": [
      "new",
      "security",
      "waltz",
      "messaging",
      "platform"
    ]
  },
  {
    "Id": 14,
    "source": "Google News",
    "region": "US",
    "title": "Trumps budget is here; GOP defense hawks arent happy The Hill",
    "summary": "Trumps budget is here; GOP defense hawks arent happy The Hill Trump budget proposes 1 trillion for defense, slashes education, foreign aid, environment, health and public assistance CNN The Deep Budget Cuts Trump Seeks as His Second Term Takes Shape Bloomberg.com Trump Proposes 163 Billion in Cuts Across Government in New Budget The New York Times Trump news at a glance president floats Pentagon budget boost; army may hold parade for his birthday The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPMkxIa1JjbWlLdFZLSmlINFNPOTlsb2VfcHhhcE1oMkl2eXk4MFlmOGxHUzVEdUtPOEUzTnpzN294WW5Za2NTZ014ZFYyNlV6d1FSYXRXVzRBMHhOb3dob0pGQ3VwVWVvSWlSdTVZNUlDcDdScDNIM1NQc2pSRG9zWUY5ZVpNdHVQeE1MZmR5RUVPdV8tYnFJ0gGcAUFVX3lxTE1IQ0JaZ0FXM1F1UTBwLTZLQUhBZjIzdWQ5NFFVSXhfZWZZb21uTGI5b1pIVU54U182NmFXUjFWdVQ4UEJKSlpqTGkxSjhDR05Wby1yNU8zTkh0SVZWemNGNUN5akJTUGd2eVBQMFA1TElBYzZPNDc1YWZoWEF6R2Jwd1c4bHdfbHZUdGdCLTlvaGQ4WGtTRVBQUE13Uw?oc=5",
    "published": "Sat, 03 May 2025 00:59:00 GMT",
    "sentiment": 0.1664141414141414,
    "importance": 0.667,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.409,
    "keywords": [
      "budget",
      "trump",
      "defense",
      "arent",
      "cuts"
    ]
  },
  {
    "Id": 15,
    "source": "Google News",
    "region": "US",
    "title": "After paying people to leave, one federal agency is scrambling to fill positions NPR",
    "summary": "After paying people to leave, one federal agency is scrambling to fill positions NPR",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxNN1VwcEd4RURLcndtMVI2dkxnWjNhYWlVVm1WamJNM1M4VVl2Mjk4V254bTZuVk5NVzNPWUNXNG9kNFVnbG1RTVdtVmJmTlNGWFBaLVVxZlpxbU9BLUxvYU9nNU84UWtWZ3E4Z0p5QS0zUFBIMVhsMW1HY0ZlY1NETFhTbmRqSnRCdFcwN1duUzZNYU12NzFj?oc=5",
    "published": "Sat, 03 May 2025 10:00:00 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.084,
    "keywords": [
      "agency",
      "federal",
      "leave",
      "npr",
      "paying"
    ]
  },
  {
    "Id": 16,
    "source": "Google News",
    "region": "US",
    "title": "Hegseth attorneys dual roles trip conflict of interest alarms Politico",
    "summary": "Hegseth attorneys dual roles trip conflict of interest alarms Politico",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZzVUdHktWFhBN0VETmFSTEREYld6Q2JlTEJZb0pOSWFLQ0t3S1l6MVoyUkt0WnRlVktCd2xhWjRrOUF5NVZCVXU0cms2Mk5nZXVVaThsdy1mRmEweGc2QXJQb0FnYjFaYkcyRjdubkpNbnBQT3JVYkxMbXJLWGZHa0pzTE1UeXZw?oc=5",
    "published": "Sat, 03 May 2025 11:00:00 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.063,
    "keywords": [
      "alarms",
      "attorneys",
      "conflict",
      "dual",
      "hegseth"
    ]
  },
  {
    "Id": 17,
    "source": "Google News",
    "region": "US",
    "title": "2 Planes Abort Landings as Army Helicopter Flies Near D.C. Airport The New York Times",
    "summary": "2 Planes Abort Landings as Army Helicopter Flies Near D.C. Airport The New York Times Airliners abort landings as Army helicopter makes scenic loop around Pentagon The Washington Post FAA Army helicopter taking scenic route near Reagan National forces two passenger jets to shift course Politico Boston flight forced to abort landing at Reagan National due to Blackhawk WCVB2 planes were ordered to go around because of Army copter near Reagan Airport NBC News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxOZHpndzdiN1pkazhfZ0JqclY2VF81ZGJNTTNGWUlqWU1EOGdDbnhGeTFsT3RXVnZrNGR2elBYYkcyRDRpalFhd1RyMTdhd191cW5aNFExVUdiS2ZZRS1nTFc2c2ppSkFfMTFoWWNDNVhOVHFLemxRNF83UTB6TFVQVW1YQ1h6ZUczZy1TYWx2SEhuM2puLXFhaExRdzNrZw?oc=5",
    "published": "Sat, 03 May 2025 02:12:21 GMT",
    "sentiment": 0.03096590909090909,
    "importance": 0.667,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.383,
    "keywords": [
      "army",
      "abort",
      "helicopter",
      "near",
      "airport"
    ]
  },
  {
    "Id": 18,
    "source": "Google News",
    "region": "US",
    "title": "Trump team clashes with Berlin over Af D designation as rightwing extremist politico.eu",
    "summary": "Trump team clashes with Berlin over Af D designation as rightwing extremist politico.eu Rubio and German Foreign Ministry spar on X over comments accusing Germany of tyranny in disguise CNN Marco Rubio criticized Germany. The foreign ministry hit back AP News Af D Germany defends extremist classification after Rubio slams 'tyranny in disguise' BBC Germany's Scholz urges careful review of possible farright party ban reuters.com",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQNko4Y1p5QXV3MkU1VTJnZW9IcjNTR1lRbnUwWXExdi1JaFVXZmJoYUdfelYwcTZTR29kcTNMdGVPMXl1YjA4RERSN3BGZnkxWmJ4LXBqN2xVakZqU2ZwVlgzSEhvZ2cwblB0SzdoNndLZGk4RUFWV2poa0dDclc4RnJuWmhPQ0VPdzBTSHNJWllNd05JS294YW52MHNmclNZcFE?oc=5",
    "published": "Sat, 03 May 2025 09:47:21 GMT",
    "sentiment": -0.05833333333333333,
    "importance": 0.8,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "germany",
      "af",
      "extremist",
      "rubio",
      "berlin"
    ]
  },
  {
    "Id": 19,
    "source": "Google News",
    "region": "US",
    "title": "Nearly 7,000 troops, tanks and parachute jumps Army confirms military parade coinciding with Trump's birthday ABC News",
    "summary": "Nearly 7,000 troops, tanks and parachute jumps Army confirms military parade coinciding with Trump's birthday ABC News Army Plans a Big Parade That Could Fall on Trumps Birthday The New York Times Trump to mark Armys birthday, and his, with parade of 6,600 soldiers The Washington Post Military parade to honour US Army will fall on Trump's birthday BBC Trump to host military parade to celebrate Army's 250th birthday, honor activeduty service members, veterans Fox News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMisAFBVV95cUxNak9NNTdURjJhM3JOTHRTOTl3NTRlQnNqZk5PeHByQ1paN0txdEJTS3F1REZZU0FpS0xOUENlcktqVXpldUlXaVYxVVFRSjhNNEFoa2RJRWh3alhKSzFEUFFVeTlLYUlYbmExdFJPRFBVQzRjWWI3czh2ODNzeDZHM05IZFpTNlJmMTB0MXM5Z0NEaDA3Ul8yTTVpU2xLWjZINXg0My1LeUZZUE5LazRhLdIBtgFBVV95cUxPSU5ERlpjWmlMSTBiRGxqbTZ5ZmlBbVh1aUZfaU9oRW81TGk5SFhBLUY3SGJfbmNWb2N4YUZObkVlc3liTGZoY0NPSTU4OHhTMVV4WjFlMFJ6QnlpQndMc2lHUFh5bzFNUWRZd011bXY2bDI1QVNiMXpQNXR0RC03TENhVnlSUldHbERDZHdOazRqQ1lBWGFXdVgzQXZPQlYyTGJJekRwOTFsQmNCRFFhZDlmemtZUQ?oc=5",
    "published": "Fri, 02 May 2025 21:45:00 GMT",
    "sentiment": -0.1116883116883117,
    "importance": 0.667,
    "relevance": 0.359,
    "authenticity": 0.6,
    "info_gain": 0.383,
    "keywords": [
      "birthday",
      "parade",
      "army",
      "trump",
      "military"
    ]
  },
  {
    "Id": 24,
    "source": "YouTube",
    "region": "GB",
    "title": "Luke Littler makes HISTORY against Michael van Gerwen! Premier League Night 13",
    "description": "Subscribe to Sky Sports Darts Watch Sky Sports Watch the full final of Night 13 in Birmingham as Luke Littler battled Michael van Gerwen with the chance to make Premier League Darts history and record five nightly wins. Darts highlights Greatest darts moments Best walkons More from Sky Sports on You Tube Sky Sports Sky Sports Boxing Sky Sports Cricket Sky Sports Football Sky Sports F1 Sky Sports Golf Sky Sports News Sky Sports Premier League Sky Sports Retro X Website To enquire about licensing Sky Sports content, you can find out more here",
    "category": "Sports",
    "publishedAt": "2025-05-02T07:07:20Z",
    "channelTitle": "Sky Sports Darts",
    "viewCount": "142283",
    "likeCount": "1257",
    "commentCount": "934",
    "duration": "PT20M23S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5214285714285715,
    "importance": 1.0,
    "relevance": 0.315,
    "authenticity": 0.333,
    "info_gain": 0.411,
    "keywords": [
      "sky",
      "sports",
      "darts",
      "league",
      "premier"
    ]
  },
  {
    "Id": 25,
    "source": "YouTube",
    "region": "GB",
    "title": "Can We Drop A Coin Into A Piggy Bank From 45m?",
    "description": "Customiser is LIVE!!! We hope you guys have heaps of fun creating your very own shirt or hoodie. FUN FACT There are more possible customiser shirts than stars in the known universe. BusinessLicensing Inquiries Memberships Exclusive Badges and Emotes Rexy Clothing discount code! Follow us Instagram Facebook Tik Tok Twitter Discord Music used with permission and licensed to How Ridiculous Dream Records LLC Sync Royalty Epidemic Sound",
    "category": "Sports",
    "publishedAt": "2025-05-02T22:01:05Z",
    "channelTitle": "How Ridiculous",
    "viewCount": "377956",
    "likeCount": "17678",
    "commentCount": "1393",
    "duration": "PT27M30S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.2766252367424243,
    "importance": 1.0,
    "relevance": 0.427,
    "authenticity": 0.333,
    "info_gain": 0.494,
    "keywords": [
      "customiser",
      "fun",
      "45m",
      "badges",
      "bank"
    ]
  },
  {
    "Id": 28,
    "source": "YouTube",
    "region": "GB",
    "title": "Imperial Takeover Fortnite Galactic Battle Gameplay Trailer",
    "description": "Driving back the Imperial invasion will take every blaster and ship at your disposal. Unless you feel a strong pull to the dark side drop into Fortnite Galactic Battle launching today! Play Fortnite Battle Royale, the completely free 100player Pv P mode. One giant map, A Battle Bus, Last one standing wins. ESRB Rating Teen with Violence. Instagram Twitter Facebook Tik Tok Learn More",
    "category": "People & Blogs",
    "publishedAt": "2025-05-02T06:00:18Z",
    "channelTitle": "Fortnite",
    "viewCount": "730611",
    "likeCount": "31006",
    "commentCount": "2296",
    "duration": "PT35S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.16064814814814815,
    "importance": 1.0,
    "relevance": 0.469,
    "authenticity": 0.333,
    "info_gain": 0.407,
    "keywords": [
      "battle",
      "fortnite",
      "galactic",
      "imperial",
      "100player"
    ]
  },
  {
    "Id": 29,
    "source": "YouTube",
    "region": "GB",
    "title": "Maroon 5 Priceless ft. LISA (Official Video)",
    "description": "Listen to Maroon 5 ft. LISA single Priceless, out now Follow Maroon 5 Instagram Facebook Twitter Tik Tok Sign up for updates Follow LISA Instagram Tik Tok Youtube Music video by Maroon 5, LISA performing Priceless. 2025 Interscope Records",
    "category": "Music",
    "publishedAt": "2025-05-02T04:00:07Z",
    "channelTitle": "Maroon5VEVO",
    "viewCount": "5027599",
    "likeCount": "466410",
    "commentCount": "40642",
    "duration": "PT2M52S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.7321428571428572,
    "importance": 1.0,
    "relevance": 0.725,
    "authenticity": 0.333,
    "info_gain": 0.196,
    "keywords": [
      "lisa",
      "maroon",
      "priceless",
      "follow",
      "ft"
    ]
  },
  {
    "Id": 30,
    "source": "Google News",
    "region": "GB",
    "title": "Labor on course to win second term in Australian election Financial Times",
    "summary": "Labor on course to win second term in Australian election Financial Times Australia PM Anthony Albanese wins reelection BBC Australian federal election 2025 live Labor wins election in crushing victory; Anthony Albanese acknowledges traditional owners; Peter Dutton concedes after losing own seat in Dickson electorate latest updates The Guardian Australias centerleft Labor Party retains power as conservative leader loses seat, networks report CNN Australias Labor Party, buoyed by antiTrump bump, set to win reelection The Washington Post",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE90U0ZJU181TWh3V0lBNWJZNVNDcHVjVHRwc2dKNlRrZl85UlozaVhha21hVWt1R2lFS3J0MlpNVlBqMXB2UnNzOXRmcndyNWdST29aMXRBa0J2clVOeXJJVm1Yd2FjbmdzQkJ3dlNCcks?oc=5",
    "published": "Sat, 03 May 2025 11:22:22 GMT",
    "sentiment": 0.24090909090909093,
    "importance": 0.8,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "labor",
      "election",
      "australian",
      "win",
      "albanese"
    ]
  },
  {
    "Id": 31,
    "source": "Google News",
    "region": "GB",
    "title": "Farage hails 'unprecedented' Reform win after beating Tories and Labour at local elections BBC",
    "summary": "Farage hails 'unprecedented' Reform win after beating Tories and Labour at local elections BBC Labour and Tories hunt for a way to counter Farages Reform Financial Times Local elections 2025 mapped Full results for every council and mayoral race The Independent Labour alienated its core and failed to attract Reform voters. Now will Starmer change tack? John Mc Donnell The Guardian Tory leader apologises to councillors as Reform makes big gains in local elections Sky News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiV0FVX3lxTFAyd216YVh2NmQxcWhCallXTnRYNDdkQXk2WFVEcWl0MzJRZjVvcDA0UXdYZEpJVG85N1IyS1VkTFpGV1BUeWRka2MtODVza0YzTDJkWHp4dw?oc=5",
    "published": "Sat, 03 May 2025 11:59:38 GMT",
    "sentiment": 0.20384615384615384,
    "importance": 1.0,
    "relevance": 0.371,
    "authenticity": 0.6,
    "info_gain": 0.395,
    "keywords": [
      "reform",
      "elections",
      "labour",
      "local",
      "tories"
    ]
  },
  {
    "Id": 32,
    "source": "Google News",
    "region": "GB",
    "title": "Updates from the scene after man in his 30s stabbed to death Liverpool Echo",
    "summary": "Updates from the scene after man in his 30s stabbed to death Liverpool Echo Haydock Woman arrested on suspicion of murder after man's fatal stabbing BBC Woman arrested on suspicion of murder after man dies in fatal stabbing St Helens Star Woman arrested on suspicion of murder after man stabbed in flat Liverpool Echo A murder probe has been launched and a Billinge woman was arrested after a man was stabbed Wigan Today",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPbktCQ1VIN0JnVzR1bzlvSG12aWJxQkFyeHQ1UzJxejhGUFVVdzFVdElNblBoYjRXdUVNbVNsdFROSVc0aEpMY1dtM0NQQkREWDlJRFg3T3JWbzZQeTJpLTFUSWt2V1p0TVI5OFFzMF9TWkZaYXFyUzEyWkNfRG54ZjQyRHMwdDhfNlhUS3pLSGRVbWN2R3JF0gGcAUFVX3lxTFBSeDc0aDQwaWlPbUtPM0FFR1IweXVOT1p5WlBJY3FPc21xUk5SQ3c4NWIzQjRzU0NPVkxudm5FajFad2t3TWY5bmRwX1JrNVF4bXM0dldMdEctaTBEdE54RXdaaTZqZW1na0dxSW5Rd3hJWDVfMDg4S1R6Y0V1UGxwVUJkNjR4NVNTVUJhYnZFaVR0dWIzSWxRa2djRA?oc=5",
    "published": "Sat, 03 May 2025 11:15:02 GMT",
    "sentiment": -0.40833333333333327,
    "importance": 0.8,
    "relevance": 0.383,
    "authenticity": 0.6,
    "info_gain": 0.277,
    "keywords": [
      "man",
      "arrested",
      "murder",
      "stabbed",
      "woman"
    ]
  },
  {
    "Id": 33,
    "source": "Google News",
    "region": "GB",
    "title": "Starmer must stop pussyfooting around, says Labour Red Wall chief The Telegraph",
    "summary": "Starmer must stop pussyfooting around, says Labour Red Wall chief The Telegraph",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxQRTdObGpHUVgyZlBvZVlCbmZHbnlSaG1YWTZ6djVUQ0YzLTRQRUxOS0pqdFhZcmRtdnRKVUtWMk16RXpLNjEtMW1ualBMUDRPeHEwSEZaUU1KbE5nT2h4T3NwOGIyanJiazRPVWVKd3F6cDhsbXpXR2wweFVESEM4d2dYZUVQLUkxRmhoQWRJWlFGN1dUQnVmUTVOZkY?oc=5",
    "published": "Sat, 03 May 2025 07:44:00 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.077,
    "keywords": [
      "chief",
      "labour",
      "pussyfooting",
      "red",
      "says"
    ]
  },
  {
    "Id": 34,
    "source": "Google News",
    "region": "GB",
    "title": "Children in tears as youths with 'knives and hammers' face off at cricket club Liverpool Echo",
    "summary": "Children in tears as youths with 'knives and hammers' face off at cricket club Liverpool Echo",
    "category": "sports",
    "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxNSHdNNmRjLTFKYTVtNkIxb3luZFhGTWhUTGZHRklVWk1UQnRpUjVhSHVZWEEwbWM4UXg0dnhBMURHOHVBZVhNd1NCYWE4WU1reFVLWkxIUlhkWk05cHlIU1VYdi15WmIwTGhneS1DdjdTaUFMTDBYSEI2TXBRQTJiZG04ZGF3UUFzamxtc05iY0ZnMmlKcXJrRHh1cVJ3UQ?oc=5",
    "published": "Sat, 03 May 2025 08:30:00 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.103,
    "keywords": [
      "children",
      "club",
      "cricket",
      "echo",
      "face"
    ]
  },
  {
    "Id": 35,
    "source": "Google News",
    "region": "GB",
    "title": "Headteachers union takes legal action against Ofsted over inspection changes The Guardian",
    "summary": "Headteachers union takes legal action against Ofsted over inspection changes The Guardian Teaching union launches legal action against Ofsted BBC Ofsted facing legal action over plans to change school inspections Sky News NAHT launches legal action over Ofsted reforms Schools Week School leaders union launches legal action against Ofsted ITV News ITVX",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxNX1R5NlY5UWtQZ2dwaW9sWHktTWpDRTdxbkVuV1Z2NV9JMTdPOHZ1YURDUUVzdS1ZbGZObjJYWXRZRkc0SGZ3azcydERqUW5GOHdYajZ2Z0UxcEZjOW9zY25xVkxLNU95QlJHczNFZEdrR0d4X2p3UlA4aEhQYS1mbXZkMDkyU0o1UjBPRjdka2NOaThmaHVpRmFZWGtXMHN6aGl6R29sbXZwSW1VN0plSlYxQ0VKUnBNR2dEMnBpNjBwdkhC?oc=5",
    "published": "Sat, 03 May 2025 05:01:00 GMT",
    "sentiment": 0.15000000000000002,
    "importance": 0.667,
    "relevance": 0.521,
    "authenticity": 0.6,
    "info_gain": 0.203,
    "keywords": [
      "action",
      "legal",
      "ofsted",
      "union",
      "launches"
    ]
  },
  {
    "Id": 36,
    "source": "Google News",
    "region": "GB",
    "title": "Prince Harry says Starmer should 'step in' over UK security row ITV News ITVX",
    "summary": "Prince Harry says Starmer should 'step in' over UK security row ITV News ITVX Prince Harry's emotional avalanche hits the Royal Family BBC It is hard to sympathise with Harrys latest interview hes clearly deeply troubled The Independent Prince Harry tells the BBC of his pain, and its queasy viewing. But who will switch it off? Hugh Muir The GuardianDignified silence was needed from Harry for reconciliation, commentator says The Independent",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxQS25qcWhqV0Z5cFdHZ1JDVzR2eDJHQmNnNVJYQWJ0MnFwYjVHMmxmRlg0NkNLeDFaS2wyc2Z5M2NkN0NKOHV2YkNJWkdBUTFPN1dnQXRtOU1ORlhYazBScEZhMUlNTWs2dzkwYWtiOW9STUJ3XzZEY1RBY2xkeEdKaWZiQ0Jlc3IyTl9qNXcwWE8yWmd4S1BoREFVdkctSWVZZ3IwdEpQRnRjVEhySFRLVEw5LWQ?oc=5",
    "published": "Sat, 03 May 2025 06:04:18 GMT",
    "sentiment": -0.04861111111111111,
    "importance": 0.667,
    "relevance": 0.392,
    "authenticity": 0.6,
    "info_gain": 0.402,
    "keywords": [
      "harry",
      "prince",
      "says",
      "bbc",
      "independent"
    ]
  },
  {
    "Id": 37,
    "source": "Google News",
    "region": "GB",
    "title": "Kilburn 'stabbing' LIVE Horror after incident outside London Underground station Daily Express",
    "summary": "Kilburn 'stabbing' LIVE Horror after incident outside London Underground station Daily Express",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMingFBVV95cUxPb2RITkJQbTNYeHg5RlR6dkdrdU9GNW56OHIyOElYeGdaTUVqdUo5SmNuZm5GNk1IWXVzSlpZcDhZSkNjdGN6M2FuR2V0T3lUNkZNQjJoSE1UaFZIZUx1YjNWYnh0aDVtOTh5Z2dTNWJUUWhSZHhzZkd3NUlvM3NKaTN6ZHM1Vi1oSG9FUjF5aWRMdHlzVEtLNDcxQUlFQdIBowFBVV95cUxNbE5uaWtEdFdHYmMxRDRZZ2RBMWRRTkxmV2x1Y1Q0TlRwckc5MjBzaVNmbnZ0RHRQdDEyMTdoaWVuT3dUUE02bWlQQndHLVRDNHRDbk1JenlaMDZ1WnVGOHc5MEdkYlE3WHo5Z19YQTBIZXVrRnBRNTBZVS11SmRBZmhVTUtXaU5fVmwwOTJMTjNoRV9PcVpzNXVMU0lGeERuenlZ?oc=5",
    "published": "Sat, 03 May 2025 11:46:00 GMT",
    "sentiment": -0.11590909090909089,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.077,
    "keywords": [
      "daily",
      "express",
      "horror",
      "incident",
      "kilburn"
    ]
  },
  {
    "Id": 38,
    "source": "Google News",
    "region": "GB",
    "title": "I'm locked in bitter row with neighbour over 12cm gap in privacy fence now I'm having to sell my home it's crushing The Sun",
    "summary": "I'm locked in bitter row with neighbour over 12cm gap in privacy fence now I'm having to sell my home it's crushing The Sun",
    "category": "diaries_&_daily_life",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxOd2lKUWVyeXFhT0NYWWoyNFRNbHdxZThzWWVjbUFadl9LX0YzNjd0NFBaOTVCbnhuY25HclVpbENnQWN4Y09KWFlUTU5oNHI0S0IxY2k5VWxYNDVfZzV1S1daeXc5MkZfSi03NFZOVzFVdVVGU09oWV8xUWk3em1uZA?oc=5",
    "published": "Sat, 03 May 2025 11:13:27 GMT",
    "sentiment": 0.15000000000000002,
    "importance": 0.8,
    "relevance": 0.695,
    "authenticity": 0.6,
    "info_gain": 0.157,
    "keywords": [
      "12cm",
      "bitter",
      "crushing",
      "fence",
      "gap"
    ]
  },
  {
    "Id": 39,
    "source": "Google News",
    "region": "GB",
    "title": "Royal Parks police unit to be 'disbanded' after 150 years despite charity's warning of 'serious consequences' lbc.co.uk",
    "summary": "Royal Parks police unit to be 'disbanded' after 150 years despite charity's warning of 'serious consequences' lbc.co.uk Rise in crime 'almost inevitable' as Royal Parks police disbanded after 150 years Sky News Royal Parks police scrapped after 150 years The Telegraph Assembly Member Gareth Roberts Slams Decision to Disband Royal Parks London Post Decision to disband Royal Parks Police by November 1 shortsighted Police Oracle",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1VWUdIWmZBV1MybUJKaXVkYXd3YWtLeFk2d19uYVdMaHdzU1NBRV9teXJpaGRqTXY4N2FsREpYU0hid0dXVkoxcDlqZ1EtdGVaUFVjRUd3MkRlbFdIbUFLVkZiUVhoNDZhaW4zbEEtQUU?oc=5",
    "published": "Sat, 03 May 2025 05:59:33 GMT",
    "sentiment": -0.2222222222222222,
    "importance": 0.667,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.31,
    "keywords": [
      "parks",
      "police",
      "royal",
      "150",
      "years"
    ]
  },
  {
    "Id": 40,
    "source": "YouTube",
    "region": "PK",
    "title": "We want justice for potato",
    "description": "",
    "category": "Gaming",
    "publishedAt": "2025-04-30T11:30:13Z",
    "channelTitle": "Koushal Monga",
    "viewCount": "22539511",
    "likeCount": "378986",
    "commentCount": "337",
    "duration": "PT20S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.028,
    "keywords": [
      "justice",
      "potato",
      "want"
    ]
  },
  {
    "Id": 41,
    "source": "YouTube",
    "region": "PK",
    "title": "Anant gya andaman nicobar island Mumma ka hand bag dene",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-29T09:08:01Z",
    "channelTitle": "PoonamSikarwar",
    "viewCount": "17924874",
    "likeCount": null,
    "commentCount": "237",
    "duration": "PT26S",
    "definition": "hd",
    "language": "tl",
    "translated": "Anant Gaya Andaman Nicobar Island Mumma's hand bag",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.061,
    "keywords": [
      "anant",
      "andaman",
      "bag",
      "dene",
      "gya"
    ]
  },
  {
    "Id": 42,
    "source": "YouTube",
    "region": "PK",
    "title": "Survive Under Water Tank",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-29T11:59:21Z",
    "channelTitle": "Out Of Mind Experiments",
    "viewCount": "24551682",
    "likeCount": "477371",
    "commentCount": "1000",
    "duration": "PT59S",
    "definition": "hd",
    "language": "da",
    "translated": "Survive Under Water Tank",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.021,
    "keywords": [
      "survive",
      "tank",
      "water"
    ]
  },
  {
    "Id": 43,
    "source": "YouTube",
    "region": "PK",
    "title": "Devious prank on Madni",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-29T09:37:04Z",
    "channelTitle": "BROTHERS VLOG",
    "viewCount": "23394174",
    "likeCount": "352648",
    "commentCount": "168",
    "duration": "PT18S",
    "definition": "hd",
    "language": "hr",
    "translated": "Devius Pranaks Madani",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.021,
    "keywords": [
      "devious",
      "madni",
      "prank"
    ]
  },
  {
    "Id": 44,
    "source": "YouTube",
    "region": "PK",
    "title": "",
    "description": "Land",
    "category": "People & Blogs",
    "publishedAt": "2025-04-29T10:00:17Z",
    "channelTitle": "萌萌与舞桐",
    "viewCount": "24998767",
    "likeCount": "337788",
    "commentCount": "157",
    "duration": "PT10S",
    "definition": "hd",
    "language": "de",
    "translated": "Land",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.003,
    "keywords": [
      "land"
    ]
  },
  {
    "Id": 45,
    "source": "YouTube",
    "region": "PK",
    "title": "Last one Subscribe",
    "description": "",
    "category": "People & Blogs",
    "publishedAt": "2025-05-01T07:04:50Z",
    "channelTitle": "Cheri's World",
    "viewCount": "12436592",
    "likeCount": "355432",
    "commentCount": "211",
    "duration": "PT46S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.015,
    "keywords": [
      "subscribe"
    ]
  },
  {
    "Id": 46,
    "source": "YouTube",
    "region": "PK",
    "title": "Papa Papa Main Kahan per baitha hun",
    "description": "",
    "category": "Comedy",
    "publishedAt": "2025-04-25T02:30:24Z",
    "channelTitle": "Roli ji Verma full masti",
    "viewCount": "31478320",
    "likeCount": "330276",
    "commentCount": "381",
    "duration": "PT15S",
    "definition": "hd",
    "language": "id",
    "translated": "Papa Papa where am i sitting",
    "sentiment": 0.16666666666666666,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.035,
    "keywords": [
      "papa",
      "baitha",
      "hun",
      "kahan",
      "main"
    ]
  },
  {
    "Id": 47,
    "source": "YouTube",
    "region": "PK",
    "title": "Garmi ke side effects most viral comedy",
    "description": "",
    "category": "Gaming",
    "publishedAt": "2025-05-02T06:02:52Z",
    "channelTitle": "Bihari Ladka",
    "viewCount": "11161106",
    "likeCount": "459938",
    "commentCount": "757",
    "duration": "PT1M18S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.041,
    "keywords": [
      "comedy",
      "effects",
      "garmi",
      "ke",
      "viral"
    ]
  },
  {
    "Id": 48,
    "source": "YouTube",
    "region": "PK",
    "title": "Madni did a devious magic trick for his friend",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-22T09:10:55Z",
    "channelTitle": "BROTHERS VLOG",
    "viewCount": "37074632",
    "likeCount": "472359",
    "commentCount": "316",
    "duration": "PT13S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.054,
    "keywords": [
      "devious",
      "did",
      "friend",
      "madni",
      "magic"
    ]
  },
  {
    "Id": 49,
    "source": "YouTube",
    "region": "PK",
    "title": "Champa Ko Trap Karliya New Viral Gadgets, Smart Appliances, Kitchen Utensils Home Inventions",
    "description": "",
    "category": "Education",
    "publishedAt": "2025-04-28T12:45:05Z",
    "channelTitle": "Facts Mited",
    "viewCount": "10446827",
    "likeCount": "301447",
    "commentCount": "89",
    "duration": "PT1M59S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.17532467532467533,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.081,
    "keywords": [
      "appliances",
      "champa",
      "gadgets",
      "home",
      "inventions"
    ]
  },
  {
    "Id": 50,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan tests successful launch of shortrange Abdali ballistic missile Dawn",
    "summary": "Pakistan tests successful launch of shortrange Abdali ballistic missile Dawn Pakistan successfully tests launch of shortrange Abdali ballistic missile Dawn Pakistan testfires ballistic missile as tensions with India rise Al Jazeera Pakistan preparations for ballistic missile test reckless act of provocation Hindustan Times Pak claims it tested ballistic missile with 450 km range amid tension with India India Today",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiSkFVX3lxTE5RaGxuYUUzSUNvT19Cdkh2VE5jYklTN3NjSFdJR0FOS0N2N1pmbVY2WVl3Qjk2M0FMdW9PY2J4ajA2cXpxU1dIMWp30gFOQVVfeXFMUFJLa0JKS2I1b0dicUNNZGI4Q0F0Rk5WUjROd1k4REtWaXp4X1ZLcXVGTGxUelpjMFJZXzhxbHE0T2JPNVNWQ283OFVRTGtn?oc=5",
    "published": "Sat, 03 May 2025 08:40:56 GMT",
    "sentiment": 0.75,
    "importance": 0.8,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.243,
    "keywords": [
      "ballistic",
      "missile",
      "pakistan",
      "abdali",
      "dawn"
    ]
  },
  {
    "Id": 51,
    "source": "Google News",
    "region": "PK",
    "title": "India bans imports from Pakistan amid tension over tourist killings Reuters",
    "summary": "India bans imports from Pakistan amid tension over tourist killings Reuters India bans imports from Pakistan in yet another postPahalgam attack move Dawn Pahalgam Terror Attack LIVE Updates Jamp;K CM Omar Abdullah meets PM Modi, first since Pahalgam attack Times of India The 10bn IndiaPakistan trade secret hidden by official data Al Jazeera India suspends exchange of all inbound mail, parcel services from Pakistan through air and surface routes Mint",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxQWDZ6MDYwWHE4VmRXUWRGU1V2Mmp3WWE3QTN6ZHhwTG93YmhCLTRYWnVxeC0tUFBVTGp0OTlCRWlzMHJ1b3lGbWVpUFdWNHJrQ19vY0M1Q1UxcWVyOFBJUzM4RVFrUkVGcFgtc3djazc0blJaOW1oTEF0ZGJDVzNHOW1DOUJYN21mdUtxenRNZW5hWjd4S0xSUHpNeThiNnpZMU9TSVNFT2lSRmk1cWNKc0dNZ214MGYw?oc=5",
    "published": "Sat, 03 May 2025 11:40:20 GMT",
    "sentiment": -0.04507575757575758,
    "importance": 0.8,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.389,
    "keywords": [
      "india",
      "pakistan",
      "attack",
      "bans",
      "imports"
    ]
  },
  {
    "Id": 52,
    "source": "Google News",
    "region": "PK",
    "title": "Fear grips Kashmirs villages along Lo C The News International",
    "summary": "Fear grips Kashmirs villages along Lo C The News International Pahalgam terror attack How Pakistan is preparing for the worst as India weighs response The Economic Times On both sides of the line of control, Kashmiris watch, wait and prepare for war Reuters The rising tension between India and Pakistan, briefly explained vox.com Pahalgam attack After years of calm, Lo C residents brace for 'war' as IndiaPakistan tensions rise Hindustan Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxPaVlLNktHNTZkMFNqQl9tNUxiQTd2Q0lnNHJKcmp5dUs5aVFHVUdGMDlpMTR4T1JlVWJhbV9OOUVLcmo1Z2gwYzVxNFVhNGhQclNEY2l0LW95YU5HT0gxbzNpZmRmSkJNamRGQk9fSVJMQWlfc1N2MUR1T2NOYmhDTTU3NGFTMjg?oc=5",
    "published": "Sat, 03 May 2025 09:20:00 GMT",
    "sentiment": -0.08333333333333333,
    "importance": 0.8,
    "relevance": 0.411,
    "authenticity": 0.6,
    "info_gain": 0.362,
    "keywords": [
      "lo",
      "attack",
      "fear",
      "grips",
      "india"
    ]
  },
  {
    "Id": 53,
    "source": "Google News",
    "region": "PK",
    "title": "Worshipers stampede at a temple in western India, killing 6 and injuring dozens Arab News PK",
    "summary": "Worshipers stampede at a temple in western India, killing 6 and injuring dozens Arab News PK6 crushed to death in temple stampede in Indias Goa Dawn7 killed, 80 injured in Goa temple stampede, Chief Minister announces inquiry India Today\"Health department working relentlessly\" Goa Health Minister Vishwajit Rane on Shirgaon stampede ANI News What Is Goa's Lairai Festival, During Which 6 Died In A Temple Stampede NDTV",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiVEFVX3lxTE12SmVXRVZZbi02d1dBeVRKMzNETTlaX2V5UmphcVBzRXdLU1pKaGhSOVhnREZlOVh6VHlpc3o2by1SUUYxcWROVnlfQUx1aC1GZFh4bw?oc=5",
    "published": "Sat, 03 May 2025 05:08:38 GMT",
    "sentiment": -0.07500000000000001,
    "importance": 0.667,
    "relevance": 0.407,
    "authenticity": 0.6,
    "info_gain": 0.349,
    "keywords": [
      "stampede",
      "temple",
      "goa",
      "india",
      "news"
    ]
  },
  {
    "Id": 54,
    "source": "Google News",
    "region": "PK",
    "title": "IMF program on track, Pakistan dismisses India's loan scrutiny request The Express Tribune",
    "summary": "IMF program on track, Pakistan dismisses India's loan scrutiny request The Express Tribune Govt insists programme on track amid reports of India asking IMF to review Pakistan loan Dawn India asks IMF to review loans to Pakistan, Indian government source says Reuters India eyes fund freeze for Pakistan after Pahalgam terror attack The Economic Times IMF to proceed with Pakistan review despite Indias objections Business Recorder",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQZmZNU1ZpLWxYLVJoN3BzZlREU0U1cWUzVTAtUmR3XzZiUHZrQ0tYcThWNFd3Z1IyZGh6bXYydWthREkwXzRhaGlDMHh2VWpjU1pPcWExbkh0bnRjakpXMFdGVVBLR1pLQkF4TE9oenZCb21LREhSTVROY3U3dHJvbVZVdDA1V2dPWlB2YmxiVm8wOUVsalpkM3RfQTFXZzZwMExrUmwzbGPSAbABQVVfeXFMTnVsTmxMcFVFbjlRSG9uVU9od2l6bUFlN0llVFh1LWtUcl9ORjFURGRYSzJHa2pkNk9GZVFlYUpKWHFVa2kxZHV2MnFSRnhxWGNSRE9PNTBWTkw5SVZhVFNpbjQ0ajNRRE05VWZYOV9jYjM2V0g5UmV6UzhZRWNvb2ZaaUVrcmNnYTB3bzN5MVAzV09vcmRmN09vYXV0VWRUSjM5SFpCVWJIRF9iNEFHa00?oc=5",
    "published": "Sat, 03 May 2025 07:33:03 GMT",
    "sentiment": 0.2,
    "importance": 0.8,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "pakistan",
      "imf",
      "india",
      "loan",
      "review"
    ]
  },
  {
    "Id": 55,
    "source": "Google News",
    "region": "PK",
    "title": "Pahalgam tensions Army leadership warns of decisive response against any Indian attempt to impose war Dawn",
    "summary": "Pahalgam tensions Army leadership warns of decisive response against any Indian attempt to impose war Dawn View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi0AFBVV95cUxNQmx0RnMwLVZiTmp2YWtGYUVUZDlOaEpJbk5xM1E0Z043NU9QTjZLQnRadVZNb0N2YkV0aWZmZVgxRE1PbkNRbEFGXzlzd2NUTktoVnhRbFJ4Mmw5Z3hVMTN0Z2I0MUJ3Z0w0bTFTa2JSalVtZTVvVUhNMWhrRGt6N0hZYlZmQkxSM3JacTlpUU8waTJ2Z2dfbUx6a1QyOEM1NUh4VTUyM2Y0ZE9qWVRVcWdEcjFSVDVVOFJJVW43dF9zc2FMbTZKalJtOTgxV2F00gFOQVVfeXFMT3FxTHdHNjYzY3VabG1HWm00OVdVNVlEVHNLNDZJZVMza2JKNUExbHlySHdKZk1WdGpPUzZ4UHVNSG5IS3RMX2VlWldNQnZn?oc=5",
    "published": "Fri, 02 May 2025 15:58:24 GMT",
    "sentiment": 0.35,
    "importance": 0.667,
    "relevance": 0.877,
    "authenticity": 0.6,
    "info_gain": 0.143,
    "keywords": [
      "army",
      "attempt",
      "dawn",
      "decisive",
      "impose"
    ]
  },
  {
    "Id": 56,
    "source": "Google News",
    "region": "PK",
    "title": "President Zardari approves CDA Amendment Ordinance 2025 Minute Mirror",
    "summary": "President Zardari approves CDA Amendment Ordinance 2025 Minute Mirror",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxNR2M0Qnh6UHhLekVrMUdldHJRM2x6M2x6Vjh0M19id0wwdklLajdnRHVGaHlWYU9MenA5MGVJVUlqSW9BdDBPMVMyTjZvc21relRwcURSdzFZSlBaOFBnbTgtdFBxbUVoakozQ1NIUmxOaHNNZTM0bHBvcmZnTGxrWUFSV3A4ZE5jS05LandpTEZ1bWl5aHc?oc=5",
    "published": "Sat, 03 May 2025 10:59:37 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.057,
    "keywords": [
      "2025",
      "amendment",
      "approves",
      "cda",
      "minute"
    ]
  },
  {
    "Id": 57,
    "source": "Google News",
    "region": "PK",
    "title": "India to stage fake encounters using detained Pakistanis, sources say nation.com.pk",
    "summary": "India to stage fake encounters using detained Pakistanis, sources say nation.com.pk Pakistan Exposes India's Plot to Eliminate Detained Citizens in Staged Encounters Pakistan Television India plans to kill detained Pakistanis to portray them as slain terrorists 24 News HD Indian army plans to kill Pakistani detainees in fake encounters Aaj English TV Indian Army and Intelligence Plan to Use Illegally Detained Pakistanis in Fake Encounters Exposed Khyber News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOZlFVM2JuU1V1SzgySGlyZHlSOUhnVFEwTGo0eXVpVDl2c2JDdzMzNjJiMkp6cXctMHBNWjVNRDgxbm01WE1pakowcGpBSVNJOG8xZ0lGRml3UkZVejl1VzRMN0RTVkY3eC1RUG93T2FaeC1iRUUtVk8wb05HM3hRc09mMDVScXM0NXlMb0JNSGd3dkR3azIwODBrUk5waHJoRFl2OG5pSDVEUdIBugFBVV95cUxPT3RzaTQ4TkhqLUdIemk4VDU0QzhlN3FCVm5oS1M4NlI1R0tIUDhlU25HVWR6bUU0NXhZUU5Tci05U1plLUxjRUNjWkVBSWxvclY0cElfRmd1NWFVRVZYQmRaRW9hbTNrZkJKOUNpMkZfdUJleUNZX2dyaEE5ZVo5cExIU2FCQ0xtQkIySVk5SHVHcmdibjVaYzcwMDZtdmxGcFJPZEtmUHlNMVIyQ1B0azBLNHJNNVdnQkE?oc=5",
    "published": "Sat, 03 May 2025 08:48:45 GMT",
    "sentiment": -0.4166666666666667,
    "importance": 0.8,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.329,
    "keywords": [
      "detained",
      "encounters",
      "fake",
      "india",
      "pakistanis"
    ]
  },
  {
    "Id": 58,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan Engages Embassies In Asymmetric Warfare Against India; News18 Accesses ISI Toolkit Exclusive Ne News18",
    "summary": "Pakistan Engages Embassies In Asymmetric Warfare Against India; News18 Accesses ISI Toolkit Exclusive Ne News18MOIB to facilitate media visit to Line of Control RADIO PAKISTAN Pakistani envoys step up global efforts to counter antiPakistan propaganda Aaj English TV Pakistan announces media visit to Lo C to counter Indian propaganda ARY News PTA blocks 46 UR Ls in crackdown on Indian antiPakistan campaign SamaaNews",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxPZHBzUWdQVTRFenFMZW1UY2l5VDFGVzM4cXB3S3B0NFcxdHVoRXk4VUxoTldVT1NyUUFkejk2Y2NJeS1mS0pkUl9zVklJRkNoT3RkQ2YyMlhockJiQmx5UmpyTFA4cURmSGs0M0hQQ1NyUEZWckVkaEx0aHZjdklxLVdyMk1KZ3IxREZleEVjanpiUTkzNnZmN0E3UF9FejlpS19FYTlOdlNfa29VOXh4elBRUXFhSVBQYmc0RHZDM2VMcC1EN1dLdG1rcTdMaV9rQmtVZThxblVOZ9IB3wFBVV95cUxPb3lMTkhDOXZxQ0NrM0RVRTlTSVhTSnppYWNZN1Q4WllBc1RzWTFmSVVybHd2WEhQTjJLT0JuM0JoOS1PVFcwYy04SWZpWlZERVBWOHR0clpscEFiWXRZalNjRjVvVTFnOTRoVERkc0o4RnVNc0R5ZE1vNjV6dVlMTFRyM2ZQeU1taGVFTnNTSVhRbWsxSE5DYTBINE15OHlMWVp3dnNLNUQ2aHhpQUtHcFpyWDRhT1N5dEcxU19nZ3I5WmVoVkMzS1J0bHpsZ0hPMEhwSDhZcXRqRE1nOVYw?oc=5",
    "published": "Fri, 02 May 2025 15:20:19 GMT",
    "sentiment": -0.05,
    "importance": 0.667,
    "relevance": 0.427,
    "authenticity": 0.6,
    "info_gain": 0.342,
    "keywords": [
      "pakistan",
      "news18",
      "accesses",
      "antipakistan",
      "asymmetric"
    ]
  },
  {
    "Id": 59,
    "source": "Google News",
    "region": "PK",
    "title": "Rainwindstormthunderstorm expected in many parts of country RADIO PAKISTAN",
    "summary": "Rainwindstormthunderstorm expected in many parts of country RADIO PAKISTAN Two die, 24 injured in rain, windstorm Punjab PDMA Dawn Capital braces for rains, storms The Express Tribune Met Office forecast rainfall in Karachi next week ARY News Heavy rain, strong winds lash Lahore Dunya News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMinAFBVV95cUxOVmYwQnJYbDd3M2ZUVk5jRzVKcWk4T3FfdVhNVXNMVTRheGNkRXUzWFBBVmlLcjhGcjBmUGlrUU9BbkpzczVQWUdyczlLZXNqb3RYeWxKdXltVnVOWXRmWFVoLUpBMktvUG1JNkZYVmQ4MHpsajJoTUU3ZkI4UWNaQXExNEN1ZWZPR0ZyejR1SlZjNTFSY3Rnb1JxMjc?oc=5",
    "published": "Sat, 03 May 2025 03:38:07 GMT",
    "sentiment": 0.14761904761904762,
    "importance": 0.667,
    "relevance": 0.617,
    "authenticity": 0.6,
    "info_gain": 0.269,
    "keywords": [
      "country",
      "expected",
      "news",
      "pakistan",
      "parts"
    ]
  },
  {
    "Id": 0,
    "source": "YouTube",
    "region": "US",
    "title": "Canelo lvarez vs William Scull Fight Highlights",
    "description": "Subscribe to our You Tube channel Subscribe to the DAZN X Series You Tube channel Sign up to DAZN now Follow DAZN Boxing On Social Media Twitter Instagram Facebook The DAZN Boxing Show DAZN Rewind",
    "category": "Sports",
    "publishedAt": "2025-05-04T06:08:32Z",
    "channelTitle": "DAZN Boxing",
    "viewCount": "1883950",
    "likeCount": "17606",
    "commentCount": "6166",
    "duration": "PT3M13S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.03333333333333333,
    "importance": 1.0,
    "relevance": 0.793,
    "authenticity": 0.333,
    "info_gain": 0.202,
    "keywords": [
      "dazn",
      "boxing",
      "channel",
      "subscribe",
      "tube"
    ]
  },
  {
    "Id": 1,
    "source": "YouTube",
    "region": "US",
    "title": "Kentucky Derby 2025 (FULL RACE) NBC Sports",
    "description": "Watch the full Run for the Roses at the 151st Kentucky Derby from Churchill Downs! Subscribe to NBC Sports Watch Live Sports on Peacock Get more horse racing news on NBC Sports NBC Sports Group serves sports fans 247 with premier live events, insightful studio shows, and compelling original programming. NBC Sports is an established leader in the sports media landscape with an unparalleled collection of sports properties that include the Olympics, NFL, Premier League, Big Ten, NASCAR, PGA TOUR, the Kentucky Derby, Tour de France, and many more. Subscribe to our channel for the latest sporting news and highlights! The Kentucky Derby and Preakness Stakes are far more than just twominute horse races They are 300 years of history, tradition and athleticism, all rolled into single sporting events. Celebrating the pursuit of American excellence, NBC Sports is the exclusive home to the opening two races of the Triple Crown. Beyond the Kentucky Derby and Preakness Stakes, NBC Sports broadcasts some of the most important and prestigious events in all of horse racing. With exclusive media rights to the Breeders Cup Challenge Series and the Breeders Cup Classic, viewers can watch the best contenders compete across the country between June and November. Visit NBC Sports Find NBC Sports on Facebook Follow NBC Sports on Twitter Follow NBC Sports on Instagram Kentucky Derby 2025 (FULL RACE) NBC Sports",
    "category": "Sports",
    "publishedAt": "2025-05-03T23:18:52Z",
    "channelTitle": "NBC Sports",
    "viewCount": "1383094",
    "likeCount": "7912",
    "commentCount": "2247",
    "duration": "PT2M31S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.32406977942692233,
    "importance": 1.0,
    "relevance": 0.143,
    "authenticity": 0.333,
    "info_gain": 0.38,
    "keywords": [
      "sports",
      "nbc",
      "derby",
      "kentucky",
      "events"
    ]
  },
  {
    "Id": 3,
    "source": "YouTube",
    "region": "US",
    "title": "Dream VS Daquavis 100,000 Pv P Duel",
    "description": "Dream VS Daquavis 100,000 Pv P Duel. This is the Pv P challenge, the first challenge in our duel. Next is the 10 skills challenge. Who will win? Follow my socials Twitter Instagram Snapchat Daquavis I am just starting my training arc, and this is the beginning of it. Thank you to everyone who helped me train this last week for this duel. Much more training is necessary to beat 6 hunters. For now, beating Daquavis is my main focus.",
    "category": "Gaming",
    "publishedAt": "2025-05-03T17:00:06Z",
    "channelTitle": "Dream",
    "viewCount": "5661830",
    "likeCount": "442389",
    "commentCount": "57274",
    "duration": "PT35M26S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.21458333333333335,
    "importance": 1.0,
    "relevance": 0.383,
    "authenticity": 0.333,
    "info_gain": 0.402,
    "keywords": [
      "daquavis",
      "duel",
      "challenge",
      "pv",
      "000"
    ]
  },
  {
    "Id": 4,
    "source": "YouTube",
    "region": "US",
    "title": "Reinier de Ridder knocks out Bo Nickal in UFC Des Moines comain event ESPN MMA",
    "description": "Reinier de Ridder uses a wellbalanced attack before dropping Bo Nickal with a knee to the body to get the TKO win in Round 2 at . For more UFC, sign up for ESPN Get the ESPN App Subscribe to ESPN on You Tube Subscribe to ESPN FC on You Tube Subscribe to NBA on ESPN on You Tube Watch ESPN on You Tube TV",
    "category": "Sports",
    "publishedAt": "2025-05-04T04:37:57Z",
    "channelTitle": "ESPN MMA",
    "viewCount": "289338",
    "likeCount": "4878",
    "commentCount": "3073",
    "duration": "PT1M23S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.3666666666666667,
    "importance": 1.0,
    "relevance": 0.417,
    "authenticity": 0.333,
    "info_gain": 0.309,
    "keywords": [
      "espn",
      "tube",
      "subscribe",
      "bo",
      "nickal"
    ]
  },
  {
    "Id": 5,
    "source": "YouTube",
    "region": "US",
    "title": "Game 7 Colorado Avalanche vs. Dallas Stars Full Game Highlights ESPN NHL",
    "description": "The Dallas Stars overcome a twogoal deficit in the third period to beat the Colorado Avalanche, 42, in Game 7 of their firstround series. Mikko Rantanen recorded a hat trick and an assist against his former team, as Dallas advances to face either the Jets or Blues in Round 2. Subscribe to ESPN Get the ESPN App Subscribe to ESPN on You Tube Subscribe to ESPN FC on You Tube Subscribe to NBA on ESPN on You Tube Watch ESPN on You Tube TV",
    "category": "Sports",
    "publishedAt": "2025-05-04T03:00:27Z",
    "channelTitle": "NHL on ESPN",
    "viewCount": "166907",
    "likeCount": "2588",
    "commentCount": "1654",
    "duration": "PT13M53S",
    "definition": "hd",
    "language": "en",
    "sentiment": -0.15,
    "importance": 1.0,
    "relevance": 0.347,
    "authenticity": 0.333,
    "info_gain": 0.383,
    "keywords": [
      "espn",
      "subscribe",
      "tube",
      "dallas",
      "game"
    ]
  },
  {
    "Id": 7,
    "source": "YouTube",
    "region": "US",
    "title": "Jarahn Laif Blo Today ft. Pettz (Audio)",
    "description": "Laif Blo Today (Official Audio) Prod by Jarahn at Six7five Studio",
    "category": "Music",
    "publishedAt": "2025-04-29T14:51:48Z",
    "channelTitle": "Jarahn",
    "viewCount": "48027",
    "likeCount": "1724",
    "commentCount": "224",
    "duration": "PT3M36S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.082,
    "keywords": [
      "audio",
      "blo",
      "jarahn",
      "laif",
      "today"
    ]
  },
  {
    "Id": 8,
    "source": "YouTube",
    "region": "US",
    "title": "Minecraft but You Mine 1,000,000 Blocks",
    "description": "This is an for the Group. For more information about LEGO Minecraft, check out this link Need new glasses? Check out our partner Zenni Optical For 10 off your purchase at checkout use code PRESTON10 Thanks to and for inspiration! SUBSCRIBE FIRE MERCH DOWNLOAD APP FOLLOW ME HERE! Tik Tok Instagram Twitter MY FAN DISCORD! Additional music provided by Epidemic Sound Click here for a free trial! If you believe your copyrighted work was unintentionally used in this video without permission, please contact us at copyright.net",
    "category": "Gaming",
    "publishedAt": "2025-05-03T14:15:01Z",
    "channelTitle": "PrestonPlayz",
    "viewCount": "843967",
    "likeCount": "15740",
    "commentCount": "1958",
    "duration": "PT22M22S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.38539772727272725,
    "importance": 1.0,
    "relevance": 0.362,
    "authenticity": 0.333,
    "info_gain": 0.567,
    "keywords": [
      "000",
      "check",
      "minecraft",
      "10",
      "additional"
    ]
  },
  {
    "Id": 9,
    "source": "YouTube",
    "region": "US",
    "title": "The MOST BRAINROT Roblox Games..",
    "description": "CAYLUS PLUSHIES Use STARCODE Caylus Caylus Instagram Caylus Twitter",
    "category": "Gaming",
    "publishedAt": "2025-05-03T18:12:06Z",
    "channelTitle": "CaylusBlox",
    "viewCount": "870474",
    "likeCount": "11806",
    "commentCount": "1744",
    "duration": "PT17M46S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.075,
    "keywords": [
      "caylus",
      "brainrot",
      "games",
      "instagram",
      "plushies"
    ]
  },
  {
    "Id": 10,
    "source": "Google News",
    "region": "US",
    "title": "Trump says I dont know when asked if hes required to uphold Constitution The Washington Post",
    "summary": "Trump says I dont know when asked if hes required to uphold Constitution The Washington Post Trump is acting like its his choice whether he obeys the Constitution CNN Trump, asked if he has to 'uphold the Constitution,' says, 'I don't know' NBC News Does a president need to uphold the Constitution? Trump says 'I don't know' NPR Trump says he doesnt know if he needs to uphold constitutional due process The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxPaFZuRzQ0QzU4T3p1em1jYlRBZUhFeWxESDBDdDF0V2pCUE1fbC1UY0RLVzhZTFFncTZ0ZzREX1p4X3V1elEtZm9WTzF6UEFvQk9zd19jUDVHU0luY05TYW00dFBiTm1Ud1JWMkdNb1hXTVRVeEotMm5pZnVBVGxTZ29VMkIzYS1zQ0s0UnBNYlhjQnVLbEFz?oc=5",
    "published": "Mon, 05 May 2025 00:19:00 GMT",
    "sentiment": -0.0625,
    "importance": 0.8,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.283,
    "keywords": [
      "trump",
      "constitution",
      "know",
      "says",
      "uphold"
    ]
  },
  {
    "Id": 11,
    "source": "Google News",
    "region": "US",
    "title": "Trump orders 100 tariff on foreignmade movies to save 'dying' Hollywood Reuters",
    "summary": "Trump orders 100 tariff on foreignmade movies to save 'dying' Hollywood Reuters Trump orders a 100 tariff on foreign movies CNN Trump announces plans for 100 tariffs on all foreign movies NBC News Trump announces 100 tariff on all foreignproduced movies 'WE WANT MOVIES MADE IN AMERICA, AGAIN!' Fox News Trump Calls for 100 Tariff on Movies Made Overseas WSJ",
    "category": "film_tv_&_video",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxNZXF6WWNDSzd2T1g5ekhubU5sOU96cG5NTGJ3WHJfSTV3emJ4akdjTGpLdHBzYmstMWlpTTdDYVlCb3ktM2NyZ1ZXSS1DS3FwUmY1bGtwc2NnOV9xMC1LRDdhVGhyb2dCcjdaaTA3d0NyZGx0LU5RY3oxZzJRdDlNcF9vaGFKaGJiLVZRTEQySXJEaGYyVnhsbW9Cc19TYWZ2UGRBX3d1ZnFwRWFtOWlBV3NB?oc=5",
    "published": "Mon, 05 May 2025 05:34:00 GMT",
    "sentiment": -0.140625,
    "importance": 1.0,
    "relevance": 0.463,
    "authenticity": 0.6,
    "info_gain": 0.243,
    "keywords": [
      "movies",
      "100",
      "trump",
      "tariff",
      "orders"
    ]
  },
  {
    "Id": 12,
    "source": "Google News",
    "region": "US",
    "title": "Trump says he will reopen Alcatraz prison AP News",
    "summary": "Trump says he will reopen Alcatraz prison AP News Trump says he is directing Bureau of Prisons to reopen Alcatraz to house ruthless and violent offenders CNN Trump orders the reopening of Alcatraz prison Reuters President Trump says he will direct agencies to reopen Alcatraz NBC Bay Area Trump orders feds to reopen Alcatraz to house 'Americas most ruthless and violent' criminals Fox News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPeTNZQW5OQVcwbkE2dWl5QkF1SU9TQmJXaHhMY2NXdl9yN0I1SzNiWDJUZW9NV0VhSE5hZ0M5RlhlVDZpeE9HZlBHSTRsUF9aQnUtRUNZSWVUWXFIazNYcUZwQWxVamd4ZWpkVlZkUWxlc09pSTRMeEg2ckRGS2Z0bWgxUDlzMlhF?oc=5",
    "published": "Mon, 05 May 2025 04:32:00 GMT",
    "sentiment": -0.5,
    "importance": 0.8,
    "relevance": 0.457,
    "authenticity": 0.6,
    "info_gain": 0.237,
    "keywords": [
      "alcatraz",
      "trump",
      "reopen",
      "says",
      "news"
    ]
  },
  {
    "Id": 13,
    "source": "Google News",
    "region": "US",
    "title": "Incredibly distasteful says Ten Haken to Trumps AI Pope photo KELOLAND.com",
    "summary": "Incredibly distasteful says Ten Haken to Trumps AI Pope photo KELOLAND.com Vance defends Trumps post depicting AIgenerated image of himself as pope Politico'It's very unfortunate' Milwaukee archbishop reacts to AI image of Trump as pope as conclave will begin this week Milwaukee Journal Sentinel AIgenerated image of Trump as pope is the latest White House controversy Al Jazeera Catholic outrage grows over 'Pope Trump' image on official White House media National Catholic Reporter",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOQlVydDVSLVMxVDc2NVFDTklxU0l6WDJDTGRXUjVGT0NtaVVYOWIyM3J3TEM1UGRjWi04RlNfcjZJcXZkNDluMGFfWmotTGltZ19ZeG9mSm9xdV9TMUdqMTd6c1hpTi1MS2dzSlkzQ05qanBXa2plZURCV19LbnJwMUFVX2pSUFZIMVJGNHlvVV9nYk80cHRXVE5fM3VwVHhWNmhVV9IBqgFBVV95cUxPZGdHZE5pM1FmbGlDR1lnWmdNNHk5TkpkYk9OVE9XZ1lFcm81S1hyNDFKN2h3OXVWWFN2MUdQM0N4VS1sejU2SG50LVBtSkFOVElia0JXc3BBYkFITWQwOW9ST0tpS1RCVmNJNEZPcDBNVWd5RXN5VzJEZlc5QnhEdXNDOU1hYVJEbUNuSXh2TEtWS2t5UF85cmJyR1hSSWpXQnRVajc3eWMwZw?oc=5",
    "published": "Sun, 04 May 2025 23:05:20 GMT",
    "sentiment": -0.11499999999999999,
    "importance": 0.667,
    "relevance": 0.397,
    "authenticity": 0.6,
    "info_gain": 0.363,
    "keywords": [
      "pope",
      "image",
      "ai",
      "trump",
      "trumps"
    ]
  },
  {
    "Id": 14,
    "source": "Google News",
    "region": "US",
    "title": "A Tale of Two Elections Trump Casts Shadow Over Australia and Singapore Council on Foreign Relations",
    "summary": "A Tale of Two Elections Trump Casts Shadow Over Australia and Singapore Council on Foreign Relations A New Trend in Global Elections The AntiTrump Bump The New York Times Monday briefing How Australia became the second nation in a week to reject the Trumpist right The Guardian How MAGA Tactics Sank Australias Conservatives Bloomberg.com Blaming Donald Trump for conservative losses in both Canada and Australia is being too kind to Peter Dutton The Conversation",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMijwFBVV95cUxOV2VCaEJYTmhNcHprN0VFeW1lMUNkWnEzOFRhUnFydmVmTzZINlBRRWdsOGUzVExidnc3Nmh2S29XVXpKY2JNeVlhZnB1Z2VxWU00WVBGUmZ6NjZTWVkzTUdPcThYS3pXZUdfajNfM3lhSWdvNjRHRXlfQXctenZ1YURnM1N3bWw4eDNfOFg5NA?oc=5",
    "published": "Sun, 04 May 2025 18:39:43 GMT",
    "sentiment": 0.1135551948051948,
    "importance": 0.667,
    "relevance": 0.371,
    "authenticity": 0.6,
    "info_gain": 0.395,
    "keywords": [
      "australia",
      "elections",
      "trump",
      "casts",
      "council"
    ]
  },
  {
    "Id": 15,
    "source": "Google News",
    "region": "US",
    "title": "Trump Plays Down Talk of a Third Term, Backing Vance and Rubio The New York Times",
    "summary": "Trump Plays Down Talk of a Third Term, Backing Vance and Rubio The New York Times Trump says he won't seek a third term BBC Trump says he can't run again in 2028 5 takeaways from 'Meet the Press' interview USA Today Trump news at a glance President says he will not seek a third term The Guardian'I'll be an eightyear president' Trump weighs in on thirdterm speculation NBC News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8weDA2ZThBOGd5Y1BwMi1QWk0xbmtELV9YbG9sZzZmQ1lhRi05NXJ0ZXkzV1FZVjJlQWcyV09SVHl0S1RRQk1GMndvM1JTUGRGR0FMNDk3ME01T3BzN0labHZzbl9kU0hmSVhIZnVWZU1CdTdzYjdUMy1pQzdwZjg?oc=5",
    "published": "Sun, 04 May 2025 15:36:08 GMT",
    "sentiment": -0.004797979797979808,
    "importance": 0.667,
    "relevance": 0.387,
    "authenticity": 0.6,
    "info_gain": 0.376,
    "keywords": [
      "trump",
      "term",
      "says",
      "backing",
      "new"
    ]
  },
  {
    "Id": 16,
    "source": "Google News",
    "region": "US",
    "title": "South Texas approves creation of Space X's new city, Starbase KOMO",
    "summary": "South Texas approves creation of Space X's new city, Starbase KOMO Elon Musk wanted to turn his Space X launch site into a city. Voters in Texas just said yes. KUT Elon Musk's Starbase in Texas will officially become a city BBC Welcome to Starbase, Texas. Whats Next for Elon Musks RocketBuilding Company Town. WSJ First reactions to Starbase City incorporation Valley Central.com",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMijwJBVV95cUxNUmxnaWpzeEllMXpMeVJwSzhxQVp1QV9PSUthdlJ6azl3eGw3QUZFcVE4RnFlMlpyUUhzNDl0X2F5T0k5UXJCWERVaDk2NXFwb3dBOXBwbWdXSXN5WGxzbUl5bm85OUNiS2FpbXltaTJDZ0puUHN2aERpdlNzNTlvX1NvVHlIVkFSRWQybnNXaTNIbmFQVnViWUpyM1hzdlVfTmJSXzhCeUNKLTBSWGRMNW9lb09QSUN0ZDJsbHNkYVc3el9qczZkMEVKU0JPWm1ubkk3b2VnTW5EMnBzdTVEWm5Eamk0UTNXUnBiWVhNaXcyRnQ0d19CM1EtSHZTSjJIQ1RvTWdhSHpjT01ZNXBB?oc=5",
    "published": "Sun, 04 May 2025 17:55:27 GMT",
    "sentiment": 0.26454545454545453,
    "importance": 0.667,
    "relevance": 0.451,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "city",
      "starbase",
      "texas",
      "elon",
      "space"
    ]
  },
  {
    "Id": 17,
    "source": "Google News",
    "region": "US",
    "title": "Dave Portnoy decides punishment for those involved in antiSemitic fk the Jews sign at Barstool Sports bar New York Post",
    "summary": "Dave Portnoy decides punishment for those involved in antiSemitic fk the Jews sign at Barstool Sports bar New York Post Dave Portnoy responds to antisemitic sign at Barstool Philadelphia 6abc Philadelphia Temple student suspended after antisemitic sign at Barstool Sansom Street NBC10 Philadelphia Barstool Philly bar antisemitic incident Temple student involved, Dave Portnoy reacts FOX 29 Philadelphia Philadelphia police investigate antisemitic incident at Barstool bar NBC News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPS2l3azR3a1g4ZjVtNVFmaVVVQ0dQNWJDbGk5SEp3Mk5LR1JvWGdERHFVMXlhdTBYZXp2RHQ4T2lXRTdDNjRST3BlVHlQdzBTVzRSLUVvaWZHWHBYd3l2SFM3MW1uWDQxeTdQTjBoc2xmOHZvaUtJd25lY3pXOHVscXB1SXhlWFhfazQ0eGZ0b2lrbjZVN2lfSGtlMXhpQnIxMU5pTHcycUhwR3hZYm9acEFDQkJqbDNZTkxBVENhWVBKYTY0V0l6RVRsc3M?oc=5",
    "published": "Mon, 05 May 2025 01:35:00 GMT",
    "sentiment": 0.13636363636363635,
    "importance": 0.8,
    "relevance": 0.383,
    "authenticity": 0.6,
    "info_gain": 0.27,
    "keywords": [
      "antisemitic",
      "barstool",
      "philadelphia",
      "bar",
      "dave"
    ]
  },
  {
    "Id": 18,
    "source": "Google News",
    "region": "US",
    "title": "Mike Pence defends Constitution after getting Profile in Courage Award Politico",
    "summary": "Mike Pence defends Constitution after getting Profile in Courage Award Politico Pence says January 6 attacks failure became a triumph of freedom as he receives JFK Profile in Courage Award CNN Mike Pence awarded JFK Profile in Courage award for certifying 2020 presidential election on Jan. 6 The Boston Globe Former Vice President Pence defends Constitution after getting Profile in Courage Award AP News Former Vice President Mike Pence honored by Kennedy family in receiving the JFK 'Profile in Courage Award' Fox News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMivAFBVV95cUxOUFRVdkp1S2l4TUpLemt0eTVHNEl5V0pQM1hLU0ZmY3B6TU5CTy1PTi1NWmtFOS1leUl3QTgtRS1zWlBXY05jaVkwdWlaZHdQUGZRTFREX3lUVDBoeWczYzBXRDhNMFRZcEM2eklRZE8zZkhRSW5jdVBtUHJLcGhxVFc1cDd1Mm5QbUJYWXUwRExvLTd3a2RWeFMyRHRZS0szcnA3Zm43M3JIUXdhallzdUdNYzQwal9vMnc5Uw?oc=5",
    "published": "Mon, 05 May 2025 03:30:30 GMT",
    "sentiment": -0.10555555555555557,
    "importance": 0.8,
    "relevance": 0.355,
    "authenticity": 0.6,
    "info_gain": 0.33,
    "keywords": [
      "award",
      "courage",
      "pence",
      "profile",
      "mike"
    ]
  },
  {
    "Id": 19,
    "source": "Google News",
    "region": "US",
    "title": "Tech site 404 Media says Signallike app used by Trump adviser was hacked Reuters",
    "summary": "Tech site 404 Media says Signallike app used by Trump adviser was hacked Reuters How Marco Rubio defied expectations and rose to the top of Trumps orbit Politico Sen. Tammy Duckworth says Mike Waltz will have a \"brutal hearing\" for U.N. ambassador CBS News Washington Week with The Atlantic full episode, 5225 PBS Inside Waltzs ouster Before Signalgate, talks with Israel angered Trump The Washington Post",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMizAFBVV95cUxQYkVCRzFjSnhGUnVnQ25LSm9aVXpUb0RXNi1UX0otQ19TZVpiLXg1anFZd1RfVTNIZUxGUXh0NHZVMVZlS2NmZXJEczZ4RFFYOHR2WEJZeHl3bC1lU0lqNzdLQkZNbEd4U2JFWVptSWdiTnhVSDZYcno2TkFmeldVaHVIWFRncThwbE1jQUIxTURyT200WTVpR1BGUFp1R3Uwc0RUV09WTlgzZ0F6OS0yclhKMVpfbF9rczl0aXBORkZBLUQ2UW83Q2MwYlY?oc=5",
    "published": "Mon, 05 May 2025 01:04:00 GMT",
    "sentiment": -0.03499999999999999,
    "importance": 0.8,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.408,
    "keywords": [
      "says",
      "trump",
      "404",
      "adviser",
      "app"
    ]
  },
  {
    "Id": 20,
    "source": "YouTube",
    "region": "GB",
    "title": "Instant Highlights Leinster Rugby v Northampton Saints Semifinal Investec Champions Cup 202425",
    "description": "Leinster Rugby and Northampton Saints went toetotoe in Dublin for a spot in the Cardiff 2025 Final. Subscribe to be notified when new videos are live, including Instant Highlights straight after the match and Extended Highlights at the end of the match day Follow us on our other social networks Instagram Tik Tok Facebook X Follow EPCR Challenge Cup on our other social networks Instagram Facebook X Live broadcast available across the globe see locations here (scroll to the bottom) Investec Champions Cup EPCR Challenge Cup",
    "category": "Sports",
    "publishedAt": "2025-05-03T19:38:13Z",
    "channelTitle": "Investec Champions Cup & EPCR Challenge Cup",
    "viewCount": "338143",
    "likeCount": "3596",
    "commentCount": "1554",
    "duration": "PT6M23S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.06881313131313131,
    "importance": 1.0,
    "relevance": 0.34,
    "authenticity": 0.333,
    "info_gain": 0.435,
    "keywords": [
      "cup",
      "highlights",
      "challenge",
      "champions",
      "epcr"
    ]
  },
  {
    "Id": 22,
    "source": "YouTube",
    "region": "GB",
    "title": "CHAMPIONS! Plymouth Argyle 12 Leeds United Manor Solomon scores dramatic late winner!",
    "description": "Highlights as we are crowned champions after victory against Plymouth Argyle at Home Park in the 202425 EFL Championship. Get exclusive Leeds United video content first download the Official App If you enjoyed this video don't forget to subscribe. If you want to keep up with everything Leeds, go check out our other pages",
    "category": "Sports",
    "publishedAt": "2025-05-03T14:17:03Z",
    "channelTitle": "Leeds United Official",
    "viewCount": "437254",
    "likeCount": "8663",
    "commentCount": "1948",
    "duration": "PT4M33S",
    "definition": "hd",
    "language": "en",
    "sentiment": -0.03666666666666667,
    "importance": 1.0,
    "relevance": 0.505,
    "authenticity": 0.333,
    "info_gain": 0.375,
    "keywords": [
      "leeds",
      "argyle",
      "champions",
      "plymouth",
      "united"
    ]
  },
  {
    "Id": 23,
    "source": "YouTube",
    "region": "GB",
    "title": "Im Bored Watching Arsenal (Lee Judges) Arsenal 12 Bournemouth",
    "description": "Click here to start your FREE claims check and see if you are owed You may be entitled to compensation if you had car, van or motorbike finance agreements that werent right for you or had hidden commissions. UK only. TCs apply. Read the latest Arsenal news on our website Download the AFTV app to get involved with FANZONE, pick your starting XI and rate the players after every match! Subscribe to DR Sports to see your AFTV favourites involved in even more sports and entertainment content! Subscribe to AFTV Follow us on Instagram Follow us on X Follow us on Tik Tok Follow us on Facebook Follow us on Threads Subscribe to us on Snapchat Follow us on Twitch Listen to our podcasts Shop for AFTV merch Join our Whats App channel AFTV is the largest football fan network in the world! With a bias towards Arsenal FC, we're the place where the fans' uncensored opinions can be heard before, during and after the whistle blows. Join in the banter and follow us for football previews, watchalongs, fan cams, podcasts and more! Do you have a suggestion for content that you would like to see on AFTV? Fill out this suggestion form and we might use your idea DISCLAIMER Football is a vibrant game and fans are passionate. Colourful language is sometimes used, and controversial opinions are expressed. Content is often streamed live, and we are not always able to edit or censor material in advance. VIEWER DISCRETION IS ADVISED. The thoughts, views and opinions expressed are those of the contributors and do not necessarily purport to be or reflect those of AFTV.",
    "category": "Sports",
    "publishedAt": "2025-05-03T19:16:04Z",
    "channelTitle": "AFTV",
    "viewCount": "267721",
    "likeCount": "4680",
    "commentCount": "2181",
    "duration": "PT9M19S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.17677049512987011,
    "importance": 1.0,
    "relevance": 0.118,
    "authenticity": 0.333,
    "info_gain": 0.4,
    "keywords": [
      "aftv",
      "follow",
      "arsenal",
      "content",
      "football"
    ]
  },
  {
    "Id": 24,
    "source": "YouTube",
    "region": "GB",
    "title": "I Tested the Weirdest Phones on the Internet.",
    "description": "This started as a quest to find the goofiest phones for fun...but low key there are far too many good ideas here for us to just leave them in the past Check out Bitdefender and Scamio, their free, easytouse AI chatbot for detecting and preventing scams I spend a LOT of time trying to make my videos as concise, polished and useful as possible for you if you would like to support me on that mission then consider subscribing to the channel you'd make my day For my tech hot takes For my Personal Posts For quick tech videos Does anyone still use this anymore? Amazon Affiliate links (if you buy anything through these it will support the channel and allow us to buy better gear!) Amazon US Amazon UK My Browser My Filming Gear Music is from Epidemic sound",
    "category": "Science & Technology",
    "publishedAt": "2025-05-03T12:27:17Z",
    "channelTitle": "Mrwhosetheboss",
    "viewCount": "2945713",
    "likeCount": "92608",
    "commentCount": "3817",
    "duration": "PT19M42S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.23055555555555554,
    "importance": 1.0,
    "relevance": 0.225,
    "authenticity": 0.333,
    "info_gain": 0.485,
    "keywords": [
      "amazon",
      "buy",
      "channel",
      "gear",
      "make"
    ]
  },
  {
    "Id": 25,
    "source": "YouTube",
    "region": "GB",
    "title": "F1 Sprint Highlights 2025 Miami Grand Prix",
    "description": "Catch up on all the drama from an actionpacked Sprint in Miami, featuring evolving conditions and driver collisions! For more F1 videos, visit Follow F1",
    "category": "Sports",
    "publishedAt": "2025-05-03T17:50:18Z",
    "channelTitle": "FORMULA 1",
    "viewCount": "5047723",
    "likeCount": "82395",
    "commentCount": "4405",
    "duration": "PT8M1S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5625,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.181,
    "keywords": [
      "f1",
      "miami",
      "sprint",
      "2025",
      "actionpacked"
    ]
  },
  {
    "Id": 29,
    "source": "YouTube",
    "region": "GB",
    "title": "ALL Of My English Literature GCSE 2025 Predictions",
    "description": "Join My Lessons Tuition For English, Maths Science Download the Everything Education app on Apple here Download the Everything Education app on Android here",
    "category": "Film & Animation",
    "publishedAt": "2025-05-03T10:00:06Z",
    "channelTitle": "Mr Everything English",
    "viewCount": "61551",
    "likeCount": "3534",
    "commentCount": "1666",
    "duration": "PT11M57S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.149,
    "keywords": [
      "app",
      "download",
      "education",
      "english",
      "2025"
    ]
  },
  {
    "Id": 30,
    "source": "Google News",
    "region": "GB",
    "title": "Eight arrests in connection with two separate terrorism investigations Sky News",
    "summary": "Eight arrests in connection with two separate terrorism investigations Sky News Eight men arrested in two separate antiterror operations, Met police says BBCImminent terror attack on British soil foiled The Telegraph Eight men including seven Iranians arrested in two England antiterrorism operations The Guardian Tehrans cruelty is closer than we think The Spectator",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPeURUcTAyeHFHcFVuVmFEV041NE5xelA3c3liamNRYlVzM0RfcU03YWt5N3c3ejZXM1E1elhhQTktdlVCQTF0UjZtZUxjSzFoamFkVEpQSlVOTkhERkVwOWR6dlZrN3g0ZllrT2pxVWcxZjZPVVRWZGlmdGwwSWFPX19KNlQxYjVadTV0bmdUTXBzejR1ZHFDbDRTTHp5LWM?oc=5",
    "published": "Sun, 04 May 2025 17:37:30 GMT",
    "sentiment": 0.0,
    "importance": 0.667,
    "relevance": 0.521,
    "authenticity": 0.6,
    "info_gain": 0.269,
    "keywords": [
      "separate",
      "arrested",
      "arrests",
      "connection",
      "investigations"
    ]
  },
  {
    "Id": 31,
    "source": "Google News",
    "region": "GB",
    "title": "Trump orders reopening of notorious Alcatraz prison BBC",
    "summary": "Trump orders reopening of notorious Alcatraz prison BBC View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFBUQWV1SVl0RHh3cUplb2M4cHU2X1VEOWRXTklnR2R0OEtlcTJKOWFrdkg1cDVXRGlkbDYxM2tTSTdETHlNSURua05VNjNDdFQtQWFzOTJIZXBpQXNK0gFiQVVfeXFMTTBjNWUzUFkwQmRpekdkSExoZTl5X2pIZmJhRE8xeU5NZTdETG9reVZ5bEhfVTB5NGhIaXZERXlEb3RYbE14QUFsUGtPbEN0OHZyeGwzd0x6THNBeHdBb3YyY3c?oc=5",
    "published": "Mon, 05 May 2025 01:00:36 GMT",
    "sentiment": 0.35,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.089,
    "keywords": [
      "alcatraz",
      "bbc",
      "notorious",
      "orders",
      "prison"
    ]
  },
  {
    "Id": 32,
    "source": "Google News",
    "region": "GB",
    "title": "Trump announces 100 tariffs on movies produced in foreign lands The Guardian",
    "summary": "Trump announces 100 tariffs on movies produced in foreign lands The Guardian Trump says nonUS movies to be hit with 100 tariffs BBC Donald Trump announces 100 tariff on nonUS movies as film industry 'dying' Sky News Donald Trump says he will impose 100 tariff on movies made abroad Financial Times Trump Says He Will Put 100 Tariff on Movies Made Outside U.S. The New York Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxOT21xOV9zWEd4QzBKdGZfRWtoU00wRGhmR194dlBDUjFYSjN6MTAzNnctcldwZC1jbFdRNG0tTjZrNG1JVV8wcndRTFJjLWVHbzU2S3kzeUc3anU1M1RmbWFpaEs2aUhxNXdYX3VnamJINlBEZVA1dnowdU9jYktLVV93?oc=5",
    "published": "Mon, 05 May 2025 01:47:00 GMT",
    "sentiment": -0.022727272727272728,
    "importance": 0.8,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.303,
    "keywords": [
      "100",
      "movies",
      "trump",
      "announces",
      "says"
    ]
  },
  {
    "Id": 33,
    "source": "Google News",
    "region": "GB",
    "title": "Reform UK to resist housing asylum seekers in its council areas, chair says The Guardian",
    "summary": "Reform UK to resist housing asylum seekers in its council areas, chair says The Guardian Reform considers legal challenges against asylum hotels BBC Unison chief tells staff at Reformcontrolled councils to join union The Guardian What might Reform do with its newly won power? BBC Farages plans could cost councils more warns council leader ousted by Reform Channel 4",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQMWI3cy0zYjdVa3UwdTVnYjR3QUVHWHFSV1NxTzAzZGJOejV3UzdtMS1uS3pYUlpSTEd3X1ZDYzRPRUp3eDM1cjlUbUppVXVKM0VQM1V6azZieGxZaWc0SGFmSE9SX3V5OE5waVVsNUdoTkRQQUJrcy1CWnhrcVRnMGxfNzFneU5HY0lHLUpaTGtDYjlWTnljUjdsTWZtSHVIYTNtV19jRkk3UFYzX0hqazIxc2lHUnRySGJGWENiY2M?oc=5",
    "published": "Sun, 04 May 2025 17:35:00 GMT",
    "sentiment": 0.2787878787878788,
    "importance": 0.667,
    "relevance": 0.451,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "reform",
      "asylum",
      "council",
      "guardian",
      "areas"
    ]
  },
  {
    "Id": 34,
    "source": "Google News",
    "region": "GB",
    "title": "Need to use nuclear weapons has not arisen in Ukraine, says Putin The Guardian",
    "summary": "Need to use nuclear weapons has not arisen in Ukraine, says Putin The Guardian Ukraine war latest Putin says he hopes there will be no need to use nuclear weapons in Ukraine Sky News Moscow has means to bring Ukraine war to logical conclusion, Putin says politico.eu Putin expresses hope that nuclear weapons will not be needed in Ukraine Al Jazeera Putin claims he hopes nuclear weapons will not be needed in Ukraine The Independent",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxPRWxqeERPTVNsRThKb21URnpTMzZiX3lhX0dHOU1qd3lsT3RpLTZRLVlMb0F3ZlJTUUxrdmNsRjlSUDRCdG5fbVhGSUR3aDdQVVVfa0dQa0RKOHRSVTdkUGlhbGxtYk42Wm1yUlRiX21VVzg2UkUtWnRSQmhYNFUxWVFucEt4Y0hMQlc1U2RtOHZBQ0luSUZUeGdnc3VFblNoSktIRmpSbHVXc2EzOGRkeGNIRXQ?oc=5",
    "published": "Sun, 04 May 2025 20:03:00 GMT",
    "sentiment": 0.25,
    "importance": 0.667,
    "relevance": 0.375,
    "authenticity": 0.6,
    "info_gain": 0.264,
    "keywords": [
      "ukraine",
      "putin",
      "nuclear",
      "weapons",
      "says"
    ]
  },
  {
    "Id": 35,
    "source": "Google News",
    "region": "GB",
    "title": "Farright candidate wins first round of Romanias election rerun Financial Times",
    "summary": "Farright candidate wins first round of Romanias election rerun Financial Times Nationalist Simion ahead in Romanian election rerun BBC Why the EU and Nato fear Romanias hardright presidential frontrunner Financial Times Farright Trump ally secures decisive win in first round of Romanias presidential election rerun The Guardian Farright Simion tops first round of Romanias presidential election Al Jazeera",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTE1pUGNmbzdqYW5VdG8wSi1OdldCSFc2ZVdZNXpmSkpIQ25qRFh5Z09BeWV6ZFoxZWFuNXc3TkxHVFkxZ1BxLXBTai1sUGVhczRrTzF3RFJDQlYyRWNzbk1mM1RSTUFMR3ljcV9nY1ZjRFk?oc=5",
    "published": "Sun, 04 May 2025 18:18:34 GMT",
    "sentiment": 0.1142857142857143,
    "importance": 0.667,
    "relevance": 0.483,
    "authenticity": 0.6,
    "info_gain": 0.237,
    "keywords": [
      "election",
      "romanias",
      "farright",
      "rerun",
      "round"
    ]
  },
  {
    "Id": 36,
    "source": "Google News",
    "region": "GB",
    "title": "Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail Sky News",
    "summary": "Fourteen children arrested on suspicion of manslaughter over Gateshead fire released on bail Sky News Gateshead fire death Layton Carr's school 'heartbroken' BBC Gateshead 14 children arrested after boy dies in fire The Guardian Pictured Boy killed in Gateshead industrial estate fire 14 children arrested on suspicion of manslaughter Sky News More than 13,000 raised for family of boy who died in fire Kent Online",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMixwFBVV95cUxPRlFRZ1J4SXltRXpZQ3cyOENycW9PWV9KUFZKcDdhMFU5eFZMVFMza0hSakp6WkFzWjI1N2U1RDctSTdTdDl4Y2pzOGpCRnkwSEhYZU4wNjFKV3JBVHA3d3BZWkYyMW9BQW1hMzNzZC0zVG1rbDMyc1Z3YnRvUU96ZXpLWWVqbFd4U1BsakRlVUprSG9KQWdJTlBzZnBYazV2THNqT1FaSDVucXlDRGNjZUdFaDVySmhNbG1QZnBfZXpwMXUyZ29r0gHMAUFVX3lxTE12NDBPeDhwWEo4WmJBOE9nUDE5YWdFc1BWZGNQWFNEVnhDSnhnQUNvUG1IbUVTYXhqN0xDQmtMMUJieVJrMVZuVXh0dHR3NVdTenFKV29sT2s1WXB1aldOYnhIazFNRHZxY0lZMXpjS3VjaWdvR2RzM2M1T2hDMEttOVdwWlUxcHhkMDZOV2toRFh2NnpuZnUzRWZENy1pQmFSSWNBWDQ5UFVmUUVPRThZVVhtMWlvVVk3SWhESzVjdnJkSGdFWVl4eHFaRg?oc=5",
    "published": "Mon, 05 May 2025 02:17:11 GMT",
    "sentiment": 0.15,
    "importance": 0.8,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.29,
    "keywords": [
      "gateshead",
      "arrested",
      "children",
      "boy",
      "manslaughter"
    ]
  },
  {
    "Id": 37,
    "source": "Google News",
    "region": "GB",
    "title": "Royal Family hopes nothing distracts from VE Day commemorations BBC",
    "summary": "Royal Family hopes nothing distracts from VE Day commemorations BBCVE Day Veterans to join King for tea party as Keir Starmer praises 'selfless dedication' Sky News Starmer praises selfless dedication of armed forces before VE Day anniversary The Guardian104yearold VE Day hero invited to Buckingham Palace tea The Telegraph Royals put Prince Harry drama behind them to celebrate war heroes on VE Day 80 Daily Mail",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiXEFVX3lxTFA5V3B3Q2JRN19WU2o0UkI5N2QxRlI5UG11WFRkazk1TmFMeTdhYV8ta3ZUWEw1Rm9jNGlOQnd6dmNZd1FhQjdBczRBbktBTXdseDhTNWc0bkV6QnJk0gFiQVVfeXFMUHNmNW9IVUx4RktHOGMzNmhRT3Qwam96UWhOZGFjXzNUM2Z1T3NmcXctc2doc2s3SFpiS3BDSXQ3d0xRUklqN3JNTDV6Zm04VXotVU9sVG9WN282V0hOT0xVTUE?oc=5",
    "published": "Sun, 04 May 2025 23:07:54 GMT",
    "sentiment": -0.2,
    "importance": 0.667,
    "relevance": 0.439,
    "authenticity": 0.6,
    "info_gain": 0.342,
    "keywords": [
      "day",
      "ve",
      "commemorations",
      "dedication",
      "distracts"
    ]
  },
  {
    "Id": 38,
    "source": "Google News",
    "region": "GB",
    "title": "Plymouth VE Day 2025 plans announced as roads close for street parties Plymouth Live",
    "summary": "Plymouth VE Day 2025 plans announced as roads close for street parties Plymouth Live Red Arrows, royals and street parties What to look out for on VE Day at 80 BBCVE Day flypast route When and where to watch Sky News VE Day Thanksgiving service takes place in Belfast BBCVE Day 80 years on share your photos and memories The Guardian",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxOLXQzcHI5THBWQTdXZ1VZUDNMcjlvaUx1alhWZGxoemFQdlRPdlRpZUpYSHktQ3pWMFFmS0JLLUNuaWJGRTFDdDBHREdlUWhfZWRTNHVjYWRTMEg0ZE5hOGMtRDlDQTJjTVlJNFpudzFtbVk2cmw1ZmI4OXMyd01mR0U3NVRLZElQN2hVcFQxRmsySkpqcEHSAZsBQVVfeXFMT1VkR1kyS25GTTBWVW5VYTNHYW44cnp1NzVybmRmT0JudWdRdzRKRDdMYnRFVWlTcHFId0ZJX3VsNWNqWE54QU12cnNITTRCM09ianpPVlQycjc5OUdwekgxUVhaOXJJQjFmUWNmUG1KVVlMS25GcWUwZUtzZDlHcG9PSThzVHBpbEtvdmltaVNJZ0JsNVktWHhrWmc?oc=5",
    "published": "Sun, 04 May 2025 15:00:00 GMT",
    "sentiment": 0.0909090909090909,
    "importance": 0.667,
    "relevance": 0.445,
    "authenticity": 0.6,
    "info_gain": 0.296,
    "keywords": [
      "day",
      "plymouth",
      "ve",
      "parties",
      "street"
    ]
  },
  {
    "Id": 39,
    "source": "Google News",
    "region": "GB",
    "title": "Infected blood scandal Victims 'scared they won't live to see compensation' Sky News",
    "summary": "Infected blood scandal Victims 'scared they won't live to see compensation' Sky News View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxNZ1gwNm1SajZVeWZUMDVZbVA1UGkxZk9QRlJDLTRQQy1FUXBaV1lsdnNjR0gyejJ6V2l5RzNrR3I0bkJuQzJTdDEwQ0pnQjFFcUNVUGhxUWdsQ2hzS3pOMUJHWnBPZDJpT2lyQXB6dnZMa252Zkd1NlRIT0xOMmNtSEdYRC1WNTFWcGwwNnF5TFRfbnpHWGF2Nl9LSkpSV3Q0UU5oc3pCUmhuR0h40gGyAUFVX3lxTE8zWnZLNEl2STFSclpIN0ZqUEl2QlM5VTRFUXpWQzg4a3A4TXJpclA5bkZzbmVfYVQycnc2bExabTZNeWI5a3JXNEw2R3g4b2d6M080UEdmRFBLSmhadzBQRDlUTG5pRVlCSFpUeUFsTWF4NGdYWDROejdWZHVpQzdyRFlJLW1hWk5OeVBkNGJLNlh0MnJtckF0RDVwU3FoNWJvUDRNM1hlbmlvZzVnbnZoUFE?oc=5",
    "published": "Sun, 04 May 2025 23:06:43 GMT",
    "sentiment": 0.20757575757575755,
    "importance": 0.667,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.123,
    "keywords": [
      "news",
      "blood",
      "compensation",
      "infected",
      "live"
    ]
  },
  {
    "Id": 46,
    "source": "YouTube",
    "region": "PK",
    "title": "Laalach buri bala hai",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-05-01T14:33:22Z",
    "channelTitle": "Jahaann",
    "viewCount": "15709977",
    "likeCount": "875918",
    "commentCount": "1303",
    "duration": "PT1M5S",
    "definition": "hd",
    "language": "id",
    "translated": "Greed is bad",
    "sentiment": 0.0,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.021,
    "keywords": [
      "bala",
      "buri",
      "hai",
      "laalach"
    ]
  },
  {
    "Id": 48,
    "source": "YouTube",
    "region": "PK",
    "title": "Papa mummy The most viral comedy by maapapa",
    "description": "",
    "category": "Music",
    "publishedAt": "2025-04-29T07:39:58Z",
    "channelTitle": "up wala aryan",
    "viewCount": "28975657",
    "likeCount": "665267",
    "commentCount": "1188",
    "duration": "PT25S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.5,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.047,
    "keywords": [
      "comedy",
      "maapapa",
      "mummy",
      "papa",
      "viral"
    ]
  },
  {
    "Id": 49,
    "source": "YouTube",
    "region": "PK",
    "title": "Squid Game",
    "description": "",
    "category": "Entertainment",
    "publishedAt": "2025-04-30T14:15:03Z",
    "channelTitle": "Jomy Production",
    "viewCount": "19138360",
    "likeCount": "1143992",
    "commentCount": "383",
    "duration": "PT1M",
    "definition": "hd",
    "language": "ca",
    "translated": "Squid Game",
    "sentiment": -0.4,
    "importance": 1.0,
    "relevance": 1.0,
    "authenticity": 0.333,
    "info_gain": 0.009,
    "keywords": [
      "game",
      "squid"
    ]
  },
  {
    "Id": 50,
    "source": "Google News",
    "region": "PK",
    "title": "Armed Forces fully prepared, resolute to defend country, leadership informed RADIO PAKISTAN",
    "summary": "Armed Forces fully prepared, resolute to defend country, leadership informed RADIO PAKISTANDG ISPR says armed forces ready to give befitting reply to enemys aggression state media Dawn Army vows 'befitting reply' to aggression The Express Tribune Pakistan rejects India's Pahalgam allegations with evidence, ambassador issues warning SamaaNews Pakistan to hold key national security briefing for political parties today amid India tensions Arab News PK",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxQcF9fVklLTkJlQ0Zza3JpYlRxcTUzeWJGVVA4Ynp3ZDJYeU4yY0RpR0R2Nndabllfam1MY1FvRjNmMHNBLTRuc3pwaXBLS0V0TmltVFVJanVuZ01tYkdXemRpZjZhR3pGRW1TNTFubHZHU1NOSElvcWd0MU0zVVRVR0Q0dURwNldYVTNFaDFPNlRmNVprdWFmZ0J4bG1WZXNGR2Y5bm5LNEt3b0piWTdz?oc=5",
    "published": "Mon, 05 May 2025 04:06:57 GMT",
    "sentiment": 0.06666666666666667,
    "importance": 0.8,
    "relevance": 0.439,
    "authenticity": 0.6,
    "info_gain": 0.375,
    "keywords": [
      "armed",
      "forces",
      "pakistan",
      "aggression",
      "befitting"
    ]
  },
  {
    "Id": 51,
    "source": "Google News",
    "region": "PK",
    "title": "Air strikes by India imminent? Business Recorder",
    "summary": "Air strikes by India imminent? Business Recorder IAF chief briefs PM Modi on force's op readiness Times of India Defence Minister Rajnath Singh says Under PM Modis leadership, what you desire will certainly happen The Hindu PM meets Air Chief Marshal amid rising tensions with Pak over Pahalgam attack India Today Highlights Pakistan Opens Firing Across Lo C Again, Air Force Chief Meets PM Modi NDTV",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE1CWjJKbkNMM0x4WEpOdEhmS3lUT1MxZkVXbC1HaHBNUkdBSTd4dXlROEcwQ1RUdjFpbExFSEo0SHhUbV9ZY2tJZF9NM2I1ajBlZHY5NnhWb0hXZXRmRkIxS3hkamlXMktOa2ozNG9KSk9NVlVlOFoxc9IBVkFVX3lxTE9fNGpxTVJHakhTMFlaWl8tSDhScUgtXzl1akVyYkNiSms3ZndqZVBEcEg5ZXZNdG5rSlBPTUE5eGZOVWtCXzVJVFNQUW5aUG9nVWs4WDdB?oc=5",
    "published": "Mon, 05 May 2025 01:14:43 GMT",
    "sentiment": 0.21428571428571427,
    "importance": 0.8,
    "relevance": 0.457,
    "authenticity": 0.6,
    "info_gain": 0.381,
    "keywords": [
      "air",
      "india",
      "pm",
      "chief",
      "business"
    ]
  },
  {
    "Id": 52,
    "source": "Google News",
    "region": "PK",
    "title": "Maryam chairs School Education Dept special meeting The News International",
    "summary": "Maryam chairs School Education Dept special meeting The News International CM Maryam orders overhaul of Punjabs school education system nation.com.pk Punjab enrolls record 1.1m outofschool children Associated Press of Pakistan Punjab govt completes outsourcing of over 11,000 schools RADIO PAKISTAN1.1 million outofschool children enrolled The Express Tribune",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilwFBVV95cUxOTDZsWkdnbU5hRG1fZ2JrVzNHcEw3elN1VmNTV1piSjJ6THVOT0swMTRTMlc1eW4xVzk2ZWpXVUxPdHAwS21oN2E4SmFzY0RhX01QaDE3SUtwcU1LdXRuaDNRWHNRQ2I1QU9Kbkh5Zl9YRU9scnFyMjhhWDhMRGRxWks0eFhZS0xKS1JERUs2ZGg3a1kzWjNJ?oc=5",
    "published": "Sun, 04 May 2025 23:32:23 GMT",
    "sentiment": 0.17857142857142858,
    "importance": 0.667,
    "relevance": 0.585,
    "authenticity": 0.6,
    "info_gain": 0.289,
    "keywords": [
      "education",
      "maryam",
      "school",
      "chairs",
      "children"
    ]
  },
  {
    "Id": 53,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan to knock on UNSC door amid escalation Dawn",
    "summary": "Pakistan to knock on UNSC door amid escalation Dawn The rising tension between India and Pakistan, briefly explained vox.com IndiaPak Tensions UN Security Council To Hold Closed Consultations Today NDTVUNSC to hold closed consultations on IndiaPakistan tension over Pahalgam attack today Hindustan Times Pakistan to brief UNSC on latest regional developments RADIO PAKISTAN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiSEFVX3lxTE9VeW5RSk1GZ3BPcENtcWZCd2JBZzdUUWxBR0JENW9FRllGQzJiaEF2WlRpX0tSc2Z2anppb05KZV9FZkUzek1radIBTkFVX3lxTFB6Tm5Ud1cxT3RIWTJBbk0xaG1NdGw2dGtmS2dGWlV1R0VjRDVCc1dYUUZLdG1zTkVvUW9kNDd3NjUtN09nZ3VVcmxheEJSQQ?oc=5",
    "published": "Mon, 05 May 2025 00:26:04 GMT",
    "sentiment": 0.06,
    "importance": 0.8,
    "relevance": 0.537,
    "authenticity": 0.6,
    "info_gain": 0.302,
    "keywords": [
      "pakistan",
      "unsc",
      "amid",
      "closed",
      "consultations"
    ]
  },
  {
    "Id": 54,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan vows 'full spectrum' response to Indian aggression The Express Tribune",
    "summary": "Pakistan vows 'full spectrum' response to Indian aggression The Express Tribune View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxPanlJaVAtVXJzelJJd1FJWW9YWnc3Q3VIQjZGN1pSNEdMdmJzSHdkSHBTQkNLcDdTR1NiNTdCS281YWlXNHdaWFJjVGNoQjJuMnR0clhMVDZHcDROTHVDOGVoel9fUThGa1pqT0xteUNsVlAzU0MzRlVGVGtkcEotRDBqbkY4YzZ1QmJHWkJSY0hKNGcwV0ZpY1F30gGiAUFVX3lxTE44ZC1zcnJKc2NxcU9NQ0xhZ0hnLTJPLTFWUHRZeDEybDZ0MW9pbWNJRGFJbjRHMEdyOUlQaGpSQlB2Z3NBRV9BSndDb0hXbDRZWHdlVFFLcUh1QzFTVjMtdl9GU09tOHpDWk1scTRrcFJ1UDJ2bFNCcHlWaE5pQjZlOTU0RDN6aURhSnVFU0VBTXRUQlVoeE1STjk4cE9hYkpWQQ?oc=5",
    "published": "Sun, 04 May 2025 14:40:26 GMT",
    "sentiment": 0.3499999999999999,
    "importance": 0.667,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.109,
    "keywords": [
      "aggression",
      "express",
      "indian",
      "pakistan",
      "response"
    ]
  },
  {
    "Id": 55,
    "source": "Google News",
    "region": "PK",
    "title": "India bans X accounts of Imran, Bilawal Dawn",
    "summary": "India bans X accounts of Imran, Bilawal Dawn After India puts ban on Pakistani artists, Youtube channels and Instagram accounts of actors like Hania A Times of India Hania Aamir reacts as Indian fans use VPN to get access to her Instagram India Today'Digital crackdown' India blocks Pakistani celebrities on social media Geo.tv Info Ministers social media account blocked in India RADIO PAKISTAN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTE1QZl9qc2FBMFFuR2J3RGRsczNpR0p0bWhmMTNWYzhybXdTMEFERFU2cUJtZ0Q3UDFvUURkYThoeDFJS3ZsMnVZYWlzQ0RsNy1SaFRwbmU1WS1xdlRtVXNsNXBScE5jSmxLSWZNeFpiOXFYRTNzamhxY0xZZWfSAU5BVV95cUxPSVliNVk5Ui1jX3g5amEtVU13MVVSVzEtcWlKeGxocmpCNEFUZXJmVERKWTh1anBYQ3dPSUZ3eW4yU1JjTXNHYi1RajNXZFE?oc=5",
    "published": "Mon, 05 May 2025 00:26:04 GMT",
    "sentiment": 0.022222222222222223,
    "importance": 0.8,
    "relevance": 0.469,
    "authenticity": 0.6,
    "info_gain": 0.329,
    "keywords": [
      "india",
      "accounts",
      "bans",
      "bilawal",
      "dawn"
    ]
  },
  {
    "Id": 56,
    "source": "Google News",
    "region": "PK",
    "title": "Iranian FM Abbas Araghchi to visit Pakistan ahead of his trip to India Reports Hindustan Times",
    "summary": "Iranian FM Abbas Araghchi to visit Pakistan ahead of his trip to India Reports Hindustan Times Irans FM arrives today amid PakIndia tensions nation.com.pk Iran minister to visit India and Pakistan; government rules out mediation Times of India Iranian FM to visit Pakistan amid regional tensions The Express TribuneWe Seek DeEscalation Iran's Foreign Minister Lands In Islamabad Ahead Of His India Visit News18 News18",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMi2AFBVV95cUxNajlXaWxPc3VKNS1GTW5PZzV0YnBoS3VMYVBmaC02ck80VXA0QlI5YkRBU2ZhN1kwMGpDTHVEOS1wVk9PcTcwejY4SlVaX3E3QVYtWi1ZRi1TQjdWNzg4d1F5MzlIR0ZCQ1l3YkhJODBoeG1NdEV3dG1VejIycVdDZkFRcUk2Z2l2bkM4TmdYaGdYSFpxVHFReFp1TDFFQWRkYnl1THpFTVJlOEhvc2dDWWMxbUlmVXdhUXRYd2hPZzhoanF5WU00bE55Y1dYQVZ2S0VkZDZCR00?oc=5",
    "published": "Sun, 04 May 2025 15:17:13 GMT",
    "sentiment": -0.125,
    "importance": 0.667,
    "relevance": 0.417,
    "authenticity": 0.6,
    "info_gain": 0.316,
    "keywords": [
      "india",
      "visit",
      "fm",
      "pakistan",
      "ahead"
    ]
  },
  {
    "Id": 57,
    "source": "Google News",
    "region": "PK",
    "title": "Pakistan welcomes Sikh pilgrims at Kartarpur amid India escalating moves Pakistan Today",
    "summary": "Pakistan welcomes Sikh pilgrims at Kartarpur amid India escalating moves Pakistan Today Indian Sikhs continue to visit Kartarpur despite rising tensions Dawn Pahalgam attack leads to sharp dip in Kartarpur Sahib pilgrimage Times of India IndiaPak tension Kartarpur Corridor sees 50 dip in Sikh pilgrim footfall Hindustan Times",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiuAFBVV95cUxNYml3UU9vSTNxdWJFZkx5Q0dGdnJJSEEwNXlvT1JnbjBHUlByd2F6c0s4ZE1HWU83ajNZd0VnMlh4MWFzTDRzOFNVNnZlOFhDczZ0UUg4RTBWRndXd0txSVk2X1c5S2ZVaUpZdU9CcVFlM2I4VGRaMG9xZ1U4dncwTFlNOXM4WkFFaHhpS1RCTVRYTkNpUVNJMldDamNkVjBobnlqOWp4SUhUZG9nNXFxTGJjZ2M2dm5B?oc=5",
    "published": "Sun, 04 May 2025 19:44:53 GMT",
    "sentiment": -0.125,
    "importance": 0.667,
    "relevance": 0.555,
    "authenticity": 0.6,
    "info_gain": 0.249,
    "keywords": [
      "kartarpur",
      "pakistan",
      "india",
      "sikh",
      "amid"
    ]
  },
  {
    "Id": 58,
    "source": "Google News",
    "region": "PK",
    "title": "USC employees observe strike against layoffs Dawn",
    "summary": "USC employees observe strike against layoffs Dawn IMF tasks Pakistan to terminate Utility Stores employees by June 30 nation.com.pk Rightsizing plan 2,800 more USC employees removed from service The News International Utility Stores dismisses 3,500 contract workers SamaaNews Utility Stores Corporation Shuts Down 1,800 Outlets Due to Heavy Losses Pro Pakistani",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiSEFVX3lxTFAwOU9uMENadDBjWGxRc3RkSjhDNGZoY2x6eHdJRXlpTU1KUUt4eXNaWWMxZ0t2ZkVqLWtsbUp1OU8xbFZqdHlvSw?oc=5",
    "published": "Sun, 04 May 2025 01:16:42 GMT",
    "sentiment": 0.003888888888888886,
    "importance": 0.533,
    "relevance": 0.575,
    "authenticity": 0.6,
    "info_gain": 0.309,
    "keywords": [
      "employees",
      "stores",
      "usc",
      "utility",
      "800"
    ]
  },
  {
    "Id": 59,
    "source": "Google News",
    "region": "PK",
    "title": "Commission finalises report on Indus treaty violations Dawn",
    "summary": "Commission finalises report on Indus treaty violations Dawn Pakistan testfires ballistic missile as tensions with India rise Al Jazeera India starts work on hydro projects after suspending treaty with Pakistan, sources say Reuters India cuts off water flow to Pakistan from dam on river Chenab Hindustan Times Breaking the Dam How India Can Abrogate the Indus Waters Treaty Geopolitical Monitor",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiSEFVX3lxTE1wOUNhdWxmaDdUMTdXd0hoTm95Nm1yZE9hM2Z0TmpzNVg0RnlhVFc0dVFCY3QtakVCQTlTWDAySU5rT1YxMlgweQ?oc=5",
    "published": "Mon, 05 May 2025 00:26:04 GMT",
    "sentiment": 0.0,
    "importance": 0.8,
    "relevance": 0.49,
    "authenticity": 0.6,
    "info_gain": 0.322,
    "keywords": [
      "india",
      "treaty",
      "indus",
      "pakistan",
      "commission"
    ]
  },
  {
    "Id": 19,
    "source": "Google News",
    "region": "US",
    "title": "Ohio deputy fatally struck by man whose son had been shot by police Authorities ABC News",
    "summary": "Ohio deputy fatally struck by man whose son had been shot by police Authorities ABC News Father charged with killing deputy a day after police killed son BBC Death of sheriff's deputy is first alleged murder of police officer in 5 years within Greater Cincinnati WLWT Father Whose Son Was Shot by Cincinnati Police Hits Deputy With Car, Killing Him The New York Times Cincinnati police fatally shot an armed 18yearold. The next day, his father killed a sheriffs deputy, authorities say CNN",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMilgFBVV95cUxPU0pENzRsV2JqcDV1UlduUjF1UFVONTJ3X1dyYVd5RlFtdTMwYjFVdF80enZmX240OG0xY1ZaWUhMOG5aaFlUd2xXY19jaFplMldQWTFleGxiSEtRa3dCLUNzZW1HaDZWUTZpa3Y2MzhITk5ZQXQxenpIMmZpb3dMelRHbnc4UF9VNXc2V0tjTEFzRnRWU3fSAZsBQVVfeXFMUFRwNGluUUphSDdfb3ZLTWlRdmFvUFZZRThlT2lKNnFoNm9XTGItOHI1NDVSQlVaNzI4dDJkQUxESlBSTDU4c0tHSVUzTUV4eldFQnRlZ1VqTm1hSDZ3MUN1UG90X1RXWk5qSzNadi1jRDczeER4LUlXVlFTQkJIQVZmOFduZ2NpaVNHRng2T2lwNXpKMzA4MzhPUzQ?oc=5",
    "published": "Mon, 05 May 2025 01:43:27 GMT",
    "sentiment": 0.055194805194805185,
    "importance": 0.8,
    "relevance": 0.337,
    "authenticity": 0.6,
    "info_gain": 0.429,
    "keywords": [
      "deputy",
      "police",
      "shot",
      "son",
      "authorities"
    ]
  },
  {
    "Id": 29,
    "source": "YouTube",
    "region": "GB",
    "title": "LAAL PARI (Song) Yo Yo Honey Singh Sajid Nadiadwala Tarun Mansukhani Housefull 5 6th June",
    "description": "Get your groove on with \"LAAL PARI (Song)\" from the India's Biggest Franchise \"Housefull 5\". Starring Akshay Kumar, Abhishek Bachchan, Riteish Deshmukh, Jacqueline Fernandez, Sonam Bajwa, Nargis Fakhri, Sanjay Dutt, Jackie Shroff, Nana Patekar, Chitrangada Singh, Fardeen Khan, Chunky Pandey, Johnny Lever, Shreyas Talpade, Dino Morea, Ranjeet, Soundarya Sharma, Nikitin Dheer, and Akashdeep Sabir. Produced by Sajid Nadiadwala Directed by Tarun Mansukhani Story Screenplay by Sajid Nadiadwala Housefull 5 Releases in cinemas on 6th June 2025 Full Song Available on Jio Saavn Spotify Hungama Apple Music Gaana Amazon Prime Music You Tube Music Credits Singers Yo Yo Honey Singh, Simar Kaur Music Yo Yo Honey Singh Lyrics Yo Yo Honey Singh, Alfaaz Mix Master Vinod Verma Promo Edit Yash Parikh Choreography By Remo D Souza Song Audio Conceived by Dinesh Auluck Music Label TSeries Download Desibeats Download Tapbeats Enjoy stay connected with us! Subscribe to TSeries Like us on Facebook Follow us on X Follow us on Instagram Follow us on Snapchat",
    "category": "Music",
    "publishedAt": "2025-05-03T06:30:07Z",
    "channelTitle": "T-Series",
    "viewCount": "27223669",
    "likeCount": "632194",
    "commentCount": "36955",
    "duration": "PT3M5S",
    "definition": "hd",
    "language": "en",
    "sentiment": 0.4166666666666667,
    "importance": 1.0,
    "relevance": 0.188,
    "authenticity": 0.333,
    "info_gain": 0.465,
    "keywords": [
      "yo",
      "music",
      "singh",
      "honey",
      "song"
    ]
  },
  {
    "Id": 31,
    "source": "Google News",
    "region": "GB",
    "title": "Trump calls for reopening of Alcatraz to house 'most ruthless and violent offenders' Sky News",
    "summary": "Trump calls for reopening of Alcatraz to house 'most ruthless and violent offenders' Sky News View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiugFBVV95cUxNbnY2VDZoT3V6aHNyYVNaTUFJRWY1cDdFZWVtVjY2bG5kR1pJakdPQjJwWXJKRkdDZnBSUU9jN0JVaF96Nkl6SVNaSUUxWWEyNHcyb3VaUWhvMGl2QllHcDJoNjBTUTZGajU1U1lKcXRRWS1CcWpZOGN5cU9INi1RZ25QTXNLNGhuQlAwSml4N0hQZW1jR0d2LXFkazAwVlZNYjBGNDdhVklnNmVPaXFVYWNLSXhMbW5tZHfSAb8BQVVfeXFMT01Sb2lkYzVJMlZyaUFYaVpkMXIzVFV0bVVPZkIzVzZpMWJ6S0c0bVhLWW5TcEQ2cG1KYXJsQ0tBQWFvVGY1bUtrQklkV08yTTlpQlh1dW5sZkZnaHg2elptNEtXQlZjOXRhN3hRbVBfaEtLWGxYOUEySEl4VDdEOGhBM2lTam4xYzRiQlhiY0FvWmtpUDA2b2VpdzM1RURHd0pXYUdXVnhiLW5PMENkbUtYMWJldmlnWTV0N3JXRW8?oc=5",
    "published": "Mon, 05 May 2025 04:52:30 GMT",
    "sentiment": -0.32142857142857145,
    "importance": 0.8,
    "relevance": 0.926,
    "authenticity": 0.6,
    "info_gain": 0.13,
    "keywords": [
      "news",
      "alcatraz",
      "calls",
      "house",
      "offenders"
    ]
  },
  {
    "Id": 35,
    "source": "Google News",
    "region": "GB",
    "title": "Gateshead fire death Layton Carr's school 'heartbroken' BBC",
    "summary": "Gateshead fire death Layton Carr's school 'heartbroken' BBC View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiWkFVX3lxTE5PY2EzMGo1MWl0VW9ja2tNWkwzdHpMQTE1Sm00OXIwdE5XMmJUZHliT19WeEl2Q0FxNDEzWlg5alZLemVrT1V5R2g2cV9IeWp6NVZzRzYtaFV2Z9IBX0FVX3lxTE1SQ0tsd0t2TUJNbVQzLXg3Mk43WGdQNEFqbXFBaUtFdWxOMjhMblpIeVR1TEt3OVZTcXBSUzB0X3FZbWVnOFY4WGRfWmw5dFBGdno0aUpCWjZVSXRJRVY0?oc=5",
    "published": "Mon, 05 May 2025 00:48:46 GMT",
    "sentiment": 0.35,
    "importance": 0.8,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.096,
    "keywords": [
      "bbc",
      "carr",
      "death",
      "gateshead",
      "heartbroken"
    ]
  },
  {
    "Id": 39,
    "source": "Google News",
    "region": "GB",
    "title": "Labour M Ps press Keir Starmer to rethink benefits cuts after local elections Financial Times",
    "summary": "Labour M Ps press Keir Starmer to rethink benefits cuts after local elections Financial Times Labour must avoid naive lurch to right after Reform success, Haigh warns The Guardian Raise taxes to fight off Nigel Farage, Keir Starmer told The Times Labour MP says government must change course BBC'I get it' Starmer responds after losing Runcorn byelection to Nigel Farage's Reform UK Sky News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMicEFVX3lxTFB4anZ4MXZ1QUdWd0RDRzdqa2kwVkU2Y3BBdGhGNVUzeFRBcDFuQUVGdW5LX1VFZUZUYWFNcVRsTTRsZG8zSTBXeWdMX0VVXzRXcWx2aWRHNWRJS2NidGQ4dG9qTDdsdjM5TXlvWXE4QVk?oc=5",
    "published": "Sun, 04 May 2025 17:00:24 GMT",
    "sentiment": 0.04081632653061224,
    "importance": 0.667,
    "relevance": 0.422,
    "authenticity": 0.6,
    "info_gain": 0.329,
    "keywords": [
      "labour",
      "starmer",
      "keir",
      "times",
      "benefits"
    ]
  },
  {
    "Id": 59,
    "source": "Google News",
    "region": "PK",
    "title": "IMF tasks Pakistan to terminate Utility Stores employees by June 30 ARY News",
    "summary": "IMF tasks Pakistan to terminate Utility Stores employees by June 30 ARY News IMF tasks Pakistan to terminate Utility Stores employees by June 30 nation.com.pk Rightsizing plan 2,800 more USC employees removed from service The News International Utility Stores dismisses 3,500 contract workers SamaaNews Utility Stores Corporation Shuts Down 1,800 Outlets Due to Heavy Losses Pro Pakistani",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMikAFBVV95cUxQaWdPN0M5QUpUeExWdmg5ajc5RGEtOU9ZRU1HVS1nZHZvSmljZ3FyVmdpOW1jYVlQa3gzbV9DZzMzcGFRZ0pSS1RuYU5CLXZEZmg1b2ZtTzFwRjdOaS05WE9HZGx0V0lockozM0VqeElkUlNhNW5YUWhRbzRmSHJNRy1mNFduN1lzTGQxMlRZcnPSAZYBQVVfeXFMTnV0ME4wVDJrcnQwRkViRkU3bEhIUlhKaVE2Q2RWWHEwMGFPQV90azdpc2ItWlBrZWxieEZwQTc2QlI2VU1JTThTdHpBOGl5SXpVamhka3FPVjl4T211aTZiY3NtMTcxVWFwMS1ZX2piQVNOU1A3UUNNOFl5YnUtOC1iNzNodWx5ZGE3TVJfRWo5UjRkMkp3?oc=5",
    "published": "Mon, 05 May 2025 02:18:08 GMT",
    "sentiment": 0.003888888888888886,
    "importance": 0.8,
    "relevance": 0.476,
    "authenticity": 0.6,
    "info_gain": 0.283,
    "keywords": [
      "stores",
      "utility",
      "employees",
      "30",
      "imf"
    ]
  },
  {
    "Id": 59,
    "source": "Google News",
    "region": "PK",
    "title": "India escalates tensions on the basis of allegations Maleeha Lodhi Dunya News",
    "summary": "India escalates tensions on the basis of allegations Maleeha Lodhi Dunya News View Full coverage on Google News",
    "category": "News & Politics",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPSWpXTTBBZTRLeWp5N3h4dlBCakc4SWVpTFRlVUc3M19tcE12YXVCTkRoYnI0ZHQ3ZG9oZ0VsMzdHa1Fpbnk5VWFkNXpWS2lZN09NQUxzNVdUVnBOSl9SblRPaUNjQ2ZXY05LVmdfTlpWbWl4S2RxMUF5aW9sYU91NkFrakpQSm5TRGJnNUcxNmMwejBjOGJGWG9tbXdDLUREWV8weE1tRy0tUdIBVkFVX3lxTFBQYTJSOXcyWDdoU2lZVG9GSGdtTWlZb0drTFROTkp2bW5xSDZPRnFXa3B5dDJMc0NhbW16UDJ5S1JfSmVGWmM1NmVpZjR6NWVQOWF6bW5n?oc=5",
    "published": "Sun, 04 May 2025 01:15:17 GMT",
    "sentiment": 0.35,
    "importance": 0.533,
    "relevance": 1.0,
    "authenticity": 0.6,
    "info_gain": 0.103,
    "keywords": [
      "news",
      "allegations",
      "basis",
      "dunya",
      "escalates"
    ]
  }
]